{"description":null,"eula":0,"name":"MPL-2.0","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"Mozilla Public License Version 2.0\n==================================\n\n1. Definitions\n--------------\n\n1.1. \"Contributor\"\n    means each individual or legal entity that creates, contributes to\n    the creation of, or owns Covered Software.\n\n1.2. \"Contributor Version\"\n    means the combination of the Contributions of others (if any) used\n    by a Contributor and that particular Contributor's Contribution.\n\n1.3. \"Contribution\"\n    means Covered Software of a particular Contributor.\n\n1.4. \"Covered Software\"\n    means Source Code Form to which the initial Contributor has attached\n    the notice in Exhibit A, the Executable Form of such Source Code\n    Form, and Modifications of such Source Code Form, in each case\n    including portions thereof.\n\n1.5. \"Incompatible With Secondary Licenses\"\n    means\n\n    (a) that the initial Contributor has attached the notice described\n        in Exhibit B to the Covered Software; or\n\n    (b) that the Covered Software was made available under the terms of\n        version 1.1 or earlier of the License, but not also under the\n        terms of a Secondary License.\n\n1.6. \"Executable Form\"\n    means any form of the work other than Source Code Form.\n\n1.7. \"Larger Work\"\n    means a work that combines Covered Software with other material, in \n    a separate file or files, that is not Covered Software.\n\n1.8. \"License\"\n    means this document.\n\n1.9. \"Licensable\"\n    means having the right to grant, to the maximum extent possible,\n    whether at the time of the initial grant or subsequently, any and\n    all of the rights conveyed by this License.\n\n1.10. \"Modifications\"\n    means any of the following:\n\n    (a) any file in Source Code Form that results from an addition to,\n        deletion from, or modification of the contents of Covered\n        Software; or\n\n    (b) any new file in Source Code Form that contains any Covered\n        Software.\n\n1.11. \"Patent Claims\" of a Contributor\n    means any patent claim(s), including without limitation, method,\n    process, and apparatus claims, in any patent Licensable by such\n    Contributor that would be infringed, but for the grant of the\n    License, by the making, using, selling, offering for sale, having\n    made, import, or transfer of either its Contributions or its\n    Contributor Version.\n\n1.12. \"Secondary License\"\n    means either the GNU General Public License, Version 2.0, the GNU\n    Lesser General Public License, Version 2.1, the GNU Affero General\n    Public License, Version 3.0, or any later versions of those\n    licenses.\n\n1.13. \"Source Code Form\"\n    means the form of the work preferred for making modifications.\n\n1.14. \"You\" (or \"Your\")\n    means an individual or a legal entity exercising rights under this\n    License. For legal entities, \"You\" includes any entity that\n    controls, is controlled by, or is under common control with You. For\n    purposes of this definition, \"control\" means (a) the power, direct\n    or indirect, to cause the direction or management of such entity,\n    whether by contract or otherwise, or (b) ownership of more than\n    fifty percent (50%) of the outstanding shares or beneficial\n    ownership of such entity.\n\n2. License Grants and Conditions\n--------------------------------\n\n2.1. Grants\n\nEach Contributor hereby grants You a world-wide, royalty-free,\nnon-exclusive license:\n\n(a) under intellectual property rights (other than patent or trademark)\n    Licensable by such Contributor to use, reproduce, make available,\n    modify, display, perform, distribute, and otherwise exploit its\n    Contributions, either on an unmodified basis, with Modifications, or\n    as part of a Larger Work; and\n\n(b) under Patent Claims of such Contributor to make, use, sell, offer\n    for sale, have made, import, and otherwise transfer either its\n    Contributions or its Contributor Version.\n\n2.2. Effective Date\n\nThe licenses granted in Section 2.1 with respect to any Contribution\nbecome effective for each Contribution on the date the Contributor first\ndistributes such Contribution.\n\n2.3. Limitations on Grant Scope\n\nThe licenses granted in this Section 2 are the only rights granted under\nthis License. No additional rights or licenses will be implied from the\ndistribution or licensing of Covered Software under this License.\nNotwithstanding Section 2.1(b) above, no patent license is granted by a\nContributor:\n\n(a) for any code that a Contributor has removed from Covered Software;\n    or\n\n(b) for infringements caused by: (i) Your and any other third party's\n    modifications of Covered Software, or (ii) the combination of its\n    Contributions with other software (except as part of its Contributor\n    Version); or\n\n(c) under Patent Claims infringed by Covered Software in the absence of\n    its Contributions.\n\nThis License does not grant any rights in the trademarks, service marks,\nor logos of any Contributor (except as may be necessary to comply with\nthe notice requirements in Section 3.4).\n\n2.4. Subsequent Licenses\n\nNo Contributor makes additional grants as a result of Your choice to\ndistribute the Covered Software under a subsequent version of this\nLicense (see Section 10.2) or under the terms of a Secondary License (if\npermitted under the terms of Section 3.3).\n\n2.5. Representation\n\nEach Contributor represents that the Contributor believes its\nContributions are its original creation(s) or it has sufficient rights\nto grant the rights to its Contributions conveyed by this License.\n\n2.6. Fair Use\n\nThis License is not intended to limit any rights You have under\napplicable copyright doctrines of fair use, fair dealing, or other\nequivalents.\n\n2.7. Conditions\n\nSections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted\nin Section 2.1.\n\n3. Responsibilities\n-------------------\n\n3.1. Distribution of Source Form\n\nAll distribution of Covered Software in Source Code Form, including any\nModifications that You create or to which You contribute, must be under\nthe terms of this License. You must inform recipients that the Source\nCode Form of the Covered Software is governed by the terms of this\nLicense, and how they can obtain a copy of this License. You may not\nattempt to alter or restrict the recipients' rights in the Source Code\nForm.\n\n3.2. Distribution of Executable Form\n\nIf You distribute Covered Software in Executable Form then:\n\n(a) such Covered Software must also be made available in Source Code\n    Form, as described in Section 3.1, and You must inform recipients of\n    the Executable Form how they can obtain a copy of such Source Code\n    Form by reasonable means in a timely manner, at a charge no more\n    than the cost of distribution to the recipient; and\n\n(b) You may distribute such Executable Form under the terms of this\n    License, or sublicense it under different terms, provided that the\n    license for the Executable Form does not attempt to limit or alter\n    the recipients' rights in the Source Code Form under this License.\n\n3.3. Distribution of a Larger Work\n\nYou may create and distribute a Larger Work under terms of Your choice,\nprovided that You also comply with the requirements of this License for\nthe Covered Software. If the Larger Work is a combination of Covered\nSoftware with a work governed by one or more Secondary Licenses, and the\nCovered Software is not Incompatible With Secondary Licenses, this\nLicense permits You to additionally distribute such Covered Software\nunder the terms of such Secondary License(s), so that the recipient of\nthe Larger Work may, at their option, further distribute the Covered\nSoftware under the terms of either this License or such Secondary\nLicense(s).\n\n3.4. Notices\n\nYou may not remove or alter the substance of any license notices\n(including copyright notices, patent notices, disclaimers of warranty,\nor limitations of liability) contained within the Source Code Form of\nthe Covered Software, except that You may alter any license notices to\nthe extent required to remedy known factual inaccuracies.\n\n3.5. Application of Additional Terms\n\nYou may choose to offer, and to charge a fee for, warranty, support,\nindemnity or liability obligations to one or more recipients of Covered\nSoftware. However, You may do so only on Your own behalf, and not on\nbehalf of any Contributor. You must make it absolutely clear that any\nsuch warranty, support, indemnity, or liability obligation is offered by\nYou alone, and You hereby agree to indemnify every Contributor for any\nliability incurred by such Contributor as a result of warranty, support,\nindemnity or liability terms You offer. You may include additional\ndisclaimers of warranty and limitations of liability specific to any\njurisdiction.\n\n4. Inability to Comply Due to Statute or Regulation\n---------------------------------------------------\n\nIf it is impossible for You to comply with any of the terms of this\nLicense with respect to some or all of the Covered Software due to\nstatute, judicial order, or regulation then You must: (a) comply with\nthe terms of this License to the maximum extent possible; and (b)\ndescribe the limitations and the code they affect. Such description must\nbe placed in a text file included with all distributions of the Covered\nSoftware under this License. Except to the extent prohibited by statute\nor regulation, such description must be sufficiently detailed for a\nrecipient of ordinary skill to be able to understand it.\n\n5. Termination\n--------------\n\n5.1. The rights granted under this License will terminate automatically\nif You fail to comply with any of its terms. However, if You become\ncompliant, then the rights granted under this License from a particular\nContributor are reinstated (a) provisionally, unless and until such\nContributor explicitly and finally terminates Your grants, and (b) on an\nongoing basis, if such Contributor fails to notify You of the\nnon-compliance by some reasonable means prior to 60 days after You have\ncome back into compliance. Moreover, Your grants from a particular\nContributor are reinstated on an ongoing basis if such Contributor\nnotifies You of the non-compliance by some reasonable means, this is the\nfirst time You have received notice of non-compliance with this License\nfrom such Contributor, and You become compliant prior to 30 days after\nYour receipt of the notice.\n\n5.2. If You initiate litigation against any entity by asserting a patent\ninfringement claim (excluding declaratory judgment actions,\ncounter-claims, and cross-claims) alleging that a Contributor Version\ndirectly or indirectly infringes any patent, then the rights granted to\nYou by any and all Contributors for the Covered Software under Section\n2.1 of this License shall terminate.\n\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all\nend user license agreements (excluding distributors and resellers) which\nhave been validly granted by You or Your distributors under this License\nprior to termination shall survive termination.\n\n************************************************************************\n*                                                                      *\n*  6. Disclaimer of Warranty                                           *\n*  -------------------------                                           *\n*                                                                      *\n*  Covered Software is provided under this License on an \"as is\"       *\n*  basis, without warranty of any kind, either expressed, implied, or  *\n*  statutory, including, without limitation, warranties that the       *\n*  Covered Software is free of defects, merchantable, fit for a        *\n*  particular purpose or non-infringing. The entire risk as to the     *\n*  quality and performance of the Covered Software is with You.        *\n*  Should any Covered Software prove defective in any respect, You     *\n*  (not any Contributor) assume the cost of any necessary servicing,   *\n*  repair, or correction. This disclaimer of warranty constitutes an   *\n*  essential part of this License. No use of any Covered Software is   *\n*  authorized under this License except under this disclaimer.         *\n*                                                                      *\n************************************************************************\n\n************************************************************************\n*                                                                      *\n*  7. Limitation of Liability                                          *\n*  --------------------------                                          *\n*                                                                      *\n*  Under no circumstances and under no legal theory, whether tort      *\n*  (including negligence), contract, or otherwise, shall any           *\n*  Contributor, or anyone who distributes Covered Software as          *\n*  permitted above, be liable to You for any direct, indirect,         *\n*  special, incidental, or consequential damages of any character      *\n*  including, without limitation, damages for lost profits, loss of    *\n*  goodwill, work stoppage, computer failure or malfunction, or any    *\n*  and all other commercial damages or losses, even if such party      *\n*  shall have been informed of the possibility of such damages. This   *\n*  limitation of liability shall not apply to liability for death or   *\n*  personal injury resulting from such party's negligence to the       *\n*  extent applicable law prohibits such limitation. Some               *\n*  jurisdictions do not allow the exclusion or limitation of           *\n*  incidental or consequential damages, so this exclusion and          *\n*  limitation may not apply to You.                                    *\n*                                                                      *\n************************************************************************\n\n8. Litigation\n-------------\n\nAny litigation relating to this License may be brought only in the\ncourts of a jurisdiction where the defendant maintains its principal\nplace of business and such litigation shall be governed by laws of that\njurisdiction, without reference to its conflict-of-law provisions.\nNothing in this Section shall prevent a party's ability to bring\ncross-claims or counter-claims.\n\n9. Miscellaneous\n----------------\n\nThis License represents the complete agreement concerning the subject\nmatter hereof. If any provision of this License is held to be\nunenforceable, such provision shall be reformed only to the extent\nnecessary to make it enforceable. Any law or regulation which provides\nthat the language of a contract shall be construed against the drafter\nshall not be used to construe this License against a Contributor.\n\n10. Versions of the License\n---------------------------\n\n10.1. New Versions\n\nMozilla Foundation is the license steward. Except as provided in Section\n10.3, no one other than the license steward has the right to modify or\npublish new versions of this License. Each version will be given a\ndistinguishing version number.\n\n10.2. Effect of New Versions\n\nYou may distribute the Covered Software under the terms of the version\nof the License under which You originally received the Covered Software,\nor under the terms of any subsequent version published by the license\nsteward.\n\n10.3. Modified Versions\n\nIf you create software not governed by this License, and you want to\ncreate a new license for such software, you may create and use a\nmodified version of this License if you rename the license and remove\nany references to the name of the license steward (except to note that\nsuch modified license differs from this License).\n\n10.4. Distributing Source Code Form that is Incompatible With Secondary\nLicenses\n\nIf You choose to distribute Source Code Form that is Incompatible With\nSecondary Licenses under the terms of this version of the License, the\nnotice described in Exhibit B of this License must be attached.\n\nExhibit A - Source Code Form License Notice\n-------------------------------------------\n\n  This Source Code Form is subject to the terms of the Mozilla Public\n  License, v. 2.0. If a copy of the MPL was not distributed with this\n  file, You can obtain one at http:\/\/mozilla.org\/MPL\/2.0\/.\n\nIf it is not possible or desirable to put the notice in a particular\nfile, then You may include the notice in a location (such as a LICENSE","trademark":0},{"opinion":0,"patent":0,"pattern":"# LICENSE:                                                                  \n# This submission to NSS is to be made available under the terms of the\n# Mozilla Public License, v. 2.0. You can obtain one at http:         \n# \/\/mozilla.org\/MPL\/2.0\/. \n################################################################################\n# Copyright(c) 2012, Intel Corp.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/ Copyright (C) $SKIP19\n\/\/\n\/\/ This Source Code Form is subject to the terms of the Mozilla\n\/\/ Public License v. 2.0. If a copy of the MPL was not distributed\n\/\/ with this file, You can obtain one at http:\/\/mozilla.org\/MPL\/2.0\/.","trademark":0},{"opinion":0,"patent":0,"pattern":"\/*\n * This Source Code is subject to the terms of the Mozilla Public License\n * version 2.0 (the \"License\"). You can obtain a copy of the License at\n * http:\/\/mozilla.org\/MPL\/2.0\/.\n *\/","trademark":0},{"opinion":0,"patent":0,"pattern":" * Copyright (C) $SKIP19\n * Licensed under MPL 2.0 (see LICENSE.txt)","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/ Copyright (C) $SKIP19\n\/\/\n\/\/ This Source Code Form is subject to the terms of the Mozilla\n\/\/ Public License v. 2.0. If a copy of the MPL was not distributed","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/ This Source Code Form is subject to the terms of the Mozilla\n\/\/ Public License v. 2.0. If a copy of the MPL was not distributed\n\/\/ with this file, You can obtain one at http:\/\/mozilla.org\/MPL\/2.0\/.","trademark":0},{"opinion":0,"patent":0,"pattern":"Mozilla Public License, version 2.0\n\n1. Definitions\n\n1.1. “Contributor”\n\n     means each individual or legal entity that creates, contributes to the\n     creation of, or owns Covered Software.\n\n1.2. “Contributor Version”\n\n     means the combination of the Contributions of others (if any) used by a\n     Contributor and that particular Contributor’s Contribution.\n\n1.3. “Contribution”\n\n     means Covered Software of a particular Contributor.\n\n1.4. “Covered Software”\n\n     means Source Code Form to which the initial Contributor has attached the\n     notice in Exhibit A, the Executable Form of such Source Code Form, and\n     Modifications of such Source Code Form, in each case including portions\n     thereof.\n\n1.5. “Incompatible With Secondary Licenses”\n     means\n\n     a. that the initial Contributor has attached the notice described in\n        Exhibit B to the Covered Software; or\n\n     b. that the Covered Software was made available under the terms of version\n        1.1 or earlier of the License, but not also under the terms of a\n        Secondary License.\n\n1.6. “Executable Form”\n\n     means any form of the work other than Source Code Form.\n\n1.7. “Larger Work”\n\n     means a work that combines Covered Software with other material, in a separate\n     file or files, that is not Covered Software.\n\n1.8. “License”\n\n     means this document.\n\n1.9. “Licensable”\n\n     means having the right to grant, to the maximum extent possible, whether at the\n     time of the initial grant or subsequently, any and all of the rights conveyed by\n     this License.\n\n1.10. “Modifications”\n\n     means any of the following:\n\n     a. any file in Source Code Form that results from an addition to, deletion\n        from, or modification of the contents of Covered Software; or\n\n     b. any new file in Source Code Form that contains any Covered Software.\n\n1.11. “Patent Claims” of a Contributor\n\n      means any patent claim(s), including without limitation, method, process,\n      and apparatus claims, in any patent Licensable by such Contributor that\n      would be infringed, but for the grant of the License, by the making,\n      using, selling, offering for sale, having made, import, or transfer of\n      either its Contributions or its Contributor Version.\n\n1.12. “Secondary License”\n\n      means either the GNU General Public License, Version 2.0, the GNU Lesser\n      General Public License, Version 2.1, the GNU Affero General Public\n      License, Version 3.0, or any later versions of those licenses.\n\n1.13. “Source Code Form”\n\n      means the form of the work preferred for making modifications.\n\n1.14. “You” (or “Your”)\n\n      means an individual or a legal entity exercising rights under this\n      License. For legal entities, “You” includes any entity that controls, is\n      controlled by, or is under common control with You. For purposes of this\n      definition, “control” means (a) the power, direct or indirect, to cause\n      the direction or management of such entity, whether by contract or\n      otherwise, or (b) ownership of more than fifty percent (50%) of the\n      outstanding shares or beneficial ownership of such entity.\n\n\n2. License Grants and Conditions\n\n2.1. Grants\n\n     Each Contributor hereby grants You a world-wide, royalty-free,\n     non-exclusive license:\n\n     a. under intellectual property rights (other than patent or trademark)\n        Licensable by such Contributor to use, reproduce, make available,\n        modify, display, perform, distribute, and otherwise exploit its\n        Contributions, either on an unmodified basis, with Modifications, or as\n        part of a Larger Work; and\n\n     b. under Patent Claims of such Contributor to make, use, sell, offer for\n        sale, have made, import, and otherwise transfer either its Contributions\n        or its Contributor Version.\n\n2.2. Effective Date\n\n     The licenses granted in Section 2.1 with respect to any Contribution become\n     effective for each Contribution on the date the Contributor first distributes\n     such Contribution.\n\n2.3. Limitations on Grant Scope\n\n     The licenses granted in this Section 2 are the only rights granted under this\n     License. No additional rights or licenses will be implied from the distribution\n     or licensing of Covered Software under this License. Notwithstanding Section\n     2.1(b) above, no patent license is granted by a Contributor:\n\n     a. for any code that a Contributor has removed from Covered Software; or\n\n     b. for infringements caused by: (i) Your and any other third party’s\n        modifications of Covered Software, or (ii) the combination of its\n        Contributions with other software (except as part of its Contributor\n        Version); or\n\n     c. under Patent Claims infringed by Covered Software in the absence of its\n        Contributions.\n\n     This License does not grant any rights in the trademarks, service marks, or\n     logos of any Contributor (except as may be necessary to comply with the\n     notice requirements in Section 3.4).\n\n2.4. Subsequent Licenses\n\n     No Contributor makes additional grants as a result of Your choice to\n     distribute the Covered Software under a subsequent version of this License\n     (see Section 10.2) or under the terms of a Secondary License (if permitted\n     under the terms of Section 3.3).\n\n2.5. Representation\n\n     Each Contributor represents that the Contributor believes its Contributions\n     are its original creation(s) or it has sufficient rights to grant the\n     rights to its Contributions conveyed by this License.\n\n2.6. Fair Use\n\n     This License is not intended to limit any rights You have under applicable\n     copyright doctrines of fair use, fair dealing, or other equivalents.\n\n2.7. Conditions\n\n     Sections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted in\n     Section 2.1.\n\n\n3. Responsibilities\n\n3.1. Distribution of Source Form\n\n     All distribution of Covered Software in Source Code Form, including any\n     Modifications that You create or to which You contribute, must be under the\n     terms of this License. You must inform recipients that the Source Code Form\n     of the Covered Software is governed by the terms of this License, and how\n     they can obtain a copy of this License. You may not attempt to alter or\n     restrict the recipients’ rights in the Source Code Form.\n\n3.2. Distribution of Executable Form\n\n     If You distribute Covered Software in Executable Form then:\n\n     a. such Covered Software must also be made available in Source Code Form,\n        as described in Section 3.1, and You must inform recipients of the\n        Executable Form how they can obtain a copy of such Source Code Form by\n        reasonable means in a timely manner, at a charge no more than the cost\n        of distribution to the recipient; and\n\n     b. You may distribute such Executable Form under the terms of this License,\n        or sublicense it under different terms, provided that the license for\n        the Executable Form does not attempt to limit or alter the recipients’\n        rights in the Source Code Form under this License.\n\n3.3. Distribution of a Larger Work\n\n     You may create and distribute a Larger Work under terms of Your choice,\n     provided that You also comply with the requirements of this License for the\n     Covered Software. If the Larger Work is a combination of Covered Software\n     with a work governed by one or more Secondary Licenses, and the Covered\n     Software is not Incompatible With Secondary Licenses, this License permits\n     You to additionally distribute such Covered Software under the terms of\n     such Secondary License(s), so that the recipient of the Larger Work may, at\n     their option, further distribute the Covered Software under the terms of\n     either this License or such Secondary License(s).\n\n3.4. Notices\n\n     You may not remove or alter the substance of any license notices (including\n     copyright notices, patent notices, disclaimers of warranty, or limitations\n     of liability) contained within the Source Code Form of the Covered\n     Software, except that You may alter any license notices to the extent\n     required to remedy known factual inaccuracies.\n\n3.5. Application of Additional Terms\n\n     You may choose to offer, and to charge a fee for, warranty, support,\n     indemnity or liability obligations to one or more recipients of Covered\n     Software. However, You may do so only on Your own behalf, and not on behalf\n     of any Contributor. You must make it absolutely clear that any such\n     warranty, support, indemnity, or liability obligation is offered by You\n     alone, and You hereby agree to indemnify every Contributor for any\n     liability incurred by such Contributor as a result of warranty, support,\n     indemnity or liability terms You offer. You may include additional\n     disclaimers of warranty and limitations of liability specific to any\n     jurisdiction.\n\n4. Inability to Comply Due to Statute or Regulation\n\n   If it is impossible for You to comply with any of the terms of this License\n   with respect to some or all of the Covered Software due to statute, judicial\n   order, or regulation then You must: (a) comply with the terms of this License\n   to the maximum extent possible; and (b) describe the limitations and the code\n   they affect. Such description must be placed in a text file included with all\n   distributions of the Covered Software under this License. Except to the\n   extent prohibited by statute or regulation, such description must be\n   sufficiently detailed for a recipient of ordinary skill to be able to\n   understand it.\n\n5. Termination\n\n5.1. The rights granted under this License will terminate automatically if You\n     fail to comply with any of its terms. However, if You become compliant,\n     then the rights granted under this License from a particular Contributor\n     are reinstated (a) provisionally, unless and until such Contributor\n     explicitly and finally terminates Your grants, and (b) on an ongoing basis,\n     if such Contributor fails to notify You of the non-compliance by some\n     reasonable means prior to 60 days after You have come back into compliance.\n     Moreover, Your grants from a particular Contributor are reinstated on an\n     ongoing basis if such Contributor notifies You of the non-compliance by\n     some reasonable means, this is the first time You have received notice of\n     non-compliance with this License from such Contributor, and You become\n     compliant prior to 30 days after Your receipt of the notice.\n\n5.2. If You initiate litigation against any entity by asserting a patent\n     infringement claim (excluding declaratory judgment actions, counter-claims,\n     and cross-claims) alleging that a Contributor Version directly or\n     indirectly infringes any patent, then the rights granted to You by any and\n     all Contributors for the Covered Software under Section 2.1 of this License\n     shall terminate.\n\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all end user\n     license agreements (excluding distributors and resellers) which have been\n     validly granted by You or Your distributors under this License prior to\n     termination shall survive termination.\n\n6. Disclaimer of Warranty\n\n   Covered Software is provided under this License on an “as is” basis, without\n   warranty of any kind, either expressed, implied, or statutory, including,\n   without limitation, warranties that the Covered Software is free of defects,\n   merchantable, fit for a particular purpose or non-infringing. The entire\n   risk as to the quality and performance of the Covered Software is with You.\n   Should any Covered Software prove defective in any respect, You (not any\n   Contributor) assume the cost of any necessary servicing, repair, or\n   correction. This disclaimer of warranty constitutes an essential part of this\n   License. No use of  any Covered Software is authorized under this License\n   except under this disclaimer.\n\n7. Limitation of Liability\n\n   Under no circumstances and under no legal theory, whether tort (including\n   negligence), contract, or otherwise, shall any Contributor, or anyone who\n   distributes Covered Software as permitted above, be liable to You for any\n   direct, indirect, special, incidental, or consequential damages of any\n   character including, without limitation, damages for lost profits, loss of\n   goodwill, work stoppage, computer failure or malfunction, or any and all\n   other commercial damages or losses, even if such party shall have been\n   informed of the possibility of such damages. This limitation of liability\n   shall not apply to liability for death or personal injury resulting from such\n   party’s negligence to the extent applicable law prohibits such limitation.\n   Some jurisdictions do not allow the exclusion or limitation of incidental or\n   consequential damages, so this exclusion and limitation may not apply to You.\n\n8. Litigation\n\n   Any litigation relating to this License may be brought only in the courts of\n   a jurisdiction where the defendant maintains its principal place of business\n   and such litigation shall be governed by laws of that jurisdiction, without\n   reference to its conflict-of-law provisions. Nothing in this Section shall\n   prevent a party’s ability to bring cross-claims or counter-claims.\n\n9. Miscellaneous\n\n   This License represents the complete agreement concerning the subject matter\n   hereof. If any provision of this License is held to be unenforceable, such\n   provision shall be reformed only to the extent necessary to make it\n   enforceable. Any law or regulation which provides that the language of a\n   contract shall be construed against the drafter shall not be used to construe\n   this License against a Contributor.\n\n\n10. Versions of the License\n\n10.1. New Versions\n\n      Mozilla Foundation is the license steward. Except as provided in Section\n      10.3, no one other than the license steward has the right to modify or\n      publish new versions of this License. Each version will be given a\n      distinguishing version number.\n\n10.2. Effect of New Versions\n\n      You may distribute the Covered Software under the terms of the version of\n      the License under which You originally received the Covered Software, or\n      under the terms of any subsequent version published by the license\n      steward.\n\n10.3. Modified Versions\n\n      If you create software not governed by this License, and you want to\n      create a new license for such software, you may create and use a modified\n      version of this License if you rename the license and remove any\n      references to the name of the license steward (except to note that such\n      modified license differs from this License).\n\n10.4. Distributing Source Code Form that is Incompatible With Secondary Licenses\n      If You choose to distribute Source Code Form that is Incompatible With\n      Secondary Licenses under the terms of this version of the License, the\n      notice described in Exhibit B of this License must be attached.\n\nExhibit A - Source Code Form License Notice\n\n      This Source Code Form is subject to the\n      terms of the Mozilla Public License, v.\n      2.0. If a copy of the MPL was not\n      distributed with this file, You can\n      obtain one at\n      http:\/\/mozilla.org\/MPL\/2.0\/.\n\nIf it is not possible or desirable to put the notice in a particular file, then\nYou may include the notice in a location (such as a LICENSE file in a relevant\ndirectory) where a recipient would be likely to look for such a notice.\n\nYou may add additional accurate notices of copyright ownership.\n\nExhibit B - “Incompatible With Secondary Licenses” Notice\n\n      This Source Code Form is “Incompatible\n      With Secondary Licenses”, as defined by\n      the Mozilla Public License, v. 2.0. ","trademark":0},{"opinion":0,"patent":0,"pattern":"<http:\/\/publicsuffix.org>. The license for this file is MPL\/2.0.  The header of\nthat file reads as follows:","trademark":0},{"opinion":0,"patent":0,"pattern":"Portions may be licensed under different licenses (in particular `public_suffix_list.dat` is MPL\/2.0); please read that file and the LICENSE file for full details.","trademark":0},{"opinion":0,"patent":0,"pattern":"-- Copyright   : (c) $SKIP19 \n-- License     : This Source Code Form is subject to the terms of\n--               the Mozilla Public License, v. 2.0.\n--               A copy of the MPL can be found in the LICENSE file or","trademark":0},{"opinion":0,"patent":0,"pattern":"This Source Code Form is subject to the terms of\r\n--               the Mozilla Public License, v. 2.0.\r\n--               A copy of the MPL can be found in the LICENSE file or\r\n--               you can obtain it at http:\/\/mozilla.org\/MPL\/2.0\/.","trademark":0},{"opinion":0,"patent":0,"pattern":"Mozilla Public License Version 2.0\r\n==================================\r\n\r\n1. Definitions\r\n--------------\r\n\r\n1.1. \"Contributor\"\r\n    means each individual or legal entity that creates, contributes to\r\n    the creation of, or owns Covered Software.\r\n\r\n1.2. \"Contributor Version\"\r\n    means the combination of the Contributions of others (if any) used\r\n    by a Contributor and that particular Contributor's Contribution.\r\n\r\n1.3. \"Contribution\"\r\n    means Covered Software of a particular Contributor.\r\n\r\n1.4. \"Covered Software\"\r\n    means Source Code Form to which the initial Contributor has attached\r\n    the notice in Exhibit A, the Executable Form of such Source Code\r\n    Form, and Modifications of such Source Code Form, in each case\r\n    including portions thereof.\r\n\r\n1.5. \"Incompatible With Secondary Licenses\"\r\n    means\r\n\r\n    (a) that the initial Contributor has attached the notice described\r\n        in Exhibit B to the Covered Software; or\r\n\r\n    (b) that the Covered Software was made available under the terms of\r\n        version 1.1 or earlier of the License, but not also under the\r\n        terms of a Secondary License.\r\n\r\n1.6. \"Executable Form\"\r\n    means any form of the work other than Source Code Form.\r\n\r\n1.7. \"Larger Work\"\r\n    means a work that combines Covered Software with other material, in\r\n    a separate file or files, that is not Covered Software.\r\n\r\n1.8. \"License\"\r\n    means this document.\r\n\r\n1.9. \"Licensable\"\r\n    means having the right to grant, to the maximum extent possible,\r\n    whether at the time of the initial grant or subsequently, any and\r\n    all of the rights conveyed by this License.\r\n\r\n1.10. \"Modifications\"\r\n    means any of the following:\r\n\r\n    (a) any file in Source Code Form that results from an addition to,\r\n        deletion from, or modification of the contents of Covered\r\n        Software; or\r\n\r\n    (b) any new file in Source Code Form that contains any Covered\r\n        Software.\r\n\r\n1.11. \"Patent Claims\" of a Contributor\r\n    means any patent claim(s), including without limitation, method,\r\n    process, and apparatus claims, in any patent Licensable by such\r\n    Contributor that would be infringed, but for the grant of the\r\n    License, by the making, using, selling, offering for sale, having\r\n    made, import, or transfer of either its Contributions or its\r\n    Contributor Version.\r\n\r\n1.12. \"Secondary License\"\r\n    means either the GNU General Public License, Version 2.0, the GNU\r\n    Lesser General Public License, Version 2.1, the GNU Affero General\r\n    Public License, Version 3.0, or any later versions of those\r\n    licenses.\r\n\r\n1.13. \"Source Code Form\"\r\n    means the form of the work preferred for making modifications.\r\n\r\n1.14. \"You\" (or \"Your\")\r\n    means an individual or a legal entity exercising rights under this\r\n    License. For legal entities, \"You\" includes any entity that\r\n    controls, is controlled by, or is under common control with You. For\r\n    purposes of this definition, \"control\" means (a) the power, direct\r\n    or indirect, to cause the direction or management of such entity,\r\n    whether by contract or otherwise, or (b) ownership of more than\r\n    fifty percent (50%) of the outstanding shares or beneficial\r\n    ownership of such entity.\r\n\r\n2. License Grants and Conditions\r\n--------------------------------\r\n\r\n2.1. Grants\r\n\r\nEach Contributor hereby grants You a world-wide, royalty-free,\r\nnon-exclusive license:\r\n\r\n(a) under intellectual property rights (other than patent or trademark)\r\n    Licensable by such Contributor to use, reproduce, make available,\r\n    modify, display, perform, distribute, and otherwise exploit its\r\n    Contributions, either on an unmodified basis, with Modifications, or\r\n    as part of a Larger Work; and\r\n\r\n(b) under Patent Claims of such Contributor to make, use, sell, offer\r\n    for sale, have made, import, and otherwise transfer either its\r\n    Contributions or its Contributor Version.\r\n\r\n2.2. Effective Date\r\n\r\nThe licenses granted in Section 2.1 with respect to any Contribution\r\nbecome effective for each Contribution on the date the Contributor first\r\ndistributes such Contribution.\r\n\r\n2.3. Limitations on Grant Scope\r\n\r\nThe licenses granted in this Section 2 are the only rights granted under\r\nthis License. No additional rights or licenses will be implied from the\r\ndistribution or licensing of Covered Software under this License.\r\nNotwithstanding Section 2.1(b) above, no patent license is granted by a\r\nContributor:\r\n\r\n(a) for any code that a Contributor has removed from Covered Software;\r\n    or\r\n\r\n(b) for infringements caused by: (i) Your and any other third party's\r\n    modifications of Covered Software, or (ii) the combination of its\r\n    Contributions with other software (except as part of its Contributor\r\n    Version); or\r\n\r\n(c) under Patent Claims infringed by Covered Software in the absence of\r\n    its Contributions.\r\n\r\nThis License does not grant any rights in the trademarks, service marks,\r\nor logos of any Contributor (except as may be necessary to comply with\r\nthe notice requirements in Section 3.4).\r\n\r\n2.4. Subsequent Licenses\r\n\r\nNo Contributor makes additional grants as a result of Your choice to\r\ndistribute the Covered Software under a subsequent version of this\r\nLicense (see Section 10.2) or under the terms of a Secondary License (if\r\npermitted under the terms of Section 3.3).\r\n\r\n2.5. Representation\r\n\r\nEach Contributor represents that the Contributor believes its\r\nContributions are its original creation(s) or it has sufficient rights\r\nto grant the rights to its Contributions conveyed by this License.\r\n\r\n2.6. Fair Use\r\n\r\nThis License is not intended to limit any rights You have under\r\napplicable copyright doctrines of fair use, fair dealing, or other\r\nequivalents.\r\n\r\n2.7. Conditions\r\n\r\nSections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted\r\nin Section 2.1.\r\n\r\n3. Responsibilities\r\n-------------------\r\n\r\n3.1. Distribution of Source Form\r\n\r\nAll distribution of Covered Software in Source Code Form, including any\r\nModifications that You create or to which You contribute, must be under\r\nthe terms of this License. You must inform recipients that the Source\r\nCode Form of the Covered Software is governed by the terms of this\r\nLicense, and how they can obtain a copy of this License. You may not\r\nattempt to alter or restrict the recipients' rights in the Source Code\r\nForm.\r\n\r\n3.2. Distribution of Executable Form\r\n\r\nIf You distribute Covered Software in Executable Form then:\r\n\r\n(a) such Covered Software must also be made available in Source Code\r\n    Form, as described in Section 3.1, and You must inform recipients of\r\n    the Executable Form how they can obtain a copy of such Source Code\r\n    Form by reasonable means in a timely manner, at a charge no more\r\n    than the cost of distribution to the recipient; and\r\n\r\n(b) You may distribute such Executable Form under the terms of this\r\n    License, or sublicense it under different terms, provided that the\r\n    license for the Executable Form does not attempt to limit or alter\r\n    the recipients' rights in the Source Code Form under this License.\r\n\r\n3.3. Distribution of a Larger Work\r\n\r\nYou may create and distribute a Larger Work under terms of Your choice,\r\nprovided that You also comply with the requirements of this License for\r\nthe Covered Software. If the Larger Work is a combination of Covered\r\nSoftware with a work governed by one or more Secondary Licenses, and the\r\nCovered Software is not Incompatible With Secondary Licenses, this\r\nLicense permits You to additionally distribute such Covered Software\r\nunder the terms of such Secondary License(s), so that the recipient of\r\nthe Larger Work may, at their option, further distribute the Covered\r\nSoftware under the terms of either this License or such Secondary\r\nLicense(s).\r\n\r\n3.4. Notices\r\n\r\nYou may not remove or alter the substance of any license notices\r\n(including copyright notices, patent notices, disclaimers of warranty,\r\nor limitations of liability) contained within the Source Code Form of\r\nthe Covered Software, except that You may alter any license notices to\r\nthe extent required to remedy known factual inaccuracies.\r\n\r\n3.5. Application of Additional Terms\r\n\r\nYou may choose to offer, and to charge a fee for, warranty, support,\r\nindemnity or liability obligations to one or more recipients of Covered\r\nSoftware. However, You may do so only on Your own behalf, and not on\r\nbehalf of any Contributor. You must make it absolutely clear that any\r\nsuch warranty, support, indemnity, or liability obligation is offered by\r\nYou alone, and You hereby agree to indemnify every Contributor for any\r\nliability incurred by such Contributor as a result of warranty, support,\r\nindemnity or liability terms You offer. You may include additional\r\ndisclaimers of warranty and limitations of liability specific to any\r\njurisdiction.\r\n\r\n4. Inability to Comply Due to Statute or Regulation\r\n---------------------------------------------------\r\n\r\nIf it is impossible for You to comply with any of the terms of this\r\nLicense with respect to some or all of the Covered Software due to\r\nstatute, judicial order, or regulation then You must: (a) comply with\r\nthe terms of this License to the maximum extent possible; and (b)\r\ndescribe the limitations and the code they affect. Such description must\r\nbe placed in a text file included with all distributions of the Covered\r\nSoftware under this License. Except to the extent prohibited by statute\r\nor regulation, such description must be sufficiently detailed for a\r\nrecipient of ordinary skill to be able to understand it.\r\n\r\n5. Termination\r\n--------------\r\n\r\n5.1. The rights granted under this License will terminate automatically\r\nif You fail to comply with any of its terms. However, if You become\r\ncompliant, then the rights granted under this License from a particular\r\nContributor are reinstated (a) provisionally, unless and until such\r\nContributor explicitly and finally terminates Your grants, and (b) on an\r\nongoing basis, if such Contributor fails to notify You of the\r\nnon-compliance by some reasonable means prior to 60 days after You have\r\ncome back into compliance. Moreover, Your grants from a particular\r\nContributor are reinstated on an ongoing basis if such Contributor\r\nnotifies You of the non-compliance by some reasonable means, this is the\r\nfirst time You have received notice of non-compliance with this License\r\nfrom such Contributor, and You become compliant prior to 30 days after\r\nYour receipt of the notice.\r\n\r\n5.2. If You initiate litigation against any entity by asserting a patent\r\ninfringement claim (excluding declaratory judgment actions,\r\ncounter-claims, and cross-claims) alleging that a Contributor Version\r\ndirectly or indirectly infringes any patent, then the rights granted to\r\nYou by any and all Contributors for the Covered Software under Section\r\n2.1 of this License shall terminate.\r\n\r\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all\r\nend user license agreements (excluding distributors and resellers) which\r\nhave been validly granted by You or Your distributors under this License\r\nprior to termination shall survive termination.\r\n\r\n************************************************************************\r\n*                                                                      *\r\n*  6. Disclaimer of Warranty                                           *\r\n*  -------------------------                                           *\r\n*                                                                      *\r\n*  Covered Software is provided under this License on an \"as is\"       *\r\n*  basis, without warranty of any kind, either expressed, implied, or  *\r\n*  statutory, including, without limitation, warranties that the       *\r\n*  Covered Software is free of defects, merchantable, fit for a        *\r\n*  particular purpose or non-infringing. The entire risk as to the     *\r\n*  quality and performance of the Covered Software is with You.        *\r\n*  Should any Covered Software prove defective in any respect, You     *\r\n*  (not any Contributor) assume the cost of any necessary servicing,   *\r\n*  repair, or correction. This disclaimer of warranty constitutes an   *\r\n*  essential part of this License. No use of any Covered Software is   *\r\n*  authorized under this License except under this disclaimer.         *\r\n*                                                                      *\r\n************************************************************************\r\n\r\n************************************************************************\r\n*                                                                      *\r\n*  7. Limitation of Liability                                          *\r\n*  --------------------------                                          *\r\n*                                                                      *\r\n*  Under no circumstances and under no legal theory, whether tort      *\r\n*  (including negligence), contract, or otherwise, shall any           *\r\n*  Contributor, or anyone who distributes Covered Software as          *\r\n*  permitted above, be liable to You for any direct, indirect,         *\r\n*  special, incidental, or consequential damages of any character      *\r\n*  including, without limitation, damages for lost profits, loss of    *\r\n*  goodwill, work stoppage, computer failure or malfunction, or any    *\r\n*  and all other commercial damages or losses, even if such party      *\r\n*  shall have been informed of the possibility of such damages. This   *\r\n*  limitation of liability shall not apply to liability for death or   *\r\n*  personal injury resulting from such party's negligence to the       *\r\n*  extent applicable law prohibits such limitation. Some               *\r\n*  jurisdictions do not allow the exclusion or limitation of           *\r\n*  incidental or consequential damages, so this exclusion and          *\r\n*  limitation may not apply to You.                                    *\r\n*                                                                      *\r\n************************************************************************\r\n\r\n8. Litigation\r\n-------------\r\n\r\nAny litigation relating to this License may be brought only in the\r\ncourts of a jurisdiction where the defendant maintains its principal\r\nplace of business and such litigation shall be governed by laws of that\r\njurisdiction, without reference to its conflict-of-law provisions.\r\nNothing in this Section shall prevent a party's ability to bring\r\ncross-claims or counter-claims.\r\n\r\n9. Miscellaneous\r\n----------------\r\n\r\nThis License represents the complete agreement concerning the subject\r\nmatter hereof. If any provision of this License is held to be\r\nunenforceable, such provision shall be reformed only to the extent\r\nnecessary to make it enforceable. Any law or regulation which provides\r\nthat the language of a contract shall be construed against the drafter\r\nshall not be used to construe this License against a Contributor.\r\n\r\n10. Versions of the License\r\n---------------------------\r\n\r\n10.1. New Versions\r\n\r\nMozilla Foundation is the license steward. Except as provided in Section\r\n10.3, no one other than the license steward has the right to modify or\r\npublish new versions of this License. Each version will be given a\r\ndistinguishing version number.\r\n\r\n10.2. Effect of New Versions\r\n\r\nYou may distribute the Covered Software under the terms of the version\r\nof the License under which You originally received the Covered Software,\r\nor under the terms of any subsequent version published by the license\r\nsteward.\r\n\r\n10.3. Modified Versions\r\n\r\nIf you create software not governed by this License, and you want to\r\ncreate a new license for such software, you may create and use a\r\nmodified version of this License if you rename the license and remove\r\nany references to the name of the license steward (except to note that\r\nsuch modified license differs from this License).\r\n\r\n10.4. Distributing Source Code Form that is Incompatible With Secondary\r\nLicenses\r\n\r\nIf You choose to distribute Source Code Form that is Incompatible With\r\nSecondary Licenses under the terms of this version of the License, the\r\nnotice described in Exhibit B of this License must be attached.\r\n\r\nExhibit A - Source Code Form License Notice\r\n-------------------------------------------\r\n\r\n  This Source Code Form is subject to the terms of the Mozilla Public\r\n  License, v. 2.0. If a copy of the MPL was not distributed with this\r\n  file, You can obtain one at http:\/\/mozilla.org\/MPL\/2.0\/.\r\n\r\nIf it is not possible or desirable to put the notice in a particular\r\nfile, then You may include the notice in a location (such as a LICENSE\r\nfile in a relevant directory) where a recipient would be likely to look\r\nfor such a notice.\r\n\r\nYou may add additional accurate notices of copyright ownership.\r\n\r\nExhibit B - \"Incompatible With Secondary Licenses\" Notice\r\n---------------------------------------------------------\r\n\r\n  This Source Code Form is \"Incompatible With Secondary Licenses\", as\r\n  defined by the Mozilla Public License, v. 2.0.\r\n","trademark":0},{"opinion":0,"patent":0,"pattern":"license:             MPL-2.0","trademark":0},{"opinion":0,"patent":0,"pattern":" * Copyright $SKIP20\n * \n * Permission to use, copy, modify, and distribute this software and its\n * documentation for any purpose and without fee is hereby granted, provided\n * that the above copyright notice appear in all copies and that both that\n * copyright notice and this permission notice appear in supporting\n * documentation, and that the name of $SKIP10 may not be\n * used in advertising or publicity pertaining to distribution of the software\n * without specific, written prior permission.  $SKIP10 makes\n * no representations about the suitability of this software for any purpose.\n * It is provided ``as is'' without express or implied warranty.\n * \n * $SKIP9 DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS\n","trademark":0},{"opinion":0,"patent":0,"pattern":"Licensed under the Mozilla Public License, v\\&. 2\\&.0\\&. If a copy of the MPL was not distributed with this file, You can obtain one at http:\/\/mozilla\\&.org\/MPL\/2\\&.0\/\\&.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"made available under the terms of the\n; Mozilla Public License, v. 2.0.","trademark":0},{"opinion":0,"patent":0,"pattern":".\\\" Copyright (c) $SKIP10\n.\\\" \n.\\\" Permission to use, copy, modify, distribute, and sell this software and its\n.\\\" documentation for any purpose is hereby granted without fee, provided that\n.\\\" the above copyright notice appear in all copies and that both that\n.\\\" copyright notice and this permission notice appear in supporting\n.\\\" documentation.\n.\\\" \n.\\\" The above copyright notice and this permission notice shall be included in\n.\\\" all copies or substantial portions of the Software.\n.\\\" \n.\\\" THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n.\\\" IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n.\\\" FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL \n.\\\" $SKIP5 BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, \n.\\\" WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF \n.\\\" OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE \n.\\\" SOFTWARE.\n.\\\" \n.\\\" Except as contained in this notice, the name of $SKIP5 shall not \n.\\\" be used in advertising or otherwise to promote the sale, use or other \n.\\\" dealing in this Software without prior written authorization from The\n.\\\" $SKIP5.","trademark":0},{"opinion":0,"patent":0,"pattern":"Mozilla Public License, version 2.0\r\n\r\n1. Definitions\r\n\r\n1.1. \"Contributor\"\r\n\r\n     means each individual or legal entity that creates, contributes to the\r\n     creation of, or owns Covered Software.\r\n\r\n1.2. \"Contributor Version\"\r\n\r\n     means the combination of the Contributions of others (if any) used by a\r\n     Contributor and that particular Contributor's Contribution.\r\n\r\n1.3. \"Contribution\"\r\n\r\n     means Covered Software of a particular Contributor.\r\n\r\n1.4. \"Covered Software\"\r\n\r\n     means Source Code Form to which the initial Contributor has attached the\r\n     notice in Exhibit A, the Executable Form of such Source Code Form, and\r\n     Modifications of such Source Code Form, in each case including portions\r\n     thereof.\r\n\r\n1.5. \"Incompatible With Secondary Licenses\"\r\n     means\r\n\r\n     a. that the initial Contributor has attached the notice described in\r\n        Exhibit B to the Covered Software; or\r\n\r\n     b. that the Covered Software was made available under the terms of\r\n        version 1.1 or earlier of the License, but not also under the terms of\r\n        a Secondary License.\r\n\r\n1.6. \"Executable Form\"\r\n\r\n     means any form of the work other than Source Code Form.\r\n\r\n1.7. \"Larger Work\"\r\n\r\n     means a work that combines Covered Software with other material, in a\r\n     separate file or files, that is not Covered Software.\r\n\r\n1.8. \"License\"\r\n\r\n     means this document.\r\n\r\n1.9. \"Licensable\"\r\n\r\n     means having the right to grant, to the maximum extent possible, whether\r\n     at the time of the initial grant or subsequently, any and all of the\r\n     rights conveyed by this License.\r\n\r\n1.10. \"Modifications\"\r\n\r\n     means any of the following:\r\n\r\n     a. any file in Source Code Form that results from an addition to,\r\n        deletion from, or modification of the contents of Covered Software; or\r\n\r\n     b. any new file in Source Code Form that contains any Covered Software.\r\n\r\n1.11. \"Patent Claims\" of a Contributor\r\n\r\n      means any patent claim(s), including without limitation, method,\r\n      process, and apparatus claims, in any patent Licensable by such\r\n      Contributor that would be infringed, but for the grant of the License,\r\n      by the making, using, selling, offering for sale, having made, import,\r\n      or transfer of either its Contributions or its Contributor Version.\r\n\r\n1.12. \"Secondary License\"\r\n\r\n      means either the GNU General Public License, Version 2.0, the GNU Lesser\r\n      General Public License, Version 2.1, the GNU Affero General Public\r\n      License, Version 3.0, or any later versions of those licenses.\r\n\r\n1.13. \"Source Code Form\"\r\n\r\n      means the form of the work preferred for making modifications.\r\n\r\n1.14. \"You\" (or \"Your\")\r\n\r\n      means an individual or a legal entity exercising rights under this\r\n      License. For legal entities, \"You\" includes any entity that controls, is\r\n      controlled by, or is under common control with You. For purposes of this\r\n      definition, \"control\" means (a) the power, direct or indirect, to cause\r\n      the direction or management of such entity, whether by contract or\r\n      otherwise, or (b) ownership of more than fifty percent (50%) of the\r\n      outstanding shares or beneficial ownership of such entity.\r\n\r\n\r\n2. License Grants and Conditions\r\n\r\n2.1. Grants\r\n\r\n     Each Contributor hereby grants You a world-wide, royalty-free,\r\n     non-exclusive license:\r\n\r\n     a. under intellectual property rights (other than patent or trademark)\r\n        Licensable by such Contributor to use, reproduce, make available,\r\n        modify, display, perform, distribute, and otherwise exploit its\r\n        Contributions, either on an unmodified basis, with Modifications, or\r\n        as part of a Larger Work; and\r\n\r\n     b. under Patent Claims of such Contributor to make, use, sell, offer for\r\n        sale, have made, import, and otherwise transfer either its\r\n        Contributions or its Contributor Version.\r\n\r\n2.2. Effective Date\r\n\r\n     The licenses granted in Section 2.1 with respect to any Contribution\r\n     become effective for each Contribution on the date the Contributor first\r\n     distributes such Contribution.\r\n\r\n2.3. Limitations on Grant Scope\r\n\r\n     The licenses granted in this Section 2 are the only rights granted under\r\n     this License. No additional rights or licenses will be implied from the\r\n     distribution or licensing of Covered Software under this License.\r\n     Notwithstanding Section 2.1(b) above, no patent license is granted by a\r\n     Contributor:\r\n\r\n     a. for any code that a Contributor has removed from Covered Software; or\r\n\r\n     b. for infringements caused by: (i) Your and any other third party's\r\n        modifications of Covered Software, or (ii) the combination of its\r\n        Contributions with other software (except as part of its Contributor\r\n        Version); or\r\n\r\n     c. under Patent Claims infringed by Covered Software in the absence of\r\n        its Contributions.\r\n\r\n     This License does not grant any rights in the trademarks, service marks,\r\n     or logos of any Contributor (except as may be necessary to comply with\r\n     the notice requirements in Section 3.4).\r\n\r\n2.4. Subsequent Licenses\r\n\r\n     No Contributor makes additional grants as a result of Your choice to\r\n     distribute the Covered Software under a subsequent version of this\r\n     License (see Section 10.2) or under the terms of a Secondary License (if\r\n     permitted under the terms of Section 3.3).\r\n\r\n2.5. Representation\r\n\r\n     Each Contributor represents that the Contributor believes its\r\n     Contributions are its original creation(s) or it has sufficient rights to\r\n     grant the rights to its Contributions conveyed by this License.\r\n\r\n2.6. Fair Use\r\n\r\n     This License is not intended to limit any rights You have under\r\n     applicable copyright doctrines of fair use, fair dealing, or other\r\n     equivalents.\r\n\r\n2.7. Conditions\r\n\r\n     Sections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted in\r\n     Section 2.1.\r\n\r\n\r\n3. Responsibilities\r\n\r\n3.1. Distribution of Source Form\r\n\r\n     All distribution of Covered Software in Source Code Form, including any\r\n     Modifications that You create or to which You contribute, must be under\r\n     the terms of this License. You must inform recipients that the Source\r\n     Code Form of the Covered Software is governed by the terms of this\r\n     License, and how they can obtain a copy of this License. You may not\r\n     attempt to alter or restrict the recipients' rights in the Source Code\r\n     Form.\r\n\r\n3.2. Distribution of Executable Form\r\n\r\n     If You distribute Covered Software in Executable Form then:\r\n\r\n     a. such Covered Software must also be made available in Source Code Form,\r\n        as described in Section 3.1, and You must inform recipients of the\r\n        Executable Form how they can obtain a copy of such Source Code Form by\r\n        reasonable means in a timely manner, at a charge no more than the cost\r\n        of distribution to the recipient; and\r\n\r\n     b. You may distribute such Executable Form under the terms of this\r\n        License, or sublicense it under different terms, provided that the\r\n        license for the Executable Form does not attempt to limit or alter the\r\n        recipients' rights in the Source Code Form under this License.\r\n\r\n3.3. Distribution of a Larger Work\r\n\r\n     You may create and distribute a Larger Work under terms of Your choice,\r\n     provided that You also comply with the requirements of this License for\r\n     the Covered Software. If the Larger Work is a combination of Covered\r\n     Software with a work governed by one or more Secondary Licenses, and the\r\n     Covered Software is not Incompatible With Secondary Licenses, this\r\n     License permits You to additionally distribute such Covered Software\r\n     under the terms of such Secondary License(s), so that the recipient of\r\n     the Larger Work may, at their option, further distribute the Covered\r\n     Software under the terms of either this License or such Secondary\r\n     License(s).\r\n\r\n3.4. Notices\r\n\r\n     You may not remove or alter the substance of any license notices\r\n     (including copyright notices, patent notices, disclaimers of warranty, or\r\n     limitations of liability) contained within the Source Code Form of the\r\n     Covered Software, except that You may alter any license notices to the\r\n     extent required to remedy known factual inaccuracies.\r\n\r\n3.5. Application of Additional Terms\r\n\r\n     You may choose to offer, and to charge a fee for, warranty, support,\r\n     indemnity or liability obligations to one or more recipients of Covered\r\n     Software. However, You may do so only on Your own behalf, and not on\r\n     behalf of any Contributor. You must make it absolutely clear that any\r\n     such warranty, support, indemnity, or liability obligation is offered by\r\n     You alone, and You hereby agree to indemnify every Contributor for any\r\n     liability incurred by such Contributor as a result of warranty, support,\r\n     indemnity or liability terms You offer. You may include additional\r\n     disclaimers of warranty and limitations of liability specific to any\r\n     jurisdiction.\r\n\r\n4. Inability to Comply Due to Statute or Regulation\r\n\r\n   If it is impossible for You to comply with any of the terms of this License\r\n   with respect to some or all of the Covered Software due to statute,\r\n   judicial order, or regulation then You must: (a) comply with the terms of\r\n   this License to the maximum extent possible; and (b) describe the\r\n   limitations and the code they affect. Such description must be placed in a\r\n   text file included with all distributions of the Covered Software under\r\n   this License. Except to the extent prohibited by statute or regulation,\r\n   such description must be sufficiently detailed for a recipient of ordinary\r\n   skill to be able to understand it.\r\n\r\n5. Termination\r\n\r\n5.1. The rights granted under this License will terminate automatically if You\r\n     fail to comply with any of its terms. However, if You become compliant,\r\n     then the rights granted under this License from a particular Contributor\r\n     are reinstated (a) provisionally, unless and until such Contributor\r\n     explicitly and finally terminates Your grants, and (b) on an ongoing\r\n     basis, if such Contributor fails to notify You of the non-compliance by\r\n     some reasonable means prior to 60 days after You have come back into\r\n     compliance. Moreover, Your grants from a particular Contributor are\r\n     reinstated on an ongoing basis if such Contributor notifies You of the\r\n     non-compliance by some reasonable means, this is the first time You have\r\n     received notice of non-compliance with this License from such\r\n     Contributor, and You become compliant prior to 30 days after Your receipt\r\n     of the notice.\r\n\r\n5.2. If You initiate litigation against any entity by asserting a patent\r\n     infringement claim (excluding declaratory judgment actions,\r\n     counter-claims, and cross-claims) alleging that a Contributor Version\r\n     directly or indirectly infringes any patent, then the rights granted to\r\n     You by any and all Contributors for the Covered Software under Section\r\n     2.1 of this License shall terminate.\r\n\r\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all end user\r\n     license agreements (excluding distributors and resellers) which have been\r\n     validly granted by You or Your distributors under this License prior to\r\n     termination shall survive termination.\r\n\r\n6. Disclaimer of Warranty\r\n\r\n   Covered Software is provided under this License on an \"as is\" basis,\r\n   without warranty of any kind, either expressed, implied, or statutory,\r\n   including, without limitation, warranties that the Covered Software is free\r\n   of defects, merchantable, fit for a particular purpose or non-infringing.\r\n   The entire risk as to the quality and performance of the Covered Software\r\n   is with You. Should any Covered Software prove defective in any respect,\r\n   You (not any Contributor) assume the cost of any necessary servicing,\r\n   repair, or correction. This disclaimer of warranty constitutes an essential\r\n   part of this License. No use of  any Covered Software is authorized under\r\n   this License except under this disclaimer.\r\n\r\n7. Limitation of Liability\r\n\r\n   Under no circumstances and under no legal theory, whether tort (including\r\n   negligence), contract, or otherwise, shall any Contributor, or anyone who\r\n   distributes Covered Software as permitted above, be liable to You for any\r\n   direct, indirect, special, incidental, or consequential damages of any\r\n   character including, without limitation, damages for lost profits, loss of\r\n   goodwill, work stoppage, computer failure or malfunction, or any and all\r\n   other commercial damages or losses, even if such party shall have been\r\n   informed of the possibility of such damages. This limitation of liability\r\n   shall not apply to liability for death or personal injury resulting from\r\n   such party's negligence to the extent applicable law prohibits such\r\n   limitation. Some jurisdictions do not allow the exclusion or limitation of\r\n   incidental or consequential damages, so this exclusion and limitation may\r\n   not apply to You.\r\n\r\n8. Litigation\r\n\r\n   Any litigation relating to this License may be brought only in the courts\r\n   of a jurisdiction where the defendant maintains its principal place of\r\n   business and such litigation shall be governed by laws of that\r\n   jurisdiction, without reference to its conflict-of-law provisions. Nothing\r\n   in this Section shall prevent a party's ability to bring cross-claims or\r\n   counter-claims.\r\n\r\n9. Miscellaneous\r\n\r\n   This License represents the complete agreement concerning the subject\r\n   matter hereof. If any provision of this License is held to be\r\n   unenforceable, such provision shall be reformed only to the extent\r\n   necessary to make it enforceable. Any law or regulation which provides that\r\n   the language of a contract shall be construed against the drafter shall not\r\n   be used to construe this License against a Contributor.\r\n\r\n\r\n10. Versions of the License\r\n\r\n10.1. New Versions\r\n\r\n      Mozilla Foundation is the license steward. Except as provided in Section\r\n      10.3, no one other than the license steward has the right to modify or\r\n      publish new versions of this License. Each version will be given a\r\n      distinguishing version number.\r\n\r\n10.2. Effect of New Versions\r\n\r\n      You may distribute the Covered Software under the terms of the version\r\n      of the License under which You originally received the Covered Software,\r\n      or under the terms of any subsequent version published by the license\r\n      steward.\r\n\r\n10.3. Modified Versions\r\n\r\n      If you create software not governed by this License, and you want to\r\n      create a new license for such software, you may create and use a\r\n      modified version of this License if you rename the license and remove\r\n      any references to the name of the license steward (except to note that\r\n      such modified license differs from this License).\r\n\r\n10.4. Distributing Source Code Form that is Incompatible With Secondary\r\n      Licenses If You choose to distribute Source Code Form that is\r\n      Incompatible With Secondary Licenses under the terms of this version of\r\n      the License, the notice described in Exhibit B of this License must be\r\n      attached.\r\n\r\nExhibit A - Source Code Form License Notice\r\n\r\n      This Source Code Form is subject to the\r\n      terms of the Mozilla Public License, v.\r\n      2.0. If a copy of the MPL was not\r\n      distributed with this file, You can\r\n      obtain one at\r\n      http:\/\/mozilla.org\/MPL\/2.0\/.\r\n\r\nIf it is not possible or desirable to put the notice in a particular file,\r\nthen You may include the notice in a location (such as a LICENSE file in a\r\nrelevant directory) where a recipient would be likely to look for such a\r\nnotice.\r\n\r\nYou may add additional accurate notices of copyright ownership.\r\n\r\nExhibit B - \"Incompatible With Secondary Licenses\" Notice\r\n\r\n      This Source Code Form is \"Incompatible\r\n      With Secondary Licenses\", as defined by\r\n      the Mozilla Public License, v. 2.0.\r\n\r\n\r\n","trademark":0},{"opinion":0,"patent":0,"pattern":"subject to the terms of the Mozilla Public License, v. 2.0.\r\nIf a copy of the MPL was not distributed with this file, You can obtain one at https:\/\/mozilla.org\/MPL\/2.0\/.","trademark":0}],"risk":3,"url":"https:\/\/www.mozilla.org\/MPL\/2.0\/"}