{"description":null,"eula":0,"name":"Any floating warranty","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":" * THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED\n * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\n * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n * DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,\n * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\n * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\n * OF THE POSSIBILITY OF SUCH DAMAGE.","trademark":0},{"opinion":0,"patent":0,"pattern":"THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","trademark":0},{"opinion":0,"patent":0,"pattern":" * This code is distributed in the hope that it will be useful,\n * but WITHOUT ANY WARRANTY; without even the implied warranty of\n * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.","trademark":0},{"opinion":0,"patent":0,"pattern":" * THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND\n * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n * ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR\n * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\n * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n * SUCH DAMAGE.","trademark":0},{"opinion":0,"patent":0,"pattern":" * The authors make NO WARRANTY or representation, either express or implied,\n * with respect to this software, its quality, accuracy, merchantability, or\n * fitness for a particular purpose.  This software is provided \"AS IS\", and\n * you, its user, assume the entire risk as to its quality and accuracy.","trademark":0},{"opinion":0,"patent":0,"pattern":"   There is no warranty against interference with your enjoyment of the\n   library or against infringement.  There is no warranty that our\n   efforts or the library will fulfill any of your particular purposes\n   or needs.  This library is provided with all faults, and the entire\n   risk of satisfactory quality, performance, accuracy, and effort is with\n   the user.","trademark":0},{"opinion":0,"patent":0,"pattern":"                    IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES\n                    THAT THE DOCUMENT OR MODIFIED VERSION OF THE\n                    DOCUMENT IS FREE OF DEFECTS MERCHANTABLE, FIT FOR\n                    A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE\n                    RISK AS TO THE QUALITY, ACCURACY, AND PERFORMANCE\n                    OF THE DOCUMENT OR MODIFIED VERSION OF THE\n                    DOCUMENT IS WITH YOU. SHOULD ANY DOCUMENT OR\n                    MODIFIED VERSION PROVE DEFECTIVE IN ANY RESPECT,\n                    YOU (NOT THE INITIAL WRITER, AUTHOR OR ANY\n                    CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY\n                    SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER\n                    OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS\n                    LICENSE. NO USE OF ANY DOCUMENT OR MODIFIED\n                    VERSION OF THE DOCUMENT IS AUTHORIZED HEREUNDER\n                    EXCEPT UNDER THIS DISCLAIMER; AND","trademark":0},{"opinion":0,"patent":0,"pattern":"# There is no warranty.","trademark":0},{"opinion":0,"patent":0,"pattern":"  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n  * \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR","trademark":0},{"opinion":0,"patent":0,"pattern":"# This program is distributed in the hope that it would be useful, but\n# WITHOUT ANY WARRANTY; without even the implied warranty of\n# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.","trademark":0},{"opinion":0,"patent":0,"pattern":"Unless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.","trademark":0},{"opinion":0,"patent":0,"pattern":"    This software is provided by the copyright holders and contributors \"as\n    is\" and any express or implied warranties, including, but not limited\n    to, the implied warranties of merchantability and fitness for a\n    particular purpose are disclaimed. In no event shall the copyright\n    holder or contributors be liable for any direct, indirect, incidental,\n    special, exemplary, or consequential damages (including, but not\n    limited to, procurement of substitute goods or services; loss of use,\n    data, or profits; or business interruption) however caused and on any\n    theory of liability, whether in contract, strict liability, or tort\n    (including negligence or otherwise) arising in any way out of the use\n    of this software, even if advised of the possibility of such damage.","trademark":0},{"opinion":0,"patent":0,"pattern":"THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL\nTHE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":"     about the suitability of this software for any purpose.  It is\n     provided \"as is\" without express or implied warranty.","trademark":0},{"opinion":0,"patent":0,"pattern":"--                                    DISCLAIMER\n--\n--     ALL MATERIALS OR INFORMATION HEREIN RELEASED, MADE AVAILABLE OR\n--     DISCLOSED ARE AS IS.  THE GOVERNMENT MAKES NO EXPRESS OR IMPLIED \n--     WARRANTY AS TO ANY MATTER WHATSOEVER, INCLUDING THE CONDITIONS OF THE\n--     SOFTWARE, DOCUMENTATION OR OTHER INFORMATION RELEASED, MADE AVAILABLE \n--     OR DISCLOSED, OR THE OWNERSHIP, MERCHANTABILITY, OR FITNESS FOR A\n--     PARTICULAR PURPOSE OF SAID MATERIAL.","trademark":0},{"opinion":0,"patent":0,"pattern":"IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS \nFOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR \nCOPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER \nIN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN \nCONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE. ","trademark":0},{"opinion":0,"patent":0,"pattern":"  * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","trademark":0},{"opinion":0,"patent":0,"pattern":"  * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n  * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\n  * OF THE POSSIBILITY OF SUCH DAMAGE.","trademark":0},{"opinion":0,"patent":0,"pattern":" * ABSOLUTELY NO WARRANTY                      *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"\"There is NO WARRANTY, to the extent permitted by law.\\n\");","trademark":0}],"risk":1,"url":null}