{"description":null,"eula":0,"name":"any reference remote","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"  The IETF takes no position regarding the validity or scope of any\n  Intellectual Property Rights or other rights that might be claimed to\n  pertain to the implementation or use of the technology described in\n  this document or the extent to which any license under such rights\n  might or might not be available; nor does it represent that it has\n  made any independent effort to identify any such rights.  Information\n  on the procedures with respect to rights in RFC documents can be found\n  in BCP 78 and BCP 79.\n\n\n  Copies of IPR disclosures made to the IETF Secretariat and any\n  assurances of licenses to be made available, or the result of an\n  attempt made to obtain a general license or permission for the use of\n  such proprietary rights by implementers or users of this specification\n  can be obtained from the IETF on-line IPR repository at\n  http:\/\/www.ietf.org\/ipr.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"# This module is free software, and you may redistribute it and\/or modify\n# it under the same terms as $SKIP5 itself, so long as this copyright message\n# and disclaimer are retained in their original form.\n#\n# IN NO EVENT SHALL THE AUTHOR BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT,\n# SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF\n# THIS CODE, EVEN IF THE AUTHOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\n# DAMAGE.\n#\n# THE AUTHOR SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING, BUT NOT\n# LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\n# PARTICULAR PURPOSE.  THE CODE PROVIDED HEREUNDER IS ON AN \"AS IS\" BASIS,\n# AND THERE IS NO OBLIGATION WHATSOEVER TO PROVIDE MAINTENANCE,\n# SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.","trademark":0},{"opinion":0,"patent":0,"pattern":"!  \n!  \tTHIS SOFTWARE IS FURNISHED UNDER A LICENSE AND MAY BE USED\n!  AND COPIED ONLY IN ACCORDANCE WITH THE TERMS OF SUCH LICENSE AND\n!  WITH THE INCLUSION OF THE ABOVE COPYRIGHT NOTICE.  THIS SOFTWARE OR\n!  ANY OTHER COPIES THEREOF MAY NOT BE PROVIDED OR OTHERWISE MADE\n!  AVAILABLE TO ANY OTHER PERSON.  NO TITLE TO AND OWNERSHIP OF THE\n!  SOFTWARE IS HEREBY TRANSFERRED.","trademark":0},{"opinion":0,"patent":0,"pattern":"        <cc:license\n           $SKIP5 \/>","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/ =================================================================================================\n\/\/ Copyright $SKIP19\n\/\/ All Rights Reserved.\n\/\/\n\/\/ NOTICE:  Adobe permits you to use, modify, and distribute this file in accordance with the terms\n\/\/ of the Adobe license agreement accompanying it.\n\/\/ =================================================================================================","trademark":0},{"opinion":0,"patent":0,"pattern":"    See <http:\/\/mochikit.com\/> for documentation, downloads, license, etc.\n\n    (c) $SKIP19.  All rights Reserved.","trademark":0},{"opinion":0,"patent":0,"pattern":"\/* Portions of the Selector class are derived from $SKIP10,\n * part of YUI-Ext version 0.40, distributed under the terms of an MIT-style\n * license.  Please see http:\/\/www.yui-ext.com\/ for more information. *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"     This file is part of the XSL DocBook Stylesheet distribution.\n     See ..\/README or http:\/\/nwalsh.com\/docbook\/xsl\/ for copyright\n     and other information.","trademark":0},{"opinion":0,"patent":0,"pattern":"     This file is part of the DocBook XSL Stylesheet distribution.\n     See ..\/README or http:\/\/docbook.sf.net\/ for copyright\n     copyright and other information.","trademark":0},{"opinion":0,"patent":0,"pattern":"  Please see the full Copyright clause at\n  <http:\/\/www.w3.org\/Consortium\/Legal\/copyright-software.html>","trademark":0},{"opinion":0,"patent":0,"pattern":" See  http:\/\/4suite.org\/COPYRIGHT  for license and copyright information","trademark":0},{"opinion":0,"patent":0,"pattern":"\"<p>SimpleViewer's plugins are Flash components which are free to use, but \"\n\"use a license which comes into conflict with several distributions. Due to \"\n\"the license it is not possible to ship it with this tool.<\/p><p>You can now \"\n\"download plugin from its homepage and point this tool to the downloaded \"\n\"archive. The archive will be stored with the plugin configuration, so it is \"\n\"available for further use.<\/p><p><b>Note: Please download the plugin that \"\n\"you selected on the first page.<\/b><\/p>\"","trademark":0},{"opinion":0,"patent":0,"pattern":"\"The third-party Image Scan driver software from Epson\/Avasys is required.\\n\"\n\"The Image Scan driver software is made and provided by Epson (formerly Avasys)\\n\"\n\"http:\/\/download.ebz.epson.net\/dsc\/search\/01\/search\/?OSC=LXEpson\\n\"\n\"(formerly Avasys http:\/\/avasys.jp\/eng\/linux_driver\/)\\n\"\n\"where RPM packages for 32-bit (i386) and 64-bit (x86_64) architecture\\n\"\n\"can be downloaded (if you accept the Epson\/Avasys license agreements).\\n\"\n\"The Image Scan driver contains proprietary binary-only software.\\n\"\n\"For some models it is only available for 32-bit (i386) architecture\\n\"\n\"which does not work when you have a 64-bit system installation.\\n\"\n\"Some scanners are also supported by another (free-software) driver.\\n\"\n\"When your scanner model requires a DFSG non-free (proprietary) module,\\n\"\n\"you have to download and install two packages from Epson\/Avasys:\\n\"\n\"The 'iscan' package for the base software and an additional\\n\"\n\"model dependant 'iscan-plugin' package with the proprietary module.\\n\"","trademark":0},{"opinion":0,"patent":0,"pattern":"Some code in core\/src\/java\/org\/apache\/lucene\/util\/ArrayUtil.java was\nderived from Python 2.4.2 sources available at\nhttp:\/\/www.python.org. Full license is here:","trademark":0},{"opinion":0,"patent":0,"pattern":"The full license is available here: \n  http:\/\/source.icu-project.org\/repos\/icu\/icu\/trunk\/license.html","trademark":0},{"opinion":0,"patent":0,"pattern":"Some code in core\/src\/java\/org\/apache\/lucene\/util\/UnicodeUtil.java was\nderived from Python 3.1.2 sources available at\nhttp:\/\/www.python.org. Full license is here:\n\n  http:\/\/www.python.org\/download\/releases\/3.1.2\/license\/","trademark":0},{"opinion":0,"patent":0,"pattern":"\"systems. It is also available for embedded Linux and other embedded and \"\n\"mobile operating systems.<\/p><p>Qt is available under three different \"\n\"licensing options designed to accommodate the needs of our various users.<\/\"\n\"p><p>Qt licensed under our commercial license agreement is appropriate for \"\n\"development of proprietary\/commercial software where you do not want to \"\n\"share any source code with third parties or otherwise cannot comply with the \"\n\"terms of the GNU LGPL version 3 or GNU LGPL version 2.1.<\/p><p>Qt licensed \"\n\"under the GNU LGPL version 3 is appropriate for the development of Qt&nbsp;\"\n\"applications provided you can comply with the terms and conditions of the \"\n\"GNU LGPL version 3.<\/p><p>Qt licensed under the GNU LGPL version 2.1 is \"\n\"appropriate for the development of Qt&nbsp;applications provided you can \"\n\"comply with the terms and conditions of the GNU LGPL version 2.1.<\/\"\n\"p><p>Please see <a href=\\\"http:\/\/%2\/\\\">%2<\/a> for an overview of Qt \"\n\"licensing.<\/p><p>Copyright (C) %1 The Qt Company Ltd and other contributors.\"\n\"<\/p><p>Qt and the Qt logo are trademarks of The Qt Company Ltd.<\/p><p>Qt is \"\n\"The Qt Company Ltd product developed as an open source project. See <a href=\"\n\"\\\"http:\/\/%3\/\\\">%3<\/a> for more information.<\/p>\"","trademark":0},{"opinion":0,"patent":0,"pattern":" * See netcdf\/COPYRIGHT file for copying and redistribution conditions.      *","trademark":0},{"opinion":0,"patent":0,"pattern":"# Licensed under the same terms as $SKIP2 itself.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"# Copyright (C) $SKIP10\n# This file is distributed under the same license as the $SKIP3 package.","trademark":0}],"risk":2,"url":null}