{"description":null,"eula":0,"name":"GPL-2.0 WITH Linking-exception","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"\/* As a special exception, if you link this library with other files,\n   some of which are compiled with GCC, to produce an executable,\n   this library does not by itself cause the resulting executable\n   to be covered by the GNU General Public License.\n   This exception does not however invalidate any other reasons why\n   the executable file might be covered by the GNU General Public License.  *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"# In addition to the permissions in the GNU General Public License, the\n# Free Software Foundation gives you unlimited permission to link the\n# compiled version of this file into combinations with other programs,\n# and to distribute those combinations without any restriction coming\n# from the use of this file.  (The General Public License restrictions\n# do apply in other respects; for example, they cover modification of\n# the file, and distribution when not linked into a combine\n# executable.)","trademark":0},{"opinion":0,"patent":0,"pattern":"# In addition to the permissions in the GNU General Public License, the\n# Free Software Foundation gives you unlimited permission to link the\n# compiled version of this file into combinations with other programs,\n# and to distribute those combinations without any restriction coming\n# from the use of this file.  (The General Public License restrictions\n# do apply in other respects; for example, they cover modification of\n# the file, and distribution when not linked into a combine\n# executable.)\n# \n# GCC is distributed in the hope that it will be useful, but WITHOUT ANY\n# WARRANTY; without even the implied warranty of MERCHANTABILITY or\n# FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License\n# for more details.\n# ","trademark":0},{"opinion":0,"patent":0,"pattern":"   This file is free software; you can redistribute it and\/or modify\n   it under the terms of the GNU General Public License as published by\n   the Free Software Foundation; either version 2 of the License, or\n   (at your option) any later version.\n\n   In addition to the permissions in the GNU General Public License, the\n   Free Software Foundation gives you unlimited permission to link the\n   compiled version of this file into combinations with other programs,\n   and to distribute those combinations without any restriction coming\n   from the use of this file.  (The General Public License restrictions\n   do apply in other respects; for example, they cover modification of\n   the file, and distribution when not linked into a combined\n   executable.)\n","trademark":0},{"opinion":0,"patent":0,"pattern":"GNU Classpath is free software; you can redistribute it and\/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation; either version 2, or (at your option)\nany later version.\n\nGNU Classpath is distributed in the hope that it will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\nGeneral Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with GNU Classpath; see the file COPYING.  If not, write to the\nFree Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA\n02111-1307 USA.\n\nLinking this library statically or dynamically with other modules is\nmaking a combined work based on this library.  Thus, the terms and\nconditions of the GNU General Public License cover the whole\ncombination.\n\nAs a special exception, the copyright holders of this library give you\npermission to link this library with independent modules to produce an\nexecutable, regardless of the license terms of these independent\nmodules, and to copy and distribute the resulting executable under\nterms of your choice, provided that you also meet, for each linked\nindependent module, the terms and conditions of the license of that\nmodule.  An independent module is a module which is not derived from\nor based on this library.  If you modify this library, you may extend\nthis exception to your version of the library, but you are not\nobligated to do so.  If you do not wish to do so, delete this\nexception statement from your version. *\/\n","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/ Linking this library statically or dynamically with other modules is\n\/\/ making a combined work based on this library.  Thus, the terms and\n\/\/ conditions of the GNU General Public License cover the whole\n\/\/ combination.\n\/\/ \n\/\/ As a special exception, the copyright holders of this library give you\n\/\/ permission to link this library with independent modules to produce an\n\/\/ executable, regardless of the license terms of these independent\n\/\/ modules, and to copy and distribute the resulting executable under\n\/\/ terms of your choice, provided that you also meet, for each linked\n\/\/ independent module, the terms and conditions of the license of that\n\/\/ module.  An independent module is a module which is not derived from\n\/\/ or based on this library.  If you modify this library, you may extend\n\/\/ this exception to your version of the library, but you are not\n\/\/ obligated to do so.  If you do not wish to do so, delete this\n\/\/ exception statement from your version.","trademark":0},{"opinion":0,"patent":0,"pattern":"!GNU libgfortran is free software; you can redistribute it and\/or\n!modify it under the terms of the GNU General Public\n!License as published by the Free Software Foundation; either\n!version 2 of the License, or (at your option) any later version.\n\n!In addition to the permissions in the GNU General Public License, the\n!Free Software Foundation gives you unlimited permission to link the\n!compiled version of this file into combinations with other programs,\n!and to distribute those combinations without any restriction coming\n!from the use of this file.  (The General Public License restrictions\n!do apply in other respects; for example, they cover modification of\n!the file, and distribution when not linked into a combine\n!executable.)\n!\n!GNU libgfortran is distributed in the hope that it will be useful,\n!but WITHOUT ANY WARRANTY; without even the implied warranty of\n!MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the","trademark":0},{"opinion":0,"patent":0,"pattern":" * OUT ANY WARRANTY;  without even the  implied warranty of MERCHANTABILITY *\n * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License *\n * for  more details.  You should have  received  a copy of the GNU General *\n * Public License  distributed with GNAT;  see file COPYING.  If not, write *\n * to  the  Free Software Foundation,  51  Franklin  Street,  Fifth  Floor, *\n * Boston, MA 02110-1301, USA.                                              *\n *                                                                          *\n * As a  special  exception,  if you  link  this file  with other  files to *\n * produce an executable,  this file does not by itself cause the resulting *\n * executable to be covered by the GNU General Public License. This except- *\n * ion does not  however invalidate  any other reasons  why the  executable *\n * file might be covered by the  GNU Public License.                        *","trademark":0},{"opinion":0,"patent":0,"pattern":" * This file is free software; you can redistribute it and\/or modify it\n * under the terms of the GNU General Public License as published by the\n * Free Software Foundation; either version 2, or (at your option) any\n * later version.\n * \n * In addition to the permissions in the GNU General Public License, the\n * Free Software Foundation gives you unlimited permission to link the\n * compiled version of this file with other programs, and to distribute\n * those programs without any restriction coming from the use of this\n * file.  (The General Public License restrictions do apply in other\n * respects; for example, they cover modification of the file, and\n * distribution when not linked into another program.)\n * \n * This file is distributed in the hope that it will be useful, but\n * WITHOUT ANY WARRANTY; without even the implied warranty of\n * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n * General Public License for more details.\n * \n * You should have received a copy of the GNU General Public License\n * along with this program; see the file COPYING.  If not, write to\n * the Free Software Foundation, 51 Franklin Street, Fifth Floor,\n * Boston, MA 02110-1301, USA.\n * \n *    As a special exception, if you link this library with files\n *    compiled with GCC to produce an executable, this does not cause\n *    the resulting executable to be covered by the GNU General Public License.\n *    This exception does not however invalidate any other reasons why\n *    the executable file might be covered by the GNU General Public License.","trademark":0},{"opinion":0,"patent":0,"pattern":" # In addition to the permissions in the GNU General Public License, the\n # Free Software Foundation gives you unlimited permission to link the\n # compiled version of this file with other programs, and to distribute\n # those programs without any restriction coming from the use of this\n # file.  (The General Public License restrictions do apply in other\n # respects; for example, they cover modification of the file, and\n # distribution when not linked into another program.)\n\n # This file is distributed in the hope that it will be useful, but\n # WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY","trademark":0},{"opinion":0,"patent":0,"pattern":"MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with GCC; see the file COPYING.  If not, write to\nthe Free Software Foundation, 51 Franklin Street, Fifth Floor,\nBoston, MA 02110-1301, USA.  *\/\n\n\/* As a special exception, if you link this library with files\n   compiled with GCC to produce an executable, this does not cause\n   the resulting executable to be covered by the GNU General Public License.\n   This exception does not however invalidate any other reasons why\n   the executable file might be covered by the GNU General Public License.  *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"As a special exception, if you link this library with files\ncompiled with a GNU compiler to produce an executable, this does not cause\nthe resulting executable to be covered by the GNU General Public License.\nThis exception does not however invalidate any other reasons why\nthe executable file might be covered by the GNU General Public License. *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"As a special exception, if you link this library with other files to\nproduce an executable, this library does not by itself cause the\nresulting executable to be covered by the GNU General Public License.\nThis exception does not however invalidate any other reasons why the\nexecutable file might be covered by the GNU General Public License. ","trademark":0},{"opinion":0,"patent":0,"pattern":"(*   Copyright $SKIP19  All rights reserved.          *)\n(*   This file is distributed under the terms of the GNU Library         *)\n(*   General Public License, with the special exception on linking       *)\n(*   described in file ..\/..\/..\/LICENSE.                                 *)\n(*                                                                       *)\n(*************************************************************************)","trademark":0},{"opinion":1,"patent":0,"pattern":"\"Totem contains an exception to allow the use of proprietary GStreamer \"\n\"plugins.\"","trademark":0},{"opinion":0,"patent":0,"pattern":"As a special exception, you may use this file as part of a free software\nlibrary without restriction.  Specifically, if other files instantiate\ntemplates or use macros or inline functions from this file, or you compile\nthis file and link it with other files to produce an executable, this\nfile does not by itself cause the resulting executable to be covered by\nthe GNU General Public License.  This exception does not however    \ninvalidate any other reasons why the executable file might be covered by\nthe GNU General Public License.    \n\nThis exception applies only to the code released under the name GNU\n$SKIP19.  If you copy code from other releases into a copy of GNU\n$SKIP19, as the General Public License permits, the exception does\nnot apply to the code that you add in this way.  To avoid misleading\nanyone as to the status of such modified files, you must delete\nthis exception notice from them.\n\nIf you write modifications of your own for GNU $SKIP19, it is your choice\nwhether to permit this exception to apply to your modifications.\nIf you do not wish that, delete this exception notice.","trademark":0},{"opinion":0,"patent":0,"pattern":"# kBuild is distributed in the hope that it will be useful,\n# but WITHOUT ANY WARRANTY; without even the implied warranty of\n# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n# GNU General Public License for more details.\n#\n# You should have received a copy of the GNU General Public License\n# along with kBuild; if not, write to the Free Software\n# Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA\n#\n#\n# As a special exception you are granted permission to include this file, via\n# the kmk include directive, as you wish without this in itself causing the\n# resulting makefile, program or whatever to be covered by the GPL license.\n# This exception does not however invalidate any other reasons why the makefile,\n# program, whatever should not be covered the GPL.","trademark":0},{"opinion":0,"patent":0,"pattern":"\"Ekiga is licensed under the GPL license and as a special exception, you have \"\n\"permission to link or otherwise combine this program with the programs OPAL, \"\n\"OpenH323 and PWLIB, and distribute the combination, without applying the \"\n\"requirements of the GNU GPL to the OPAL, OpenH323 and PWLIB programs, as \"\n\"long as you do follow the requirements of the GNU GPL for all the rest of \"\n\"the software thus combined.\"","trademark":0},{"opinion":0,"patent":0,"pattern":"\/*\r\n * Copyright (C) $SKIP10. All rights reserved.\r\n *\r\n * This file is part of $SKIP5, distributed under the GNU GPL v2 with\r\n * a Linking Exception. For full terms see the included COPYING file.\r\n *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"is free software; you can redistribute it and\/or modify it\nunder the terms of the GNU General Public License, version 2, as\npublished by the Free Software Foundation.\n\n$SKIP5 is distributed in the hope that it will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\nGeneral Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with $SKIP5 if not, write to the Free Software\nFoundation, Inc., $SKIP20\n\nIn addition, as a special exception, the copyright holders give\npermission to link the code of this program with any edition of\nthe Qt library by Trolltech AS, Norway (or with modified versions\nof Qt that use the same license as Qt), and distribute linked\ncombinations including the two.  You must obey the GNU General\nPublic License in all respects for all of the code used other than\nQt.  If you modify this file, you may extend this exception to\nyour version of the file, but you are not obligated to do so.  If\nyou do not wish to do so, delete this exception statement from\nyour version.\n","trademark":0}],"risk":2,"url":null}