{"description":"purpose with or without fee is hereby granted\n","eula":0,"name":"Any permissive","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"**  Copyright $SKIP19\n**\n**  Permission to use, copy, modify, and distribute this software for any\n**  purpose with or without fee is hereby granted, provided that the above\n**  copyright notice and this permission notice appear in all copies.\n**\n**  THE SOFTWARE IS PROVIDED \"AS IS\" AND INTERNET SOFTWARE CONSORTIUM\n**  DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL\n**  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS.  IN NO EVENT SHALL\n**  INTERNET SOFTWARE CONSORTIUM BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT,\n**  OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF\n**  USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR\n**  OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\n**  PERFORMANCE OF THIS SOFTWARE.\n*\/","trademark":0},{"opinion":0,"patent":0,"pattern":"\/* | Copyright $SKIP19                                           | *\/\n\/* |   Permission to use, copy, modify, and distribute this software   | *\/\n\/* |   and its documentation for any purpose and without fee is hereby | *\/\n\/* |   granted, provided that the above copyright notice appear in all | *\/\n\/* |   copies and that both that copyright notice and this permission  | *\/\n\/* |   notice appear in supporting documentation.  This software is    | *\/\n\/* |   provided \"as is\" without express or implied warranty.           | *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/  Copyright (c) $SKIP19\n\/\/\n\/\/  Permission to copy, use, modify, sell and distribute this software\n\/\/  is granted provided this copyright notice appears in all copies.\n\/\/  This software is provided \"as is\" without express or implied\n\/\/  warranty, and with no claim as to its suitability for any purpose.","trademark":0},{"opinion":0,"patent":0,"pattern":"# Copyright (c) $SKIP19. All rights reserved.\n# \n# THIS MATERIAL IS PROVIDED AS IS, WITH ABSOLUTELY NO WARRANTY EXPRESSED\n# OR IMPLIED.  ANY USE IS AT YOUR OWN RISK.\n# \n# Permission is hereby granted to use or copy this program\n# for any purpose,  provided the above notices are retained on all copies.\n# Permission to modify the code and to distribute modified code is granted,\n# provided the above notices are retained, and a notice that the code was\n# modified is included with the above copyright notice.","trademark":0},{"opinion":0,"patent":0,"pattern":"# \n# \n# THIS MATERIAL IS PROVIDED AS IS, WITH ABSOLUTELY NO WARRANTY EXPRESSED\n# OR IMPLIED.  ANY USE IS AT YOUR OWN RISK.\n# \n# Permission is hereby granted to use or copy this program\n# for any purpose,  provided the above notices are retained on all copies.\n# Permission to modify the code and to distribute modified code is granted,\n# provided the above notices are retained, and a notice that the code was\n# modified is included with the above copyright notice.","trademark":0},{"opinion":0,"patent":0,"pattern":"-- GNAT.  In accordance with the copyright of that document, you can freely --\n-- copy and modify this specification,  provided that if you redistribute a --\n-- modified version,  any changes that you have made are clearly indicated. --","trademark":0},{"opinion":0,"patent":0,"pattern":"\n   Permission is hereby granted, free of charge, to any person obtaining\n   a copy of this software and associated documentation files (the\n   ``Software''), to deal in the Software without restriction, including\n   without limitation the rights to use, copy, modify, merge, publish,\n   distribute, sublicense, and\/or sell copies of the Software, and to\n   permit persons to whom the Software is furnished to do so, subject to\n   the following conditions:\n\n   The above copyright notice and this permission notice shall be included\n   in all copies or substantial portions of the Software.\n\n   THE SOFTWARE IS PROVIDED ``AS IS'', WITHOUT WARRANTY OF ANY KIND, EXPRESS\n   OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\n   IN NO EVENT SHALL CYGNUS SOLUTIONS BE LIABLE FOR ANY CLAIM, DAMAGES OR\n   OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,\n   ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR\n   OTHER DEALINGS IN THE SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/  (C) $SKIP10\n\/\/  Permission to copy, use, modify, sell and\n\/\/  distribute this software is granted provided this copyright notice appears\n\/\/  in all copies. This software is provided \"as is\" without express or implied\n\/\/  warranty, and with no claim as to its suitability for any purpose.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"# Copyright (C) $SKIP19 \n#\n# Permission to use, copy, modify, and distribute this software and its\n# documentation for any purpose with or without fee is hereby granted,\n# provided that the above copyright notice and this permission notice\n# appear in all copies.\n#\n# THE SOFTWARE IS PROVIDED \"AS IS\" AND NOMINUM DISCLAIMS ALL WARRANTIES\n# WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF\n# MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL NOMINUM BE LIABLE FOR\n# ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\n# WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\n# ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT\n# OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":"Permission to use, copy, modify, and distribute this software and its \ndocumentation for any purpose and without fee is hereby granted, \nprovided that the above copyright notice appear in all copies and that\nboth that copyright notice and this permission notice appear in \nsupporting documentation, and that the name $SKIP10 not be\nused in advertising or publicity pertaining to distribution of the\nsoftware without specific, written prior permission.  \n\n$SKIP10 DISCLAIM ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, \nINCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO \nEVENT SHALL $SKIP10 BE LIABLE FOR ANY SPECIAL, INDIRECT OR \nCONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF \nUSE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR \nOTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR \nPERFORMANCE OF THIS SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":"Permission to use, copy, modify, and distribute this software \nand its documentation for any purpose and without fee is hereby \ngranted, provided that the above copyright notice appear in all \ncopies and that both that copyright notice and this permission \nnotice appear in supporting documentation, and that \n$SKIP10 not be used in advertising or publicity \npertaining to distribution of the software without specific, written \nprior permission.","trademark":0},{"opinion":0,"patent":0,"pattern":" * Developed at SunSoft, a Sun Microsystems, Inc. business.\n * Permission to use, copy, modify, and distribute this\n * software is freely granted, provided that this notice \n * is preserved.","trademark":0},{"opinion":0,"patent":0,"pattern":"# Permission is hereby granted, without written agreement and without\n# license or royalty fees, to use, copy, modify, and distribute this\n# software and its documentation for any purpose, provided that the\n# above copyright notice and the following two paragraphs appear in\n# all copies of this software.\n# \n# IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE TO ANY PARTY FOR\n# DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES \n# ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN \n# IF THE COPYRIGHT HOLDER HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH \n# DAMAGE.\n#\n# THE COPYRIGHT HOLDER SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING, \n# BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND \n# FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS\n# ON AN \"AS IS\" BASIS, AND THE COPYRIGHT HOLDER HAS NO OBLIGATION TO\n# PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.","trademark":0},{"opinion":0,"patent":0,"pattern":"Copyright (c) $SKIP19\n\nPermission is hereby granted, free of charge, to any person or organization\nobtaining a copy of the software and accompanying documentation covered by\nthis license (the \"Software\") to use, reproduce, display, distribute,\nexecute, and transmit the Software, and to prepare derivative works of the\nSoftware, and to permit third-parties to whom the Software is furnished to\ndo so, all subject to the following:\n\nThe copyright notices in the Software and this entire statement, including\nthe above license grant, this restriction and the following disclaimer,\nmust be included in all copies of the Software, in whole or in part, and\nall derivative works of the Software, unless such copies or derivative\nworks are solely in the form of machine-executable object code generated by\na source language processor.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT\nSHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE\nFOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,\nARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\nDEALINGS IN THE SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":"License:        Other uncritical OpenSource License ","trademark":0},{"opinion":0,"patent":0,"pattern":" * ====================================================\n * Copyright $SKIP19.  All Rights Reserved.\n *\n * Developed at SunPro, a Sun Microsystems, Inc. business.\n * Permission to use, copy, modify, and distribute this\n * software is freely granted, provided that this notice \n * is preserved.\n * ====================================================","trademark":0},{"opinion":0,"patent":0,"pattern":"     Permission to use, copy, modify and distribute $SKIP5 and its\n     accompanying documentation for any purpose and without fee is hereby\n     granted in perpetuity, provided that the above copyright notice and\n     this paragraph appear in all copies.  The copyright holders make no\n     representation about the suitability of $SKIP5 for any purpose.\n\n     It is provided \"as is\" without expressed or implied warranty.","trademark":0},{"opinion":0,"patent":0,"pattern":"Copyright $SKIP19\nYou may freely use, modify and\/or distribute this file.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"# Permission to use, copy, modify, distribute, and sell this software and its\n# documentation for any purpose is hereby granted without fee, provided that\n# the above copyright notice appear in all copies and that both that\n# copyright notice and this permission notice appear in supporting\n# documentation.  No representations are made about the suitability of this\n# software for any purpose.  It is provided \"as is\" without express or\n# implied warranty.","trademark":0},{"opinion":0,"patent":0,"pattern":"\n.\\\" Copyright (c) $SKIP30\n.\\\" Copyright (c) $SKIP30\n.\\\"\n.\\\" Permission to use, copy, modify, distribute, and sell this software and \n.\\\" its documentation for any purpose is hereby granted without fee, provided\n.\\\" that (i) the above copyright notices and this permission notice appear in\n.\\\" all copies of the software and related documentation, and (ii) the names of\n.\\\" $SKIP30 may not be used in any advertising or\n.\\\" publicity relating to the software without the specific, prior written\n.\\\" permission of $SKIP30\n.\\\" \n.\\\" THE SOFTWARE IS PROVIDED \"AS-IS\" AND WITHOUT WARRANTY OF ANY KIND, \n.\\\" EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY \n.\\\" WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.  \n.\\\" \n.\\\" IN NO EVENT SHALL SAM LEFFLER OR SILICON GRAPHICS BE LIABLE FOR\n.\\\" ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND,\n.\\\" OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\n.\\\" WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF \n.\\\" LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE \n.\\\" OF THIS SOFTWARE.\n\n","trademark":0}],"risk":1,"url":null}