{"description":null,"eula":0,"name":"CC0-1.0","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"\/* Any copyright is dedicated to the Public Domain.\n * http:\/\/creativecommons.org\/publicdomain\/zero\/1.0\/\n *\/","trademark":0},{"opinion":0,"patent":0,"pattern":" * This code is meant to be linked in to various programs that run on Linux.\n * As such, it is available with as few restrictions as possible.  This file\n * is licensed under the Creative Commons Zero License, version 1.0,\n * available at http:\/\/creativecommons.org\/publicdomain\/zero\/1.0\/legalcode","trademark":0},{"opinion":0,"patent":0,"pattern":"   Written in $SKIP1 by $SKIP10\n\n   To the extent possible under law, the author(s) have dedicated all copyright\n   and related and neighboring rights to this software to the public domain\n   worldwide. This software is distributed without any warranty.\n\n   You should have received a copy of the CC0 Public Domain Dedication along with\n   this software. If not, see <http:\/\/creativecommons.org\/publicdomain\/zero\/1.0\/>.","trademark":0},{"opinion":0,"patent":0,"pattern":"The person who associated a work with this deed has dedicated the work to\nthe public domain by waiving all of his or her rights to the work worldwide under\ncopyright law, including all related and neighboring rights, to the extent allowed\nby law.\n\nYou can copy, modify, distribute and perform the work, even for commercial\npurposes, all without asking permission. See Other Information below.\n\nhttp:\/\/creativecommons.org\/publicdomain\/zero\/1.0\/legalcode","trademark":0},{"opinion":0,"patent":0,"pattern":"The laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator and\nsubsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and\/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for the\npurpose of contributing to a commons of creative, cultural and scientific\nworks (\"Commons\") that the public can reliably and without fear of later\nclaims of infringement build upon, modify, incorporate in other works, reuse\nand redistribute as freely as possible in any form whatsoever and for any\npurposes, including without limitation commercial purposes. These owners may\ncontribute to the Commons to promote the ideal of a free culture and the\nfurther production of creative, cultural and scientific works, or to gain\nreputation or greater distribution for their Work in part through the use and\nefforts of others.\n\nFor these and\/or other purposes and motivations, and without any expectation\nof additional consideration or compensation, the person associating CC0 with a\nWork (the \"Affirmer\"), to the extent that he or she is an owner of Copyright\nand Related Rights in the Work, voluntarily elects to apply CC0 to the Work\nand publicly distribute the Work under its terms, with knowledge of his or her\nCopyright and Related Rights in the Work and the meaning and intended legal\neffect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not limited\nto, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display, communicate,\n  and translate a Work;\n\n  ii. moral rights retained by the original author(s) and\/or performer(s);\n\n  iii. publicity and privacy rights pertaining to a person's image or likeness\n  depicted in a Work;\n\n  iv. rights protecting against unfair competition in regards to a Work,\n  subject to the limitations in paragraph 4(a), below;\n\n  v. rights protecting the extraction, dissemination, use and reuse of data in\n  a Work;\n\n  vi. database rights (such as those arising under Directive 96\/9\/EC of the\n  European Parliament and of the Council of 11 March 1996 on the legal\n  protection of databases, and under any national implementation thereof,\n  including any amended or successor version of such directive); and\n\n  vii. other similar, equivalent or corresponding rights throughout the world\n  based on applicable law or treaty, and any national implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention of,\napplicable law, Affirmer hereby overtly, fully, permanently, irrevocably and\nunconditionally waives, abandons, and surrenders all of Affirmer's Copyright\nand Related Rights and associated claims and causes of action, whether now\nknown or unknown (including existing as well as future claims and causes of\naction), in the Work (i) in all territories worldwide, (ii) for the maximum\nduration provided by applicable law or treaty (including future time\nextensions), (iii) in any current or future medium and for any number of\ncopies, and (iv) for any purpose whatsoever, including without limitation\ncommercial, advertising or promotional purposes (the \"Waiver\"). Affirmer makes\nthe Waiver for the benefit of each member of the public at large and to the\ndetriment of Affirmer's heirs and successors, fully intending that such Waiver\nshall not be subject to revocation, rescission, cancellation, termination, or\nany other legal or equitable action to disrupt the quiet enjoyment of the Work\nby the public as contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason be\njudged legally invalid or ineffective under applicable law, then the Waiver\nshall be preserved to the maximum extent permitted taking into account\nAffirmer's express Statement of Purpose. In addition, to the extent the Waiver\nis so judged Affirmer hereby grants to each affected person a royalty-free,\nnon transferable, non sublicensable, non exclusive, irrevocable and\nunconditional license to exercise Affirmer's Copyright and Related Rights in\nthe Work (i) in all territories worldwide, (ii) for the maximum duration\nprovided by applicable law or treaty (including future time extensions), (iii)\nin any current or future medium and for any number of copies, and (iv) for any\npurpose whatsoever, including without limitation commercial, advertising or\npromotional purposes (the \"License\"). The License shall be deemed effective as\nof the date CC0 was applied by Affirmer to the Work. Should any part of the\nLicense for any reason be judged legally invalid or ineffective under\napplicable law, such partial invalidity or ineffectiveness shall not\ninvalidate the remainder of the License, and in such case Affirmer hereby\naffirms that he or she will not (i) exercise any of his or her remaining\nCopyright and Related Rights in the Work or (ii) assert any associated claims\nand causes of action with respect to the Work, in either case contrary to\nAffirmer's express Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n  a. No trademark or patent rights held by Affirmer are waived, abandoned,\n  surrendered, licensed or otherwise affected by this document.\n\n  b. Affirmer offers the Work as-is and makes no representations or warranties\n  of any kind concerning the Work, express, implied, statutory or otherwise,\n  including without limitation warranties of title, merchantability, fitness\n  for a particular purpose, non infringement, or the absence of latent or\n  other defects, accuracy, or the present or absence of errors, whether or not\n  discoverable, all to the greatest extent permissible under applicable law.\n\n  c. Affirmer disclaims responsibility for clearing rights of other persons\n  that may apply to the Work or any use thereof, including without limitation\n  any person's Copyright and Related Rights in the Work. Further, Affirmer\n  disclaims responsibility for obtaining any necessary consents, permissions\n  or other rights required for any use of the Work.\n\n  d. Affirmer understands and acknowledges that Creative Commons is not a\n  party to this document and has no duty or obligation with respect to this\n  CC0 or use of the Work.","trademark":0},{"opinion":0,"patent":0,"pattern":"\/* CC0 (Public domain) - see LICENSE file for details *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/ This work is subject to the CC0 1.0 Universal (CC0 1.0) Public Domain Dedication\r\n\/\/ license. Its contents can be found at:\r\n\/\/ http:\/\/creativecommons.org\/publicdomain\/zero\/1.0\/","trademark":0},{"opinion":0,"patent":0,"pattern":"http:\/\/creativecommons.org\/publicdomain\/zero\/1.0\/","trademark":0},{"opinion":0,"patent":0,"pattern":"license: CC-Zero\/Public-Domain","trademark":0},{"opinion":0,"patent":0,"pattern":"   To the extent possible under law, the author(s) have dedicated all copyright\n   and related and neighboring rights to this software to the public domain\n   worldwide. This software is distributed without any warranty.\n\n   You should have received a copy of the CC0 Public Domain Dedication along with\n   this software. If not, see <http:\/\/creativecommons.org\/publicdomain\/zero\/1.0\/>.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"Statement of Purpose\r\n\r\nThe laws of most jurisdictions throughout the world automatically confer\r\nexclusive Copyright and Related Rights (defined below) upon the creator and\r\nsubsequent owner(s) (each and all, an \"owner\") of an original work of\r\nauthorship and\/or a database (each, a \"Work\").\r\n\r\nCertain owners wish to permanently relinquish those rights to a Work for the\r\npurpose of contributing to a commons of creative, cultural and scientific works\r\n(\"Commons\") that the public can reliably and without fear of later claims of\r\ninfringement build upon, modify, incorporate in other works, reuse and\r\nredistribute as freely as possible in any form whatsoever and for any purposes,\r\nincluding without limitation commercial purposes. These owners may contribute\r\nto the Commons to promote the ideal of a free culture and the further\r\nproduction of creative, cultural and scientific works, or to gain reputation or\r\ngreater distribution for their Work in part through the use and efforts of\r\nothers.\r\n\r\nFor these and\/or other purposes and motivations, and without any expectation of\r\nadditional consideration or compensation, the person associating CC0 with a\r\nWork (the \"Affirmer\"), to the extent that he or she is an owner of Copyright\r\nand Related Rights in the Work, voluntarily elects to apply CC0 to the Work and\r\npublicly distribute the Work under its terms, with knowledge of his or her\r\nCopyright and Related Rights in the Work and the meaning and intended legal\r\neffect of CC0 on those rights.\r\n\r\n1. Copyright and Related Rights. A Work made available under CC0 may be\r\nprotected by copyright and related or neighboring rights (\"Copyright and\r\nRelated Rights\"). Copyright and Related Rights include, but are not limited to,\r\nthe following:\r\n\r\n    the right to reproduce, adapt, distribute, perform, display, communicate,\r\nand translate a Work; moral rights retained by the original author(s) and\/or\r\nperformer(s); publicity and privacy rights pertaining to a person's image or\r\nlikeness depicted in a Work; rights protecting against unfair competition in\r\nregards to a Work, subject to the limitations in paragraph 4(a), below; rights\r\nprotecting the extraction, dissemination, use and reuse of data in a Work;\r\ndatabase rights (such as those arising under Directive 96\/9\/EC of the European\r\nParliament and of the Council of 11 March 1996 on the legal protection of\r\ndatabases, and under any national implementation thereof, including any amended\r\nor successor version of such directive); and other similar, equivalent or\r\ncorresponding rights throughout the world based on applicable law or treaty,\r\nand any national implementations thereof.\r\n\r\n2. Waiver. To the greatest extent permitted by, but not in contravention of,\r\napplicable law, Affirmer hereby overtly, fully, permanently, irrevocably and\r\nunconditionally waives, abandons, and surrenders all of Affirmer's Copyright\r\nand Related Rights and associated claims and causes of action, whether now\r\nknown or unknown (including existing as well as future claims and causes of\r\naction), in the Work (i) in all territories worldwide, (ii) for the maximum\r\nduration provided by applicable law or treaty (including future time\r\nextensions), (iii) in any current or future medium and for any number of\r\ncopies, and (iv) for any purpose whatsoever, including without limitation\r\ncommercial, advertising or promotional purposes (the \"Waiver\"). Affirmer makes\r\nthe Waiver for the benefit of each member of the public at large and to the\r\ndetriment of Affirmer's heirs and successors, fully intending that such Waiver\r\nshall not be subject to revocation, rescission, cancellation, termination, or\r\nany other legal or equitable action to disrupt the quiet enjoyment of the Work\r\nby the public as contemplated by Affirmer's express Statement of Purpose.\r\n\r\n3. Public License Fallback. Should any part of the Waiver for any reason be\r\njudged legally invalid or ineffective under applicable law, then the Waiver\r\nshall be preserved to the maximum extent permitted taking into account\r\nAffirmer's express Statement of Purpose. In addition, to the extent the Waiver\r\nis so judged Affirmer hereby grants to each affected person a royalty-free, non\r\ntransferable, non sublicensable, non exclusive, irrevocable and unconditional\r\nlicense to exercise Affirmer's Copyright and Related Rights in the Work (i) in\r\nall territories worldwide, (ii) for the maximum duration provided by applicable\r\nlaw or treaty (including future time extensions), (iii) in any current or\r\nfuture medium and for any number of copies, and (iv) for any purpose\r\nwhatsoever, including without limitation commercial, advertising or promotional\r\npurposes (the \"License\"). The License shall be deemed effective as of the date\r\nCC0 was applied by Affirmer to the Work. Should any part of the License for any\r\nreason be judged legally invalid or ineffective under applicable law, such\r\npartial invalidity or ineffectiveness shall not invalidate the remainder of the\r\nLicense, and in such case Affirmer hereby affirms that he or she will not (i)\r\nexercise any of his or her remaining Copyright and Related Rights in the Work\r\nor (ii) assert any associated claims and causes of action with respect to the\r\nWork, in either case contrary to Affirmer's express Statement of Purpose.\r\n\r\n4. Limitations and Disclaimers.\r\n\r\n    No trademark or patent rights held by Affirmer are waived, abandoned,\r\nsurrendered, licensed or otherwise affected by this document.  Affirmer offers\r\nthe Work as-is and makes no representations or warranties of any kind\r\nconcerning the Work, express, implied, statutory or otherwise, including\r\nwithout limitation warranties of title, merchantability, fitness for a\r\nparticular purpose, non infringement, or the absence of latent or other\r\ndefects, accuracy, or the present or absence of errors, whether or not\r\ndiscoverable, all to the greatest extent permissible under applicable law.\r\nAffirmer disclaims responsibility for clearing rights of other persons that may\r\napply to the Work or any use thereof, including without limitation any person's\r\nCopyright and Related Rights in the Work. Further, Affirmer disclaims\r\nresponsibility for obtaining any necessary consents, permissions or other\r\nrights required for any use of the Work.  Affirmer understands and acknowledges\r\nthat Creative Commons is not a party to this document and has no duty or\r\nobligation with respect to this CC0 or use of the Work.","trademark":0},{"opinion":0,"patent":0,"pattern":"<url>http:\/\/creativecommons.org\/publicdomain\/zero\/1.0\/<\/url>","trademark":0},{"opinion":0,"patent":0,"pattern":"Creative Commons Legal Code\n\nCC0 1.0 Universal\n\n    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\n    LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN\n    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\n    INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\n    REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS\n    PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM\n    THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED\n    HEREUNDER.\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator\nand subsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and\/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for\nthe purpose of contributing to a commons of creative, cultural and\nscientific works (\"Commons\") that the public can reliably and without fear\nof later claims of infringement build upon, modify, incorporate in other\nworks, reuse and redistribute as freely as possible in any form whatsoever\nand for any purposes, including without limitation commercial purposes.\nThese owners may contribute to the Commons to promote the ideal of a free\nculture and the further production of creative, cultural and scientific\nworks, or to gain reputation or greater distribution for their Work in\npart through the use and efforts of others.\n\nFor these and\/or other purposes and motivations, and without any\nexpectation of additional consideration or compensation, the person\nassociating CC0 with a Work (the \"Affirmer\"), to the extent that he or she\nis an owner of Copyright and Related Rights in the Work, voluntarily\nelects to apply CC0 to the Work and publicly distribute the Work under its\nterms, with knowledge of his or her Copyright and Related Rights in the\nWork and the meaning and intended legal effect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not\nlimited to, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display,\n     communicate, and translate a Work;\n ii. moral rights retained by the original author(s) and\/or performer(s);\niii. publicity and privacy rights pertaining to a person's image or\n     likeness depicted in a Work;\n iv. rights protecting against unfair competition in regards to a Work,\n     subject to the limitations in paragraph 4(a), below;\n  v. rights protecting the extraction, dissemination, use and reuse of data\n     in a Work;\n vi. database rights (such as those arising under Directive 96\/9\/EC of the\n     European Parliament and of the Council of 11 March 1996 on the legal\n     protection of databases, and under any national implementation\n     thereof, including any amended or successor version of such\n     directive); and\nvii. other similar, equivalent or corresponding rights throughout the\n     world based on applicable law or treaty, and any national\n     implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention\nof, applicable law, Affirmer hereby overtly, fully, permanently,\nirrevocably and unconditionally waives, abandons, and surrenders all of\nAffirmer's Copyright and Related Rights and associated claims and causes\nof action, whether now known or unknown (including existing as well as\nfuture claims and causes of action), in the Work (i) in all territories\nworldwide, (ii) for the maximum duration provided by applicable law or\ntreaty (including future time extensions), (iii) in any current or future\nmedium and for any number of copies, and (iv) for any purpose whatsoever,\nincluding without limitation commercial, advertising or promotional\npurposes (the \"Waiver\"). Affirmer makes the Waiver for the benefit of each\nmember of the public at large and to the detriment of Affirmer's heirs and\nsuccessors, fully intending that such Waiver shall not be subject to\nrevocation, rescission, cancellation, termination, or any other legal or\nequitable action to disrupt the quiet enjoyment of the Work by the public\nas contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason\nbe judged legally invalid or ineffective under applicable law, then the\nWaiver shall be preserved to the maximum extent permitted taking into\naccount Affirmer's express Statement of Purpose. In addition, to the\nextent the Waiver is so judged Affirmer hereby grants to each affected\nperson a royalty-free, non transferable, non sublicensable, non exclusive,\nirrevocable and unconditional license to exercise Affirmer's Copyright and\nRelated Rights in the Work (i) in all territories worldwide, (ii) for the\nmaximum duration provided by applicable law or treaty (including future\ntime extensions), (iii) in any current or future medium and for any number\nof copies, and (iv) for any purpose whatsoever, including without\nlimitation commercial, advertising or promotional purposes (the\n\"License\"). The License shall be deemed effective as of the date CC0 was\napplied by Affirmer to the Work. Should any part of the License for any\nreason be judged legally invalid or ineffective under applicable law, such\npartial invalidity or ineffectiveness shall not invalidate the remainder\nof the License, and in such case Affirmer hereby affirms that he or she\nwill not (i) exercise any of his or her remaining Copyright and Related\nRights in the Work or (ii) assert any associated claims and causes of\naction with respect to the Work, in either case contrary to Affirmer's\nexpress Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n a. No trademark or patent rights held by Affirmer are waived, abandoned,\n    surrendered, licensed or otherwise affected by this document.\n b. Affirmer offers the Work as-is and makes no representations or\n    warranties of any kind concerning the Work, express, implied,\n    statutory or otherwise, including without limitation warranties of\n    title, merchantability, fitness for a particular purpose, non\n    infringement, or the absence of latent or other defects, accuracy, or\n    the present or absence of errors, whether or not discoverable, all to\n    the greatest extent permissible under applicable law.\n c. Affirmer disclaims responsibility for clearing rights of other persons\n    that may apply to the Work or any use thereof, including without\n    limitation any person's Copyright and Related Rights in the Work.\n    Further, Affirmer disclaims responsibility for obtaining any necessary\n    consents, permissions or other rights required for any use of the\n    Work.\n d. Affirmer understands and acknowledges that Creative Commons is not a\n    party to this document and has no duty or obligation with respect to\n    this CC0 or use of the Work.\n","trademark":0},{"opinion":0,"patent":0,"pattern":" * This software is Public Domain. To view a copy of the public domain dedication,\n * visit http:\/\/creativecommons.org\/licenses\/publicdomain\/ or send a letter to\n * Creative Commons, 559 Nathan Abbott Way, Stanford, California 94305, USA.\n *\n * I ask and expect, but do not require, that all derivative works contain an\n * attribution similar to:\n","trademark":0},{"opinion":0,"patent":0,"pattern":" *\n * This work is licensed under a Creative Commons CC0 1.0 License\/Waiver.\n *\n * You should have received a copy of the CC0 Public Domain Dedication along\n * with\n * this software. If not, see\n * <http:\/\/creativecommons.org\/publicdomain\/zero\/1.0\/>.\n\n\n\n","trademark":0},{"opinion":0,"patent":0,"pattern":" * This file is made available under the Creative Commons CC0 1.0\n * Universal Public Domain Dedication.\n *\n * The person who associated a work with this deed has dedicated\n * the work to the public domain by waiving all of his or her rights\n * to the work worldwide under copyright law, including all related\n * and neighboring rights, to the extent allowed by law. You can copy,\n * modify, distribute and perform the work, even for commercial purposes,\n * all without asking permission.","trademark":0},{"opinion":0,"patent":0,"pattern":"    You may use this under the\n   terms of the CC0, the OpenSSL Licence, or the Apache Public License 2.0, at\n   your option.  The terms of these licenses can be found at:\n\n   - CC0 1.0 Universal : http:\/\/creativecommons.org\/publicdomain\/zero\/1.0\n   - OpenSSL license   : https:\/\/www.openssl.org\/source\/license.html\n   - Apache 2.0        : http:\/\/www.apache.org\/licenses\/LICENSE-2.0\n","trademark":0},{"opinion":0,"patent":0,"pattern":"***********************************************************************************\n* CC0 1.0 Universal (CC0 1.0)                                                     *\n* Public Domain Dedication                                                        *\n* This is a human-readable summary of the Legal Code.                             *\n*                                                                                 *\n*    The person who associated a work with this deed has dedicated the work to    *\n*    the public domain by waiving all of his or her rights to the work            *\n*    worldwide under copyright law, including all related and neighboring         *\n*    rights, to the extent allowed by law.                                        *\n*                                                                                 *\n*    You can copy, modify, distribute and perform the work, even for commercial   *\n*    purposes, all without asking permission.                                     *\n*                                                                                 *\n***********************************************************************************\n","trademark":0},{"opinion":0,"patent":0,"pattern":"  Certain owners wish to permanently relinquish those rights to a Work for\n  the purpose of contributing to a commons of creative, cultural and\n  scientific works (\"Commons\") that the public can reliably and without\n  fear of later claims of infringement build upon, modify, incorporate in\n  other works, reuse and redistribute as freely as possible in any form\n  whatsoever and for any purposes, including without limitation commercial\n  purposes. These owners may contribute to the Commons to promote the\n  ideal of a free culture and the further production of creative, cultural\n  and scientific works, or to gain reputation or greater distribution for\n","trademark":0},{"opinion":0,"patent":0,"pattern":"This script is licensed CC 0 1.0, so that you can learn from it.\r\n\r\n------ CC 0 1.0 ---------------\r\n\r\nThe person who associated a work with this deed has dedicated the work to the public domain by waiving all of his or her rights to the work worldwide under copyright law, including all related and neighboring rights, to the extent allowed by law.\r\n\r\nYou can copy, modify, distribute and perform the work, even for commercial purposes, all without asking permission.\r\n\r\nhttps:\/\/creativecommons.org\/publicdomain\/zero\/1.0\/legalcode","trademark":0}],"risk":1,"url":"http:\/\/creativecommons.org\/publicdomain\/zero\/1.0\/"}