{"description":null,"eula":0,"name":"VP8","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":";  Copyright (c) $SKIP19. All Rights Reserved.\n;\n;  Use of this source code is governed by a BSD-style license and patent\n;  grant that can be found in the LICENSE file in the root of the source\n;  tree. All contributing project authors may be found in the AUTHORS\n;  file in the root of the source tree.","trademark":0},{"opinion":0,"patent":0,"pattern":"HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nSubject to the terms and conditions of the above License, Google\nhereby grants to You a perpetual, worldwide, non-exclusive,\nno-charge, royalty-free, irrevocable (except as stated in this\nsection) patent license to make, have made, use, offer to sell, sell,\nimport, and otherwise transfer this implementation of VP8, where such\nlicense applies only to those patent claims, both currently owned by\nGoogle and acquired in the future, licensable by Google that are\nnecessarily infringed by this implementation of VP8. If You or your\nagent or exclusive licensee institute or order or agree to the\ninstitution of patent litigation against any entity (including a\ncross-claim or counterclaim in a lawsuit) alleging that this\nimplementation of VP8 or any code incorporated within this\nimplementation of VP8 constitutes direct or contributory patent\ninfringement, or inducement of patent infringement, then any rights\ngranted to You under this License for this implementation of VP8\nshall terminate as of the date such litigation is filed.","trademark":0},{"opinion":0,"patent":0,"pattern":"\/*\n *  Copyright (c) $SKIP19. All Rights Reserved.\n *\n *  Use of this source code is governed by a BSD-style license\n *  that can be found in the dboolhuff.LICENSE file in this directory.\n *  See the libvpx original distribution for more information,\n *  including patent information, and author information.\n *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"\/*\n *  Copyright (c) $SKIP19. All Rights Reserved.\n *\n *  Use of this source code is governed by a BSD-style license\n *  that can be found in the LICENSE file in the root of the source\n *  tree. An additional intellectual property rights grant can be found\n *  in the file PATENTS.  All contributing project authors may\n *  be found in the AUTHORS file in the root of the source tree.\n *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"${prefix} Copyright (c) $SKIP19. All Rights Reserved.${suffix}\n${prefix} ${suffix}\n${prefix} Use of this source code is governed by a BSD-style license${suffix}\n${prefix} that can be found in the LICENSE file in the root of the source${suffix}\n${prefix} tree. An additional intellectual property rights grant can be found${suffix}\n${prefix} in the file PATENTS.  All contributing project authors may${suffix}\n${prefix} be found in the AUTHORS file in the root of the source tree.${suffix}","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/ Copyright $SKIP19 All Rights Reserved.\n\/\/\n\/\/ This code is licensed under the same terms as WebM:\n\/\/  Software License Agreement:  http:\/\/www.webmproject.org\/license\/software\/","trademark":0},{"opinion":0,"patent":0,"pattern":"2) License Notice for V8\n-------------------------\n\nhttp:\/\/code.google.com\/p\/v8\/source\/browse\/trunk\/LICENSE\n\nThis license applies to all parts of V8 that are not externally\nmaintained libraries.  The externally maintained libraries used by V8\nare:\n\n  - Jscre, located under third_party\/jscre.  This code is copyrighted\n    by the University of Cambridge and Apple Inc. and released under a\n    2-clause BSD license.\n\n  - Dtoa, located under third_party\/dtoa.  This code is copyrighted by\n    David M. Gay and released under an MIT license.\n\n  - Strongtalk assembler, the basis of the files assembler-arm-inl.h,\n    assembler-arm.cc, assembler-arm.h, assembler-ia32-inl.h,\n    assembler-ia32.cc, assembler-ia32.h, assembler.cc and assembler.h.\n    This code is copyrighted by Sun Microsystems Inc. and released\n    under a 3-clause BSD license.","trademark":0},{"opinion":0,"patent":0,"pattern":"Additional IP Rights Grant (Patents)\n\n\"This implementation\" means the copyrightable works distributed by\nGoogle as part of the gRPC project.\n\nGoogle hereby grants to You a perpetual, worldwide, non-exclusive,\nno-charge, royalty-free, irrevocable (except as stated in this section)\npatent license to make, have made, use, offer to sell, sell, import,\ntransfer and otherwise run, modify and propagate the contents of this\nimplementation of gRPC, where such license applies only to those patent\nclaims, both currently owned or controlled by Google and acquired in\nthe future, licensable by Google that are necessarily infringed by this\nimplementation of gRPC.  This grant does not include claims that would be\ninfringed only as a consequence of further modification of this\nimplementation.  If you or your agent or exclusive licensee institute or\norder or agree to the institution of patent litigation against any\nentity (including a cross-claim or counterclaim in a lawsuit) alleging\nthat this implementation of gRPC or any code incorporated within this\nimplementation of gRPC constitutes direct or contributory patent\ninfringement, or inducement of patent infringement, then any patent\nrights granted to you under this License for this implementation of gRPC\nshall terminate as of the date such litigation is filed.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/ Copyright (c) 2009 Google Inc. All rights reserved.\n\/\/\n\/\/ Redistribution and use in source and binary forms, with or without\n\/\/ modification, are permitted provided that the following conditions are\n\/\/ met:\n\/\/\n\/\/    * Redistributions of source code must retain the above copyright\n\/\/ notice, this list of conditions and the following disclaimer.\n\/\/    * Redistributions in binary form must reproduce the above\n\/\/ copyright notice, this list of conditions and the following disclaimer\n\/\/ in the documentation and\/or other materials provided with the\n\/\/ distribution.\n\/\/    * Neither the name of Google Inc. nor the names of its\n\/\/ contributors may be used to endorse or promote products derived from\n\/\/ this software without specific prior written permission.\n\/\/\n\/\/ THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\/\/ \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n\/\/ LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n\/\/ A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n\/\/ OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n\/\/ SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n\/\/ LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n\/\/ DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n\/\/ THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n\/\/ (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n\/\/ OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\/\/\n\/\/ Subject to the terms and conditions of this License, Google hereby\n\/\/ grants to You a perpetual, worldwide, non-exclusive, no-charge,\n\/\/ royalty-free, irrevocable (except as stated in this section) patent\n\/\/ license to make, have made, use, offer to sell, sell, import, and\n\/\/ otherwise transfer this implementation of Go, where such license\n\/\/ applies only to those patent claims licensable by Google that are\n\/\/ necessarily infringed by use of this implementation of Go. If You\n\/\/ institute patent litigation against any entity (including a\n\/\/ cross-claim or counterclaim in a lawsuit) alleging that this\n\/\/ implementation of Go or a Contribution incorporated within this\n\/\/ implementation of Go constitutes direct or contributory patent\n\/\/ infringement, then any patent licenses granted to You under this\n\/\/ License for this implementation of Go shall terminate as of the date\n\/\/ such litigation is filed.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"Additional IP Rights Grant (Patents)\n\n\"This implementation\" means the copyrightable works distributed by\nGoogle as part of the Fuchsia project.\n\nGoogle hereby grants to you a perpetual, worldwide, non-exclusive,\nno-charge, royalty-free, irrevocable (except as stated in this\nsection) patent license to make, have made, use, offer to sell, sell,\nimport, transfer, and otherwise run, modify and propagate the contents\nof this implementation of Fuchsia, where such license applies only to\nthose patent claims, both currently owned by Google and acquired in\nthe future, licensable by Google that are necessarily infringed by\nthis implementation. This grant does not include claims that would be\ninfringed only as a consequence of further modification of this\nimplementation. If you or your agent or exclusive licensee institute\nor order or agree to the institution of patent litigation or any other\npatent enforcement activity against any entity (including a\ncross-claim or counterclaim in a lawsuit) alleging that this\nimplementation of Fuchsia constitutes direct or contributory patent\ninfringement, or inducement of patent infringement, then any patent\nrights granted to you under this License for this implementation of\nFuchsia shall terminate as of the date such litigation is filed.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"Additional IP Rights Grant (Patents)\r\n------------------------------------\r\n\r\n\"These implementations\" means the copyrightable works that implement the WebM\r\ncodecs distributed by Google as part of the WebM Project.\r\n\r\nGoogle hereby grants to you a perpetual, worldwide, non-exclusive, no-charge,\r\nroyalty-free, irrevocable (except as stated in this section) patent license to\r\nmake, have made, use, offer to sell, sell, import, transfer, and otherwise\r\nrun, modify and propagate the contents of these implementations of WebM, where\r\nsuch license applies only to those patent claims, both currently owned by\r\nGoogle and acquired in the future, licensable by Google that are necessarily\r\ninfringed by these implementations of WebM. This grant does not include claims\r\nthat would be infringed only as a consequence of further modification of these\r\nimplementations. If you or your agent or exclusive licensee institute or order\r\nor agree to the institution of patent litigation or any other patent\r\nenforcement activity against any entity (including a cross-claim or\r\ncounterclaim in a lawsuit) alleging that any of these implementations of WebM\r\nor any code incorporated within any of these implementations of WebM\r\nconstitute direct or contributory patent infringement, or inducement of\r\npatent infringement, then any patent rights granted to you under this License\r\nfor these implementations of WebM shall terminate as of the date such\r\nlitigation is filed.\r\n\r\n","trademark":0}],"risk":2,"url":"http:\/\/sources.gentoo.org\/viewcvs.py\/gentoo-x86\/licenses\/Adaptec?view=markup"}