{"description":"appear in supporting documentation\r\n","eula":0,"name":"X11","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"# This originates from X11R5 (mit\/util\/scripts\/install.sh), which was\n# later released in X11R6 (xc\/config\/util\/install.sh) with the\n# following copyright and license.\n#\n# Copyright (C) $SKIP19\n#\n# Permission is hereby granted, free of charge, to any person obtaining a copy\n# of this software and associated documentation files (the \"Software\"), to\n# deal in the Software without restriction, including without limitation the\n# rights to use, copy, modify, merge, publish, distribute, sublicense, and\/or\n# sell copies of the Software, and to permit persons to whom the Software is\n# furnished to do so, subject to the following conditions:\n#\n# The above copyright notice and this permission notice shall be included in\n# all copies or substantial portions of the Software.\n#\n# THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE\n# X CONSORTIUM BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN\n# AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNEC-\n# TION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n#\n# Except as contained in this notice, the name of the X Consortium shall not\n# be used in advertising or otherwise to promote the sale, use or other deal-\n# ings in this Software without prior written authorization from the X Consor-\n# tium.\n#\n#\n# FSF changes to this file are in the public domain.\n#\n# Calling this script install-sh is preferred over install.sh, to prevent\n# `make' implicit rules from creating a file called install from it\n# when there is no Makefile.\n#\n# This script is compatible with the BSD install script, but was written\n# from scratch.  It can only install one file at a time, a restriction\n# shared with many OS's install programs.","trademark":0},{"opinion":0,"patent":0,"pattern":"Copyright (c) $SKIP19\nAll rights reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining a\ncopy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, and\/or sell copies of the Software, and to permit persons to\nwhom the Software is furnished to do so, provided that the above\ncopyright notice(s) and this permission notice appear in all copies of\nthe Software and that both the above copyright notice(s) and this\npermission notice appear in supporting documentation.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF\nTHIRD PARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS\nINCLUDED IN THIS NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT\nOR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS\nOF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR\nOTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\nPERFORMANCE OF THIS SOFTWARE.\n\nExcept as contained in this notice, the name of a copyright holder shall\nnot be used in advertising or otherwise to promote the sale, use or other\ndealings in this Software without prior written authorization of the\ncopyright holder.","trademark":0},{"opinion":0,"patent":0,"pattern":" * Copyright (c) $SKIP19\r\n *                                                                          *\r\n * Permission is hereby granted, free of charge, to any person obtaining a  *\r\n * copy of this software and associated documentation files (the            *\r\n * \"Software\"), to deal in the Software without restriction, including      *\r\n * without limitation the rights to use, copy, modify, merge, publish,      *\r\n * distribute, distribute with modifications, sublicense, and\/or sell       *\r\n * copies of the Software, and to permit persons to whom the Software is    *\r\n * furnished to do so, subject to the following conditions:                 *\r\n *                                                                          *\r\n * The above copyright notice and this permission notice shall be included  *\r\n * in all copies or substantial portions of the Software.                   *\r\n *                                                                          *\r\n * THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS  *\r\n * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF               *\r\n * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.   *\r\n * IN NO EVENT SHALL THE ABOVE COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,   *\r\n * DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR    *\r\n * OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR    *\r\n * THE USE OR OTHER DEALINGS IN THE SOFTWARE.                               *\r\n *                                                                          *\r\n * Except as contained in this notice, the name(s) of the above copyright   *\r\n * holders shall not be used in advertising or otherwise to promote the     *\r\n * sale, use or other dealings in this Software without prior written       *\r\n * authorization.                                                           *","trademark":0},{"opinion":0,"patent":0,"pattern":" * Copyright $SKIP19\n * \n * Permission to use, copy, modify, distribute, and sell this software\n * and its documentation for any purpose is hereby granted without fee,\n * provided that the above copyright notice appears in all copies and\n * that both that copyright notice and this permission notice appear in\n * supporting documentation, and that the name of $SKIP5 not be used\n * in advertising or publicity pertaining to distribution of the software\n * without specific, written prior permission. $SKIP5 makes no\n * representations about the suitability of this software for any\n * purpose.  It is provided \"as is\" without express or implied warranty.\n * \n * $SKIP5 DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE,\n * INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO\n * EVENT SHALL $SKIP5 BE LIABLE FOR ANY SPECIAL, INDIRECT OR\n * CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF\n * USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR\n * OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\n * PERFORMANCE OF THIS SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":"COMMENT  Copyright $SKIP19\nCOMMENT\nCOMMENT  Adobe is a trademark of Adobe Systems Incorporated which may be\nCOMMENT  registered in certain jurisdictions.\nCOMMENT  Permission to use these trademarks is hereby granted only in\nCOMMENT  association with the images described in this file.\nCOMMENT\nCOMMENT  Permission to use, copy, modify, distribute and sell this software\nCOMMENT  and its documentation for any purpose and without fee is hereby\nCOMMENT  granted, provided that the above copyright notices appear in all\nCOMMENT  copies and that both those copyright notices and this permission\nCOMMENT  notice appear in supporting documentation, and that the names of\nCOMMENT  Adobe Systems and Digital Equipment Corporation not be used in\nCOMMENT  advertising or publicity pertaining to distribution of the software\nCOMMENT  without specific, written prior permission.  Adobe Systems and\nCOMMENT  Digital Equipment Corporation make no representations about the\nCOMMENT  suitability of this software for any purpose.  It is provided \"as\nCOMMENT  is\" without express or implied warranty.","trademark":0},{"opinion":0,"patent":0,"pattern":" * the above copyright notice appear in all copies and that both that\n * copyright notice and this permission notice appear in supporting\n * documentation, and that the name of $SKIP10 not be used in\n * advertising or publicity pertaining to distribution of the software without\n * specific, written prior permission.  $SKIP10 makes no\n * representations about the suitability of this software for any purpose.  It\n * is provided \"as is\" without express or implied warranty.\n *\n * THE COPYRIGHT HOLDERS DISCLAIM ALL WARRANTIES WITH REGARD TO THIS\n * SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND\n * FITNESS, IN NO EVENT SHALL THE COPYRIGHT HOLDERS BE LIABLE FOR ANY\n * SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\n * WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN\n * AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING\n * OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS\n * SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":"Permission to use, copy, modify, and distribute this\nsoftware and its documentation for any purpose and without\nfee is hereby granted, provided that the above copyright\nnotice appear in all copies and that both that copyright\nnotice and this permission notice appear in supporting\ndocumentation, and that the name of $SKIP10 not be \nused in advertising or publicity pertaining to distribution \nof the software without specific prior written permission.\n$SKIP10 makes no representation about the suitability \nof this software for any purpose. It is provided \"as is\"\nwithout any express or implied warranty.\n\n$SKIP10 DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS \nSOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY \nAND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL $SKIP10\nGRAPHICS BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL \nDAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE,\nDATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE \nOR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION  WITH\nTHE USE OR PERFORMANCE OF THIS SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":"Permission to use, copy, modify, and distribute this software and its\ndocumentation for any purpose and without fee is hereby granted,\nprovided that the above copyright notice appear in all copies and that\nboth that copyright notice and this permission notice appear in\nsupporting documentation. ","trademark":0},{"opinion":1,"patent":0,"pattern":" * Permission to use, copy, modify, distribute, and sell this software and its\n * documentation for any purpose is hereby granted without fee, provided that","trademark":0},{"opinion":0,"patent":0,"pattern":" * Copyright (c) $SKIP19\n *\n * The authors hereby grant permission to use, copy, modify, distribute,\n * and license this software and its documentation for any purpose, provided\n * that existing copyright notices are retained in all copies and that this\n * notice is included verbatim in any distributions. No written agreement,\n * license, or royalty fee is required for any of the authorized uses.\n * Modifications to this software may be copyrighted by their authors\n * and need not follow the licensing terms described here, provided that\n * the new terms are clearly indicated on the first page of each file where\n * they apply.","trademark":0},{"opinion":0,"patent":0,"pattern":"dnl Copyright © $SKIP19\ndnl\ndnl Permission to use, copy, modify, distribute, and sell this software and its\ndnl documentation for any purpose is hereby granted without fee, provided that\ndnl the above copyright notice appear in all copies and that both that copyright\ndnl notice and this permission notice appear in supporting documentation, and\ndnl that the name of the copyright holders not be used in advertising or\ndnl publicity pertaining to distribution of the software without specific,\ndnl written prior permission.  The copyright holders make no representations\ndnl about the suitability of this software for any purpose.  It is provided \"as\ndnl is\" without express or implied warranty.\ndnl\ndnl THE COPYRIGHT HOLDERS DISCLAIM ALL WARRANTIES WITH REGARD TO THIS SOFTWARE,\ndnl INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO\ndnl EVENT SHALL THE COPYRIGHT HOLDERS BE LIABLE FOR ANY SPECIAL, INDIRECT OR\ndnl CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE,\ndnl DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER\ndnl TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE\ndnl OF THIS SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":"# This originates from X11R5 (mit\/util\/scripts\/install.sh), which was\r\n# later released in X11R6 (xc\/config\/util\/install.sh) with the\r\n# following copyright and license.\r\n#\r\n# Copyright (C) 1994 X Consortium\r\n#\r\n# Permission is hereby granted, free of charge, to any person obtaining a copy\r\n# of this software and associated documentation files (the \"Software\"), to\r\n# deal in the Software without restriction, including without limitation the\r\n# rights to use, copy, modify, merge, publish, distribute, sublicense, and\/or\r\n# sell copies of the Software, and to permit persons to whom the Software is\r\n# furnished to do so, subject to the following conditions:\r\n#\r\n# The above copyright notice and this permission notice shall be included in\r\n# all copies or substantial portions of the Software.\r\n#\r\n# THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\n# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\n# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE\r\n# X CONSORTIUM BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN\r\n# AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNEC-\r\n# TION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\r\n#\r\n# Except as contained in this notice, the name of the X Consortium shall not\r\n# be used in advertising or otherwise to promote the sale, use or other deal-\r\n# ings in this Software without prior written authorization from the X Consor-\r\n# tium.","trademark":0},{"opinion":0,"patent":0,"pattern":" Copyright $SKIP10\r\n \r\n Permission to use, copy, modify, distribute, and sell this software and its\r\n documentation for any purpose is hereby granted without fee, provided that\r\n the above copyright notice appear in all copies and that both that\r\n copyright notice and this permission notice appear in supporting\r\n documentation.\r\n \r\n The above copyright notice and this permission notice shall be included in\r\n all copies or substantial portions of the Software.\r\n \r\n THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\n IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\n FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE\r\n OPEN GROUP BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN\r\n AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\r\n CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\r\n \r\n Except as contained in this notice, $SKIP6 shall not be\r\n used in advertising or otherwise to promote the sale, use or other dealings\r\n  in this Software without prior written authorization from $SKIP5.","trademark":0},{"opinion":0,"patent":0,"pattern":"!! Copyright (c) $SKIP15\r\n!! \r\n!! Permission is hereby granted, free of charge, to any person obtaining a\r\n!! copy of this software and associated documentation files (the \"Software\"),\r\n!! to deal in the Software without restriction, including without limitation\r\n!! the rights to use, copy, modify, merge, publish, distribute, sublicense,\r\n!! and\/or sell copies of the Software, and to permit persons to whom the\r\n!! Software is furnished to do so, subject to the following conditions:\r\n!! \r\n!! The above copyright notice and this permission notice shall be included in\r\n!! all copies or substantial portions of the Software.\r\n!!  \r\n!! THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\n!! IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\n!! FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL\r\n!! $SKIP5 BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\r\n!! WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF\r\n!! OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\r\n!! SOFTWARE.\r\n!! \r\n!! Except as contained in this notice, $SKIP6 shall\r\n!! not be used in advertising or otherwise to promote the sale, use or other\r\n !! dealings in this Software without prior written authorization from\r\n!! $SKIP5.\r\n!!","trademark":0},{"opinion":0,"patent":0,"pattern":"Permission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and\/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be included\nin all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL $SKIP15 BE LIABLE FOR ANY CLAIM,\nDAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR\nOTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR\nTHE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nExcept as contained in this notice, $SKIP15 shall not be used in advertising or otherwise to promote the\nsale, use or other dealings in this Software without prior written\nauthorization from","trademark":0},{"opinion":0,"patent":0,"pattern":" * Permission is hereby granted, free of charge, to any person obtaining a\n * copy of this software and associated documentation files (the \"Software\"),\n * to deal in the Software without restriction, including without limitation\n * the rights to use, copy, modify, merge, publish, distribute, sublicense,\n * and\/or sell copies of the Software, and to permit persons to whom the\n * Software is furnished to do so, subject to the following conditions:\n *\n * The above copyright notice and this permission notice shall be included in\n * all copies or substantial portions of the Software.\n *\n * THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL\n * THE COPYRIGHT HOLDER(S) OR AUTHOR(S) BE LIABLE FOR ANY CLAIM, DAMAGES OR\n * OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,\n * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR\n * OTHER DEALINGS IN THE SOFTWARE.\n *\n * Except as contained in this notice, the name of the copyright holder(s)\n * and author(s) shall not be used in advertising or otherwise to promote\n * the sale, use or other dealings in this Software without prior written\n * authorization from the copyright holder(s) and author(s).","trademark":0},{"opinion":0,"patent":0,"pattern":" * Permission to use, copy, modify, distribute, and sell this software and its\n * documentation for any purpose is hereby granted without fee, provided that\n * the above copyright notice appear in all copies and that both that\n * copyright notice and this permission notice appear in supporting\n * documentation, and that $SKIP15\n * not be used in advertising or publicity pertaining to distribution of\n * the software without specific, written prior permission.  $SKIP15 make no representations about the suitability of this\n * software for any purpose.  It is provided \"as is\" without express or\n * implied warranty.","trademark":0},{"opinion":0,"patent":0,"pattern":"-- Permission is hereby granted, free of charge, to any person obtaining a  --\n-- copy of this software and associated documentation files (the            --\n-- \"Software\"), to deal in the Software without restriction, including      --\n-- without limitation the rights to use, copy, modify, merge, publish,      --\n-- distribute, distribute with modifications, sublicense, and\/or sell       --\n-- copies of the Software, and to permit persons to whom the Software is    --\n-- furnished to do so, subject to the following conditions:                 --\n--                                                                          --\n-- The above copyright notice and this permission notice shall be included  --\n-- in all copies or substantial portions of the Software.                   --\n--                                                                          --\n-- THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS  --\n-- OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF               --\n-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.   --\n-- IN NO EVENT SHALL THE ABOVE COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,   --\n-- DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR    --\n-- OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR    --\n-- THE USE OR OTHER DEALINGS IN THE SOFTWARE.                               --\n--                                                                          --\n-- Except as contained in this notice, the name(s) of the above copyright   --\n-- holders shall not be used in advertising or otherwise to promote the     --\n-- sale, use or other dealings in this Software without prior written       --\n-- authorization.                                                           --","trademark":0},{"opinion":0,"patent":0,"pattern":"*.\\\" Permission is hereby granted, free of charge, to any person obtaining a  *\n.\\\" copy of this software and associated documentation files (the            *\n.\\\" \"Software\"), to deal in the Software without restriction, including      *\n.\\\" without limitation the rights to use, copy, modify, merge, publish,      *\n.\\\" distribute, distribute with modifications, sublicense, and\/or sell       *\n.\\\" copies of the Software, and to permit persons to whom the Software is    *\n.\\\" furnished to do so, subject to the following conditions:                 *\n.\\\"                                                                          *\n.\\\" The above copyright notice and this permission notice shall be included  *\n.\\\" in all copies or substantial portions of the Software.                   *\n.\\\"                                                                          *\n.\\\" THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS  *\n.\\\" OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF               *\n.\\\" MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.   *\n.\\\" IN NO EVENT SHALL THE ABOVE COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,   *\n.\\\" DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR    *\n.\\\" OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR    *\n.\\\" THE USE OR OTHER DEALINGS IN THE SOFTWARE.                               *\n.\\\"                                                                          *\n.\\\" Except as contained in this notice, the name(s) of the above copyright   *\n.\\\" holders shall not be used in advertising or otherwise to promote the     *\n.\\\" sale, use or other dealings in this Software without prior written       *\n.\\\" authorization. ","trademark":0},{"opinion":0,"patent":0,"pattern":"\n *  Permission is hereby granted, free of charge, to any person\n *  obtaining a copy of this software and associated documentation files\n *  (the \"Software\"), to deal in the Software without restriction,\n *  including without limitation the rights to use, copy, modify, merge,\n *  publish, distribute, sublicense, and\/or sell copies of the Software,\n *  and to permit persons to whom the Software is furnished to do so,\n *  subject to the following conditions:\n *\n *  The above copyright notice and this permission notice shall be\n *  included in all copies or substantial portions of the Software.\n *\n *  THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n *  EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n *  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n *  NONINFRINGEMENT.  IN NO EVENT SHALL THE ABOVE LISTED COPYRIGHT\n *  HOLDER(S) BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\n *  WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n *  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\n *  DEALINGS IN THE SOFTWARE.\n *\n *  Except as contained in this notice, the name(s) of the above\n *  copyright holders shall not be used in advertising or otherwise to\n *  promote the sale, use or other dealings in this Software without\n *  prior written authorization.","trademark":0}],"risk":1,"url":"http:\/\/sources.gentoo.org\/viewcvs.py\/gentoo-x86\/licenses\/X11?view=markup"}