{"description":null,"eula":0,"name":"GPL-2.0+ OR Commercial","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"** License Agreement provided with the Software.\n**\n** This file is not available for use under any other license without\n** express written permission from the copyright holder.\n**\n** This file is provided AS IS with NO WARRANTY OF ANY KIND, INCLUDING THE\n** WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n**\n** See http:\/\/www.trolltech.com\/pricing.html or email sales@trolltech.com for\n**   information about Qt Commercial License Agreements.","trademark":0},{"opinion":0,"patent":0,"pattern":"** Copyright (C) $SKIP19.  All rights reserved.\n**\n** This file is written to contribute to $SKIP10 under their own\n** license. You may use this file under your Qt license. Following\n** description is copied from their original file headers. Contact\n** $SKIP10 if any conditions of this licensing are\n** not clear to you.","trademark":0},{"opinion":0,"patent":0,"pattern":"--------------------------------------------------------------------------------\ngSOAP XML Web services tools\nCopyright (C) $SKIP19 All Rights Reserved.\nThis software is released under one of the following two licenses:\nGPL or Genivia's license for commercial use.\n--------------------------------------------------------------------------------\nGPL license.\n\nThis program is free software; you can redistribute it and\/or modify it under\nthe terms of the GNU General Public License as published by the Free Software\nFoundation; either version 2 of the License, or (at your option) any later\nversion.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY\nWARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A\nPARTICULAR PURPOSE. See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with\nthis program; if not, write to the Free Software Foundation, Inc., 59 Temple\nPlace, Suite 330, Boston, MA 02111-1307 USA\n\nAuthor contact information:\nengelen@genivia.com \/ engelen@acm.org\n--------------------------------------------------------------------------------\nA commercial use license is available from Genivia, Inc., contact@genivia.com\n--------------------------------------------------------------------------------","trademark":0},{"opinion":0,"patent":0,"pattern":"FFTW can be found at \\docref{the FFTW web page\\}.  You can also\nretrieve it from \\ftpon ftp.fftw.org in \\ftpin \/pub\/fftw.\n\n\\question 26aug:isfftwfree  Is FFTW free software?\n\nStarting with version 1.3, FFTW is Free Software in the technical\nsense defined by the Free Software Foundation (see \\docref{Categories\nof Free and Non-Free Software\\}), and is distributed under the terms\nof the GNU General Public License.  Previous versions of FFTW were\ndistributed without fee for noncommercial use, but were not\ntechnically ``free.''\n\nNon-free licenses for FFTW are also available that permit different\nterms of use than the GPL.\n\n\\question 10apr:nonfree  What is this about non-free licenses?\n\nThe non-free licenses are for companies that wish to use FFTW in their\nproducts but are unwilling to release their software under the GPL\n(which would require them to release source code and allow free\nredistribution).  Such users can purchase an unlimited-use license\nfrom MIT.  Contact us for more details.\n\nWe could instead have released FFTW under the LGPL, or even disallowed\nnon-Free usage.  Suffice it to say, however, that MIT owns the\ncopyright to FFTW and they only let us GPL it because we convinced\nthem that it would neither affect their licensing revenue nor irritate\nexisting licensees.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"|                  Copyright (c) $SKIP1 - $SKIP19                   |\n|-----------------------------------------------------------------------------|\n| This software is provided \"as is\", without warranty of any kind, express or |\n| implied, including  but not limited  to the warranties of  merchantability, |\n| fitness for a particular purpose and noninfringement. In no event shall the |\n| authors or  copyright  holders be  liable for any claim,  damages or  other |\n| liability, whether  in an  action of  contract, tort  or otherwise, arising |\n| from,  out of  or in  connection with  the software or  the  use  or  other |\n| dealings in the software.                                                   |\n| - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - |\n| This  software is  available under the  three different licenses  mentioned |\n| below.  To use this software you must chose, and qualify, for one of those. |\n| - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - |\n| The WebFX Non-Commercial License          http:\/\/webfx.eae.net\/license.html |\n| Permits  anyone the right to use the  software in a  non-commercial context |\n| free of charge.                                                             |\n| - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - |\n| The WebFX Commercial license           http:\/\/webfx.eae.net\/commercial.html |\n| Permits the  license holder the right to use  the software in a  commercial |\n| context. Such license must be specifically obtained, however it's valid for |\n| any number of  implementations of the licensed software.                    |\n| - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - |\n| GPL - The GNU General Public License    http:\/\/www.gnu.org\/licenses\/gpl.txt |\n| Permits anyone the right to use and modify the software without limitations |\n| as long as proper  credits are given  and the original  and modified source |\n| code are included. Requires  that the final product, software derivate from |\n| the original  source or any  software  utilizing a GPL  component, such  as |\n| this, is also licensed under the GPL license.                               |","trademark":0},{"opinion":0,"patent":0,"pattern":"#  Copyright (C) $SKIP19\n#  All Rights Reserved.\n#\n#  This software is provided AS-IS with no warranty, either express or\n#  implied.\n#\n#  This software is distributed under license and may not be copied, modified\n#  or distributed except as expressly authorized under the terms of that\n#  license.  Refer to licensing information at http:\/\/www.artifex.com\/\n#  or contact Artifex Software, Inc.,  7 Mt. Lassen Drive - Suite A-134,\n#  San Rafael, CA  94903, U.S.A., +1(415)492-9861, for further information.","trademark":0},{"opinion":0,"patent":0,"pattern":"          GNU General Public License; commercial licenses available","trademark":0},{"opinion":0,"patent":0,"pattern":"The MySQL software has Dual Licensing, which means you can use the MySQL\nsoftware free of charge under the GNU General Public License\n(http:\/\/www.gnu.org\/licenses\/). You can also purchase commercial MySQL\nlicenses from %{mysql_vendor} if you do not wish to be bound by the terms of\nthe GPL. See the chapter \"Licensing and Support\" in the manual for\nfurther info.","trademark":0},{"opinion":0,"patent":0,"pattern":"*   Copyright (C) $SKIP19. All rights reserved.\n*\n*   This file may be distributed and\/or modified under the terms of the\n*   GNU General Public License version 2.0 as published by the Free\n*   Software Foundation and appearing in the file LICENSE.GPL included\n*   in the packaging of this file.\n*\n*   Licensees holding a valid Commercial License for this product from\n*   SciTech Software, Inc. may use this file in accordance with the\n*   Commercial License Agreement provided with the Software.\n*\n*   This file is provided AS IS with NO WARRANTY OF ANY KIND, INCLUDING\n*   THE WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n*   PURPOSE.\n*\n*   See http:\/\/www.scitechsoft.com\/license\/ for information about\n*   the licensing options available and how to purchase a Commercial\n*   License Agreement.\n*\n*   Contact license@scitechsoft.com if any conditions of this licensing\n*   are not clear to you, or you have questions about licensing options.","trademark":0},{"opinion":0,"patent":0,"pattern":" * Copyright (c) $SKIP19\n *\n * This work is dual-licensed under:\n *\n * o The terms of the GNU General Public License as published by the Free\n *   Software Foundation, either version 2 of the License, or (at your option)\n *   any later version.\n *\n * o The terms of NetCitadel End User License Agreement\n *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"          The <ulink url=\"http:\/\/www.zeroc.com\/ice.html\"> Internet\n          Communications Engine (Ice)<\/ulink> is a powerful IPC mechanism more\n          on the level of SOAP or CORBA than D-Bus.  Ice has a \"dual-license\"\n          business around it; i.e. you can use it under the GPL, or pay for a\n          proprietary license.","trademark":0},{"opinion":0,"patent":0,"pattern":"\/*\n * This file contains a C and MMX implementation of the Scale2x effect.\n *\n * You can find an high level description of the effect at :\n *\n * http:\/\/scale2x.sourceforge.net\/\n *\n * Alternatively at the previous license terms, you are allowed to use this\n * code in your program with these conditions:\n * - the program is not used in commercial activities.\n * - the whole source code of the program is released with the binary.\n * - derivative works of the program are allowed.\n *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"** Copyright (C) $SKIP19. All rights reserved.\n**\n** This file is part of the qcadlib Library project.\n**\n** This file may be distributed and\/or modified under the terms of the\n** GNU General Public License version 2 as published by the Free Software\n** Foundation and appearing in the file LICENSE.GPL included in the\n** packaging of this file.\n**\n** Licensees holding valid qcadlib Professional Edition licenses may use\n** this file in accordance with the qcadlib Commercial License\n** Agreement provided with the Software.\n**\n** This file is provided AS IS with NO WARRANTY OF ANY KIND, INCLUDING THE\n** WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.","trademark":0},{"opinion":0,"patent":0,"pattern":"* Copyright (C) $SKIP19. All rights reserved.\n*\n* This software may be distributed and modified under the terms of the GNU\n* General Public License version 2 (GPL) as published by the Free Software\n* Foundation and appearing in the file GPL.TXT included in the packaging of\n* this file. Please note that GPL Section 2[b] requires that all works based\n* on this software must also be made publicly available under the terms of\n* the GPL (\"Copyleft\").\n*\n* Alternatively, this software may be distributed and modified under the\n* terms of Quantum Leaps commercial licenses, which expressly supersede\n* the GPL and are specifically designed for licensees interested in\n* retaining the proprietary status of their code.","trademark":0},{"opinion":0,"patent":0,"pattern":" * This program is dual-licensed; you can redistribute it and\/or modify\n * it under the terms of the GNU General Public License as published by\n * the Free Software Foundation; either version 2 of the License, or\n * (at your option) any later version.\n *\n * This program is distributed in the hope that it will be useful,\n * but WITHOUT ANY WARRANTY; without even the implied warranty of\n * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n * GNU General Public License for more details.\n *\n * You should have received a copy of the GNU General Public License\n * along with this program; if not, write to the Free Software\n * Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.\n *\n *\n * Alternatively, you can license this library under a commercial license,\n * please contact Pulse-Eight Licensing for more information.\n *\n * For more information contact:\n * Pulse-Eight Licensing       <license@pulse-eight.com>","trademark":0},{"opinion":0,"patent":0,"pattern":"** Copyright (C) $SKIP19\n** Contact: https:\/\/www.qt.io\/licensing\/\n**\n** This file is part of Qt Creator.\n**\n** Commercial License Usage\n** Licensees holding valid commercial Qt licenses may use this file in\n** accordance with the commercial license agreement provided with the\n** Software or, alternatively, in accordance with the terms contained in\n** a written agreement between you and The Qt Company. For licensing terms\n** and conditions see https:\/\/www.qt.io\/terms-conditions. For further\n** information use the contact form at https:\/\/www.qt.io\/contact-us.\n**\n** GNU General Public License Usage\n** Alternatively, this file may be used under the terms of the GNU\n** General Public License version 3 as published by the Free Software\n** Foundation with exceptions as appearing in the file LICENSE.GPL3-EXCEPT\n** included in the packaging of this file. Please review the following\n** information to ensure the GNU General Public License requirements will\n** be met: https:\/\/www.gnu.org\/licenses\/gpl-3.0.html.","trademark":0},{"opinion":0,"patent":0,"pattern":"Copyright(C) $SKIP8, $SKIP10. All Rights Reserved.\nThe generated code is released under one of the following licenses:\n1) GPL or 2) Genivia's license for commercial use.\nThis program is released under the GPL with the additional exemption that\ncompiling, linking, and\/or using OpenSSL is allowed.","trademark":0},{"opinion":0,"patent":0,"pattern":"The modules are released under the GPL, the gSOAP open source public license,\nor commercial license from Genivia Inc.","trademark":0},{"opinion":0,"patent":0,"pattern":" * This software is dual-licensed: you can redistribute it and\/or modify\n * it under the terms of the GNU General Public License version 2 as\n * published by the Free Software Foundation. For the terms of this\n * license, see <http:\/\/www.gnu.org\/licenses\/>.\n *\n * You are free to use this software under the terms of the GNU General\n * Public License, but WITHOUT ANY WARRANTY; without even the implied\n * warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.\n * See the GNU General Public License for more details.\n *\n * Alternatively, you can license this software under a commercial\n * license, as set out in <https:\/\/www.cesanta.com\/license>.","trademark":0},{"opinion":0,"patent":0,"pattern":"\r\n** This file is part of the dxflib project.\r\n**\r\n** This file is free software; you can redistribute it and\/or modify\r\n** it under the terms of the GNU General Public License as published by\r\n** the Free Software Foundation; either version 2 of the License, or\r\n** (at your option) any later version.\r\n**\r\n** Licensees holding valid dxflib Professional Edition licenses may use \r\n** this file in accordance with the dxflib Commercial License\r\n** Agreement provided with the Software.\r\n**\r\n** This file is provided AS IS with NO WARRANTY OF ANY KIND, INCLUDING THE\r\n** WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.","trademark":0}],"risk":2,"url":null}