{"description":null,"eula":0,"name":"HPND","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"# install - install a program, script, or datafile\n# This comes from X11R5 (mit\/util\/scripts\/install.sh).\n#\n# Copyright 1991 by the Massachusetts Institute of Technology\n#\n# Permission to use, copy, modify, distribute, and sell this software and its\n# documentation for any purpose is hereby granted without fee, provided that\n# the above copyright notice appear in all copies and that both that\n# copyright notice and this permission notice appear in supporting\n# documentation, and that the name of M.I.T. not be used in advertising or\n# publicity pertaining to distribution of the software without specific,\n# written prior permission.  M.I.T. makes no representations about the\n# suitability of this software for any purpose.  It is provided \"as is\"\n# without express or implied warranty.\n#\n# Calling this script install-sh is preferred over install.sh, to prevent\n# `make' implicit rules from creating a file called install from it\n# when there is no Makefile.\n#\n# This script is compatible with the BSD install script, but was written\n# from scratch.  It can only install one file at a time, a restriction\n# shared with many OS's install programs.","trademark":0},{"opinion":0,"patent":0,"pattern":" * Copyright (c) $SKIP19\n *\n * Permission to use, copy, modify, distribute and sell this software\n * and its documentation for any purpose is hereby granted without fee,\n * provided that the above copyright notice appear in all copies and\n * that both that copyright notice and this permission notice appear\n * in supporting documentation.  $SKIP5 makes no\n * representations about the suitability of this software for any\n * purpose.  It is provided \"as is\" without express or implied warranty.","trademark":0},{"opinion":0,"patent":0,"pattern":";;; Copyright (C) $SKIP19\n;\n;Permission to copy this software, to modify it, to redistribute it,\n;to distribute modified versions, and to use it for any purpose is\n;granted, subject to the following restrictions and understandings.\n;\n;1.  Any copy made of this software must include this copyright notice\n;in full.\n;\n;2.  I have made no warranty or representation that the operation of\n;this software will be error-free, and I am under no obligation to\n;provide any services, by way of maintenance, update, or otherwise.\n;\n;3.  In conjunction with products arising from the use of this\n;material, there shall be no use of my name in any advertising,\n;promotional, or sales literature without prior written consent in\n;each case.","trademark":0},{"opinion":0,"patent":0,"pattern":"By obtaining, using, and\/or copying this software and\/or its associated documentation, you agree that you have read, understood, and will comply with the following terms and conditions:\n\nPermission to use, copy, modify, and distribute this software and its associated documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appears in all copies, and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Secret Labs AB or the author not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission.\n\nSECRET LABS AB AND THE AUTHOR DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL SECRET LABS AB OR THE AUTHOR BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":"# Copyright $SKIP9\n#\n# Permission to use, copy, modify, distribute, and sell this software and its\n# documentation for any purpose is hereby granted without fee, provided that\n# the above copyright notice appear in all copies and that both that\n# copyright notice and this permission notice appear in supporting\n# documentation, and that the name $SKIP5 not be used in advertising or\n# publicity pertaining to distribution of the software without specific,\n# written prior permission.  $SKIP5 makes no representations about the\n# suitability of this software for any purpose.  It is provided \"as is\"\n# without express or implied warranty.","trademark":0},{"opinion":0,"patent":0,"pattern":"# By obtaining, using, and\/or copying this software and\/or its associated\n# documentation, you agree that you have read, understood, and will comply with\n# the following terms and conditions:\n#\n# Permission to use, copy, modify, and distribute this software and its\n# associated documentation for any purpose and without fee is hereby granted,\n# provided that the above copyright notice appears in all copies, and that both\n# that copyright notice and this permission notice appear in supporting\n# documentation, and that the name of $SKIP8 not be used\n# in advertising or publicity pertaining to distribution of the software\n# without specific, written prior permission.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"# Copyright (C) $SKIP15\n#\n# Permission to use, copy, modify, distribute, and sell this software and\n# its documentation for any purpose is hereby granted without fee, provided\n# that (i) the above copyright notices and this permission notice appear in\n# all copies of the software and related documentation, and (ii) the names of\n# $SKIP6 may not be used in any advertising or\n# publicity relating to the software without the specific, prior written\n# permission of $SKIP6\n#\n# THE SOFTWARE IS PROVIDED \"AS-IS\" AND WITHOUT WARRANTY OF ANY KIND,\n# EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY\n# WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n#\n# IN NO EVENT SHALL $SKIP6 BE LIABLE FOR\n# ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND,\n# OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\n# WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF\n# LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE\n# OF THIS SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":" * Permission to use, copy, modify, distribute, and sell this software and \n * its documentation for any purpose is hereby granted without fee, provided\n * that (i) the above copyright notices and this permission notice appear in\n * all copies of the software and related documentation, and (ii) the names of\n * $SKIP30 may not be used in any\n * advertising or publicity relating to the software without the specific,\n * prior written permission of $SKIP30\n * \n * THE SOFTWARE IS PROVIDED \"AS-IS\" AND WITHOUT WARRANTY OF ANY KIND, \n * EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY \n * WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.  \n * \n * IN NO EVENT SHALL $SKIP30 BE LIABLE\n * FOR ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND,\n * OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\n * WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF \n * LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE \n * OF THIS SOFTWARE.\n\n","trademark":0},{"opinion":0,"patent":0,"pattern":" * Permission to use, copy, modify and distribute this software and its\n * documentation is hereby granted, provided that both the copyright\n * notice and this permission notice appear in all copies of the\n * software, derivative works or modified versions, and any portions\n * thereof, and that both notices appear in supporting documentation.","trademark":0},{"opinion":0,"patent":0,"pattern":".\\\" Permission to use, copy, modify, distribute, and sell this software and \n.\\\" its documentation for any purpose is hereby granted without fee, provided\n.\\\" that (i) the above copyright notices and this permission notice appear in\n.\\\" all copies of the software and related documentation, and (ii) the names of\n.\\\" Sam Leffler and Silicon Graphics may not be used in any advertising or\n.\\\" publicity relating to the software without the specific, prior written\n.\\\" permission of Sam Leffler and Silicon Graphics.\n.\\\" \n.\\\" THE SOFTWARE IS PROVIDED \"AS-IS\" AND WITHOUT WARRANTY OF ANY KIND, \n.\\\" EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY \n.\\\" WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.  \n.\\\" \n.\\\" IN NO EVENT SHALL SAM LEFFLER OR SILICON GRAPHICS BE LIABLE FOR\n.\\\" ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND,\n.\\\" OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\n.\\\" WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF \n.\\\" LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE \n.\\\" OF THIS SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":" * grants permission under its copyrights to use, copy, modify, and\n * distribute this Software with or without fee, provided that the\n * above copyright notice and all paragraphs of this notice appear in\n * all copies, and that the name of $SKIP4 not be used in connection with\n * the marketing of any product incorporating the Software or\n * modifications thereof, without specific, written prior permission.\n *\n * To the extent it has a right to do so, IBM grants an immunity from\n * suit under its patents, if any, for the use, sale or manufacture of\n * products to the extent that such products are used for performing\n * Domain Name System dynamic updates in TCP\/IP networks by means of\n * the Software.  No immunity is granted for any product per se or for\n","trademark":0},{"opinion":0,"patent":0,"pattern":"# Permission to use, copy, modify, and distribute this Python software and\n# its associated documentation for any purpose without fee is hereby\n# granted, provided that the above copyright notice appears in all copies,\n# and that both that copyright notice and this permission notice appear in\n# supporting documentation, and that the name of neither $SKIP20 be used in advertising or publicity pertaining to\n# distribution of the software without specific, written prior permission.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"    Permission to use, copy, modify, and distribute this software and its\n    documentation for any purpose and without fee or royalty is hereby granted,\n    provided that the above copyright notice appear in all copies and that\n    both that copyright notice and this permission notice appear in\n    supporting documentation or portions thereof, including modifications,\n    that you make.\n\n","trademark":0},{"opinion":0,"patent":0,"pattern":"COMMENT  Permission to use, copy, modify, and distribute this software and\nCOMMENT  its documentation for any purpose and without fee is hereby\nCOMMENT  granted, provided that the above copyright notice appear in all\nCOMMENT  copies and that both that copyright notice and this permission\nCOMMENT  notice appear in supporting documentation, and that the name of\nCOMMENT  Dale Schumacher not be used in advertising or publicity pertaining to\nCOMMENT  distribution of the software without specific, written prior\nCOMMENT  permission.  $SKIP5 makes no representations about the\nCOMMENT  suitability of this software for any purpose.  It is provided \"as\nCOMMENT  is\" without express or implied warranty.","trademark":0},{"opinion":0,"patent":0,"pattern":" * Permission to use, copy, modify, and distribute this software for\n * any purpose and without fee is hereby granted, provided that the above\n * copyright notice appear in all copies and that both the copyright notice\n * and this permission notice appear in supporting documentation, and that\n * the name of $SKIP6 not be used in advertising\n * or publicity pertaining to distribution of the software without specific,\n","trademark":0},{"opinion":0,"patent":0,"pattern":" * Permission to use, copy, modify, distribute, and sell this software and its\n * documentation for any purpose is hereby granted without fee, provided that\n * the above copyright notice appear in all copies and that both that copyright\n * notice and this permission notice appear in supporting documentation, and\n * that the name of Marc Aurele La France not be used in advertising or\n * publicity pertaining to distribution of the software without specific,\n * written prior permission.  Marc Aurele La France makes no representations\n * about the suitability of this software for any purpose.  It is provided\n * \"as-is\" without express or implied warranty.\n *\n * MARC AURELE LA FRANCE DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE,\n","trademark":0},{"opinion":0,"patent":0,"pattern":" * Permission to use, copy, modify, distribute, and sell this software and \n * its documentation for any purpose is hereby granted without fee, provided\n * that (i) the above copyright notices and this permission notice appear in\n * all copies of the software and related documentation, and (ii) the name of\n * $SKIP4 may not be used in any advertising or\n * publicity relating to the software without the specific, prior written\n * permission of $SKIP5\n * \n * THE SOFTWARE IS PROVIDED \"AS-IS\" AND WITHOUT WARRANTY OF ANY KIND, \n * EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY \n * WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.  \n * \n * IN NO EVENT SHALL $SKIP5 BE LIABLE FOR\n * ANY SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND,\n * OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\n * WHETHER OR NOT ADVISED OF THE POSSIBILITY OF DAMAGE, AND ON ANY THEORY OF \n * LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE \n * OF THIS SOFTWARE.\n","trademark":0},{"opinion":0,"patent":0,"pattern":" to use, copy, modify, distribute and\n        sell this software and its documentation for any purpose is\n        hereby granted without fee, provided that the above copyright\n        notice appears in all copies and that both that copyright\n        notice and this permission notice appear in supporting\n        documentation.  $SKIP5 makes no representations\n        about the suitability of this software for any purpose.  It is\n        provided \"as is\" without express or implied","trademark":0},{"opinion":0,"patent":0,"pattern":"\nPermission to use, copy, modify, and distribute this software and\nits documentation for any purpose and without fee is hereby\ngranted, provided that the above copyright notice appear in all\ncopies and that both that the copyright notice and this\npermission notice and warranty disclaimer appear in supporting\ndocumentation, and that the name of $SKIP8\nnot be used in advertising or publicity pertaining to\ndistribution of the software without specific, written prior\n","trademark":0},{"opinion":0,"patent":0,"pattern":"Permission to use, copy, modify, and distribute this software and its \n\ndocumentation for any purpose and without fee is hereby granted, provided \n\nthat the above copyright notice appear in all copies and that both\n\nthe copyright notice and this permission notice and warranty disclaimer \n\nappear in supporting documentation, and that the names of the authors \n\nor their employers not be used in advertising or publicity pertaining \n\nto distribution of the software without specific, written prior permission. \n\n","trademark":0}],"risk":1,"url":"http:\/\/spdx.org\/licenses\/HPND#licenseText"}