{"description":null,"eula":0,"name":"LGPL-2.1 WITH Linking-exception","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"   As a special exception, if you link the code in this file with\n   files compiled with a GNU compiler to produce an executable,\n   that does not cause the resulting executable to be covered by\n   the GNU Lesser General Public License.  This exception does not\n   however invalidate any other reasons why the executable file\n   might be covered by the GNU Lesser General Public License.\n   This exception applies to code released by its copyright holders\n   in files containing the exception.  *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"   Copyright (C) $SKIP19\n\nThis file is part of GNU Classpath.\n\nGNU Classpath is free software; you can redistribute it and\/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation; either version 2, or (at your option)\nany later version.\n\nGNU Classpath is distributed in the hope that it will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\nGeneral Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with GNU Classpath; see the file COPYING.  If not, write to the\nFree Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA\n02110-1301 USA.\n\nLinking this library statically or dynamically with other modules is\nmaking a combined work based on this library.  Thus, the terms and\nconditions of the GNU General Public License cover the whole\ncombination.\n\nAs a special exception, the copyright holders of this library give you\npermission to link this library with independent modules to produce an\nexecutable, regardless of the license terms of these independent\nmodules, and to copy and distribute the resulting executable under\nterms of your choice, provided that you also meet, for each linked\nterms of your choice, provided that you also meet, for each linked\nindependent module, the terms and conditions of the license of that\nmodule.  An independent module is a module which is not derived from\nor based on this library.  If you modify this library, you may extend\nthis exception to your version of the library, but you are not\nobligated to do so.  If you do not wish to do so, delete this\nexception statement from your version. *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"   This program is free software; you can redistribute it and\/or\n   modify it under the terms of the GNU Library General Public License\n   as published by the Free Software Foundation; either version 2, or\n   (at your option) any later version.\n\n   In addition to the permissions in the GNU Library General Public\n   License, the Free Software Foundation gives you unlimited\n   permission to link the compiled version of this file into\n   combinations with other programs, and to distribute those\n   combinations without any restriction coming from the use of this\n   file.  (The Library Public License restrictions do apply in other\n   respects; for example, they cover modification of the file, and","trademark":0},{"opinion":0,"patent":0,"pattern":"(*  Copyright $SKIP19    *)\n(*  et en Automatique. All rights reserved. This file is distributed      *)\n(*  under the terms of the GNU Library General Public License, with the   *)\n(*  special exception on linking described in file LICENSE.               *)\n(*                                                                        *)\n(**************************************************************************)","trademark":0},{"opinion":0,"patent":0,"pattern":"\/*  Copyright $SKIP1 Institut National de Recherche en Informatique et   *\/\n\/*  en Automatique.  All rights reserved.  This file is distributed    *\/\n\/*  under the terms of the GNU Library General Public License, with    *\/\n\/*  the special exception on linking described in file ..\/LICENSE.     *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"(****************************************************************************)\n(*                                                                          *)\n(*                              Objective Caml                              *)\n(*                                                                          *)\n(*                            INRIA Rocquencourt                            *)\n(*                                                                          *)\n(*  Copyright $SKIP8 Institut National de Recherche en Informatique et   *)\n(*  en Automatique.  All rights reserved.  This file is distributed under   *)\n(*  the terms of the GNU Library General Public License, with the special   *)\n(*  exception on linking described in LICENSE at the top of the Objective   *)\n(*  Caml source tree.                                                       *)\n(*                                                                          *)\n(****************************************************************************)","trademark":0},{"opinion":0,"patent":0,"pattern":"(***********************************************************************)\n(*                                                                     *)\n(*                           Objective Caml                            *)\n(*                                                                     *)\n(*            Xavier Leroy, projet Cristal, INRIA Rocquencourt         *)\n(*                                                                     *)\n(*  Copyright 1996 Institut National de Recherche en Informatique et   *)\n(*  en Automatique.  All rights reserved.  This file is distributed    *)\n(*  under the terms of the GNU Library General Public License, with    *)\n(*  the special exception on linking described in file ..\/..\/LICENSE.  *)\n(*                                                                     *)\n(***********************************************************************)","trademark":0},{"opinion":0,"patent":0,"pattern":"(*  Copyright $SKIP1 Institut National de Recherche en Informatique et   *)\n(*  en Automatique.  All rights reserved.  This file is distributed    *)\n(*  under the terms of the GNU Library General Public License, with    *)\n(*  the special exception on linking described in file ..\/..\/LICENSE.  *)","trademark":0},{"opinion":0,"patent":0,"pattern":"(*  Copyright 2002 Institut National de Recherche en Informatique et   *)\n(*  en Automatique and Kyoto University.  All rights reserved.         *)\n(*  This file is distributed under the terms of the GNU Library        *)\n(*  General Public License, with the special exception on linking      *)\n(*  described in file LICENSE found in the Objective Caml source tree. *)","trademark":0},{"opinion":0,"patent":0,"pattern":"GNU Libltdl is free software; you can redistribute it and\/or\nmodify it under the terms of the GNU Lesser General Public\nLicense as published by the Free Software Foundation; either\nversion 2 of the License, or (at your option) any later version.\n\nAs a special exception to the GNU Lesser General Public License,\nif you distribute this file as part of a program or library that\nis built using GNU Libtool, you may include this file under the\nsame distribution terms that you use for the rest of that program.","trademark":0},{"opinion":0,"patent":0,"pattern":"# This library is free software; you can redistribute it and\/or\n# modify it under the terms of the GNU Lesser General Public\n# License as published by the Free Software Foundation; either\n# version 2.1 of the License, or (at your option) any later version.\n# You may obtain a copy of the Licence at\n# http:\/\/www.gnu.org\/licences\/lgpl.html\n# \n# As a special exception this file can also be included in modules\n# with other source code as long as that source code has been \n# released under an Open Source Initiative certificed licence.  \n# More information about OSI certification can be found at: \n# http:\/\/www.opensource.org \n# \n# This module is distributed in the hope that it will be useful,\n# but WITHOUT ANY WARRANTY; without even the implied warranty of\n# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the ","trademark":0},{"opinion":0,"patent":0,"pattern":"(* This library is free software; you can redistribute it and\/or *)\n(* modify it under the terms of the GNU Lesser General Public License *)\n(* as published by the Free Software Foundation; either version 2 of *)\n(* the License, or (at your option) any later version. *)\n\n(* As a special exception to the GNU Library General Public License, you *)\n(* may link, statically or dynamically, a \"work that uses this library\" *)\n(* with a publicly distributed version of this library to produce an *)\n(* executable file containing portions of this library, and distribute *)\n(* that executable file under terms of your choice, without any of the *)\n(* additional requirements listed in clause 6 of the GNU Library General *)\n(* Public License. By \"a publicly distributed version of this library\", *)\n(* we mean either the unmodified Library as distributed by the authors, *)\n(* or a modified version of this library that is distributed under the *)\n(* conditions defined in clause 3 of the GNU Library General Public *)\n(* License. This exception does not however invalidate any other reasons *)\n(* why the executable file might be covered by the GNU Library General *)\n(* Public License . *)\n\n(* This library is distributed in the hope that it will be useful, *)\n(* but WITHOUT ANY WARRANTY; without even the implied warranty of *)\n(* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU *)\n(* Lesser General Public License for more details. *)\n\n(* You should have received a copy of the GNU Lesser General Public *)\n(* License along with this library; if not, write to the Free Software *)\n(* Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 *)\n(* USA *)","trademark":0},{"opinion":0,"patent":0,"pattern":"(*  Copyright (C) $SKIP8, $SKIP10                                    *)\n(*                                                                              *)\n(*  This library is free software; you can redistribute it and\/or modify it     *)\n(*  under the terms of the GNU Lesser General Public License as published by    *)\n(*  the Free Software Foundation; either version 2.1 of the License, or (at     *)\n(*  your option) any later version, with the OCaml static compilation           *)\n(*  exception.                                                                  *)\n(*                                                                              *)\n(*  This library is distributed in the hope that it will be useful, but         *)\n(*  WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY  *)\n(*  or FITNESS FOR A PARTICULAR PURPOSE. See the file COPYING for more          *)\n(*  details.                                                                    *)\n(*                                                                              *)\n(*  You should have received a copy of the GNU Lesser General Public License    *)\n(*  along with this library; if not, write to the Free Software Foundation,     *)\n(*  Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301 USA               *)\n(********************************************************************************)","trademark":0},{"opinion":0,"patent":0,"pattern":"dnl *  Copyright (C) 2003-2008 Sylvain Le Gall <sylvain@le-gall.net>         *\ndnl *                                                                        *\ndnl *  This library is free software; you can redistribute it and\/or         *\ndnl *  modify it under the terms of the GNU Lesser General Public            *\ndnl *  License as published by the Free Software Foundation; either          *\ndnl *  version 2.1 of the License, or (at your option) any later version;    *\ndnl *  with the OCaml static compilation exception.                          *\ndnl *                                                                        *\ndnl *  This library is distributed in the hope that it will be useful,       *\ndnl *  but WITHOUT ANY WARRANTY; without even the implied warranty of        *\ndnl *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU     *\ndnl *  Lesser General Public License for more details.                       *\ndnl *                                                                        *\ndnl *  You should have received a copy of the GNU Lesser General Public      *\ndnl *  License along with this library; if not, write to the Free Software   *\ndnl *  Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307   *\ndnl *  USA                                                                   *","trademark":0},{"opinion":0,"patent":0,"pattern":"  This library is free software; you can redistribute it and\/or modify it\n  under the terms of the GNU Library General Public License as published by\n  the Free Software Foundation; either version 2 of the License, or (at your\n  option) any later version with the following modification:\n\n  As a special exception, the copyright holders of this library give you\n  permission to link this library with independent modules to produce an\n  executable, regardless of the license terms of these independent modules,and\n  to copy and distribute the resulting executable under terms of your choice,\n  provided that you also meet, for each linked independent module, the terms\n  and conditions of the license of that module. An independent module is a\n  module which is not derived from or based on this library. If you modify\n  this library, you may extend this exception to your version of the library,\n  but you are not obligated to do so. If you do not wish to do so, delete this","trademark":0},{"opinion":0,"patent":0,"pattern":"    This library is free software; you can redistribute it and\/or\n    modify it under the terms of the GNU Lesser General Public\n    License as published by the Free Software Foundation; either\n    version 2.1 of the License, or (at your option) any later version\n    with the following modification:\n\n    As a special exception, the copyright holders of this library give you\n    permission to link this library with independent modules to produce an\n    executable, regardless of the license terms of these independent modules,and\n    to copy and distribute the resulting executable under terms of your choice,\n    provided that you also meet, for each linked independent module, the terms\n    and conditions of the license of that module. An independent module is a\n    module which is not derived from or based on this library. If you modify\n    this library, you may extend this exception to your version of the library,\n    but you are not obligated to do so. If you do not wish to do so, delete this\n    exception statement from your version.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"   is free software; you can redistribute it and\/or\n   modify it under the terms of the GNU Lesser General Public\n   License as published by the Free Software Foundation; either\n   version 2.1 of the License, or (at your option) any later version.\n\n   In addition to the permissions in the GNU Lesser General Public\n   License, the Free Software Foundation gives you unlimited\n   permission to link the compiled version of this file with other\n   programs, and to distribute those programs without any restriction\n   coming from the use of this file. (The GNU Lesser General Public\n   License restrictions do apply in other respects; for example, they\n   cover modification of the file, and distribution when not linked\n   into another program.)\n\n   Note that people who make modified versions of this file are not\n   obligated to grant this special exception for their modified\n   versions; it is their choice whether to do so. The GNU Lesser\n   General Public License gives permission to release a modified\n   version without this exception; this exception also makes it\n   possible to release a modified version which carries forward this\n   exception.\n\n   The GNU C Library is distributed in the hope that it will be useful,\n   but WITHOUT ANY WARRANTY; without even the implied warranty of\n   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n   Lesser General Public License for more details.\n\n   You should have received a copy of the GNU Lesser General Public\n   License along with the GNU C Library;\n","trademark":0},{"opinion":0,"patent":0,"pattern":"# This library is free software. Distribution and use rights are outlined in\n# the file \"COPYING\" which should have been included with this file.  If this\n# file is missing or damaged, see the license at:\n#\n#     http:\/\/www.fltk.org\/COPYING.php\n","trademark":0},{"opinion":0,"patent":0,"pattern":"\n * This library is open source and may be redistributed and\/or modified under\n * the terms of the OpenSceneGraph Public License (OSGPL) version 0.0 or\n * (at your option) any later version.  The full license is in LICENSE file\n * included with this distribution, and on the openscenegraph.org website.\n *\n * This library is distributed in the hope that it will be useful,\n * but WITHOUT ANY WARRANTY; without even the implied warranty of\n * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n * OpenSceneGraph Public License for more details.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"\n *  This library is free software; you can redistribute it and\/or\n *  modify it under the terms of the GNU Lesser General Public\n *  License as published by the Free Software Foundation; either\n *  version 2.1 of the License, or (at your option) any later version.\n *\n *  This library is distributed in the hope that it will be useful,\n *  but WITHOUT ANY WARRANTY; without even the implied warranty of\n *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n *  Lesser General Public License for more details.\n *\n *  You should have received a copy of the GNU Lesser General Public\n *  License along with this library; if not, write to the Free Software\n *  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA\n *\n *  ---\n *\n *  In addition, as a special exception, the copyright holders give\n *  permission to link the code of portions of this program with the\n *  OpenSSL library under certain conditions as described in each\n *  individual source file, and distribute linked combinations\n *  including the two.\n *  You must obey the GNU Lesser General Public License in all respects\n *  for all of the code used other than OpenSSL.  If you modify\n *  file(s) with this exception, you may extend this exception to your\n *  version of the file(s), but you are not obligated to do so.  If you\n *  do not wish to do so, delete this exception statement from your\n *  version.  If you delete this exception statement from all source\n *  files in the program, then also delete it here.\n\n","trademark":0}],"risk":1,"url":"http:\/\/sources.gentoo.org\/viewcvs.py\/gentoo-x86\/licenses\/LGPL-2.1-linking-exception?view=markup"}