{"description":null,"eula":0,"name":"Unicode-DFS-2016","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"   Permission is hereby granted, free of charge, to any person\\n\\\n   obtaining a copy of the Unicode data files and any associated\\n\\\n   documentation (the \\\"Data Files\\\") or Unicode software and any\\n\\\n   associated documentation (the \\\"Software\\\") to deal in the Data Files\\n\\\n   or Software without restriction, including without limitation the\\n\\\n   rights to use, copy, modify, merge, publish, distribute, and\/or\\n\\\n   sell copies of the Data Files or Software, and to permit persons to\\n\\\n   whom the Data Files or Software are furnished to do so, provided\\n\\\n   that (a) the above copyright notice(s) and this permission notice\\n\\\n   appear with all copies of the Data Files or Software, (b) both the\\n\\\n   above copyright notice(s) and this permission notice appear in\\n\\\n   associated documentation, and (c) there is clear notice in each\\n\\\n   modified Data File or in the Software as well as in the\\n\\\n   documentation associated with the Data File(s) or Software that the\\n\\\n   data or software has been modified.\\n\\\n\\n\\\n   THE DATA FILES AND SOFTWARE ARE PROVIDED \\\"AS IS\\\", WITHOUT WARRANTY\\n\\\n   OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\\n\\\n   WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\\n\\\n   NONINFRINGEMENT OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE\\n\\\n   COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS NOTICE BE LIABLE FOR\\n\\\n   ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY\\n\\\n   DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\\n\\\n   WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS\\n\\\n   ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE\\n\\\n   OF THE DATA FILES OR SOFTWARE.\\n\\\n\\n\\\n   Except as contained in this notice, the name of a copyright holder\\n\\\n   shall not be used in advertising or otherwise to promote the sale,\\n\\\n   use or other dealings in these Data Files or Software without prior\\n\\\n   written authorization of the copyright holder.  *\/\\n\";","trademark":0},{"opinion":0,"patent":0,"pattern":"   Permission is hereby granted, free of charge, to any person\n   obtaining a copy of the Unicode data files and any associated\n   documentation (the \"Data Files\") or Unicode software and any\n   associated documentation (the \"Software\") to deal in the Data Files\n   or Software without restriction, including without limitation the\n   rights to use, copy, modify, merge, publish, distribute, and\/or\n   sell copies of the Data Files or Software, and to permit persons to\n   whom the Data Files or Software are furnished to do so, provided\n   that (a) the above copyright notice(s) and this permission notice\n   appear with all copies of the Data Files or Software, (b) both the\n   above copyright notice(s) and this permission notice appear in\n   associated documentation, and (c) there is clear notice in each\n   modified Data File or in the Software as well as in the\n   documentation associated with the Data File(s) or Software that the\n   data or software has been modified.\n\n   THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY\n   OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\n   WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n   NONINFRINGEMENT OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE\n   COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS NOTICE BE LIABLE FOR\n   ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY\n   DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\n   WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS\n   ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE\n   OF THE DATA FILES OR SOFTWARE.\n\n   Except as contained in this notice, the name of a copyright holder\n   shall not be used in advertising or otherwise to promote the sale,\n   use or other dealings in these Data Files or Software without prior\n   written authorization of the copyright holder.  *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"The files in resource\/gnu\/java\/locale were generated by gnu.localegen\nfrom the files distributed from date provided by CLDR.\nAll these files are distributed under the following terms:\n\n  Copyright (C) 1991-2005 Unicode, Inc. All rights reserved. Distributed\n  under the Terms of Use in http:\/\/www.unicode.org\/copyright.html.\n\n  Permission is hereby granted, free of charge, to any person obtaining\n  a copy of the Unicode data files and any associated documentation (the\n  \"Data Files\") or Unicode software and any associated documentation\n  (the \"Software\") to deal in the Data Files or Software without\n  restriction, including without limitation the rights to use, copy,\n  modify, merge, publish, distribute, and\/or sell copies of the Data\n  Files or Software, and to permit persons to whom the Data Files or\n  Software are furnished to do so, provided that (a) the above copyright\n  notice(s) and this permission notice appear with all copies of the\n  Data Files or Software, (b) both the above copyright notice(s) and\n  this permission notice appear in associated documentation, and (c)\n  there is clear notice in each modified Data File or in the Software as\n  well as in the documentation associated with the Data File(s) or\n  Software that the data or software has been modified.\n\n  THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF\n  ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\n  WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n  NONINFRINGEMENT OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT\n  HOLDER OR HOLDERS INCLUDED IN THIS NOTICE BE LIABLE FOR ANY CLAIM, OR\n  ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES\n  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\n  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT\n  OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THE DATA FILES OR\n  SOFTWARE.\n\n  Except as contained in this notice, the name of a copyright holder\n  shall not be used in advertising or otherwise to promote the sale, use\n  or other dealings in these Data Files or Software without prior\n  written authorization of the copyright holder.","trademark":0},{"opinion":0,"patent":0,"pattern":"# Copyright (C) $SKIP19\n# All rights reserved. Distributed under the Terms of Use\n# in http:\/\/www.unicode.org\/copyright.html.","trademark":0},{"opinion":0,"patent":0,"pattern":"    THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY\nKIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD\nPARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS\nNOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL\nDAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\nWHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING\nOUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THE DATA FILES OR\nSOFTWARE.\n\n    Except as contained in this notice, the name of a copyright holder shall not\nbe used in advertising or otherwise to promote the sale, use or other dealings\nin these Data Files or Software without prior written authorization of the\ncopyright holder. ","trademark":0},{"opinion":0,"patent":0,"pattern":"    Except as contained in this notice, the name of a copyright holder shall not\nbe used in advertising or otherwise to promote the sale, use or other dealings\nin these Data Files or Software without prior written authorization of the\ncopyright holder.","trademark":0},{"opinion":0,"patent":0,"pattern":"# Unicode Character Database\n# Copyright (c) 1991-2009 Unicode, Inc.\n# For terms of use, see http:\/\/www.unicode.org\/terms_of_use.html\n# For documentation, see http:\/\/www.unicode.org\/reports\/tr44\/\n\n# It is ok to redistribute this file \"solely for informational \n# purposes in the creation of products supporting the Unicode Standard\".\n# We don't nee to add a Boost License to this file: boostinspect:nolicense.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"            under the Terms of Use in http:\/\/www.unicode.org\/copyright.html.\n\n            Permission is hereby granted, free of charge, to any person\n            obtaining a copy of the Unicode data files and any associated\n            documentation (the \"Data Files\") or Unicode software and any\n            associated documentation (the \"Software\") to deal in the Data Files\n            or Software without restriction, including without limitation the\n            rights to use, copy, modify, merge, publish, distribute, and\/or sell\n            copies of the Data Files or Software, and to permit persons to whom\n            the Data Files or Software are furnished to do so, provided that (a)\n            the above copyright notice(s) and this permission notice appear with\n            all copies of the Data Files or Software, (b) both the above\n            copyright notice(s) and this permission notice appear in associated\n            documentation, and (c) there is clear notice in each modified Data\n            File or in the Software as well as in the documentation associated\n            with the Data File(s) or Software that the data or software has been\n            modified.","trademark":0},{"opinion":0,"patent":0,"pattern":"            Permission is hereby granted, free of charge, to any person\n            obtaining a copy of the Unicode data files and any associated\n            documentation (the \"Data Files\") or Unicode software and any\n            associated documentation (the \"Software\") to deal in the Data Files\n            or Software without restriction, including without limitation the\n            rights to use, copy, modify, merge, publish, distribute, and\/or sell\n            copies of the Data Files or Software, and to permit persons to whom\n            the Data Files or Software are furnished to do so, provided that (a)\n            the above copyright notice(s) and this permission notice appear with\n            all copies of the Data Files or Software, (b) both the above\n            copyright notice(s) and this permission notice appear in associated\n            documentation, and (c) there is clear notice in each modified Data\n            File or in the Software as well as in the documentation associated\n            with the Data File(s) or Software that the data or software has been\n            modified.","trademark":0},{"opinion":0,"patent":0,"pattern":"Use of any of this software is governed by the terms of the license below:\n\nUnicode Terms of Use\n\n    For the general privacy policy governing access to this site, see the\n    Unicode Privacy Policy. For trademark usage, see the Unicode\n    Consortium (R) Trademarks and Logo Policy.\n    Notice to End User: Terms of Use\n    Carefully read the following legal agreement (\"Agreement\"). Use or\n    copying of the software and\/or codes provided with this agreement (The\n    \"Software\") constitutes your acceptance of these terms\n\n       1. Unicode Copyright.\n             1. Copyright (c) 1991-2008 Unicode, Inc. All rights reserved.\n             2. Certain documents and files on this website contain a\n             legend indicating that \"Modification is permitted.\" Any person\n             is hereby authorized, without fee, to modify such documents\n             and files to create derivative works conforming to the\n             Unicode (R) Standard, subject to Terms and Conditions herein.\n             3. Any person is hereby authorized, without fee, to view, use,\n             reproduce, and distribute all documents and files solely for\n             informational purposes in the creation of products supporting\n             the Unicode Standard, subject to the Terms and Conditions\n             herein.\n             4. Further specifications of rights and restrictions\n             pertaining to the use of the particular set of data files\n             known as the \"Unicode Character Database\" can be found in\n             Exhibit 1.\n             5. Each version of the Unicode Standard has further\n             specifications of rights and restrictions of use. For the book\n             editions, these are found on the back of the title page. For\n             the online edition, certain files (such as the PDF files for\n             book chapters and code charts) carry specific restrictions.\n             All other files are covered under these general Terms of Use.\n             To request a permission to reproduce any part of the Unicode\n             Standard, please contact the Unicode Consortium.\n             6. No license is granted to \"mirror\" the Unicode website where\n             a fee is charged for access to the \"mirror\" site.\n             7. Modification is not permitted with respect to this\n             document. All copies of this document must be verbatim.\n       2. Restricted Rights Legend. Any technical data or software which is\n       licensed to the United States of America, its agencies and\/or\n       instrumentalities under this Agreement is commercial technical data\n       or commercial computer software developed exclusively at private\n       expense as defined in FAR 2.101, or DFARS 252.227-7014 (June 1995),\n       as applicable. For technical data, use, duplication, or disclosure\n       by the Government is subject to restrictions as set forth in DFARS\n       202.227-7015 Technical Data, Commercial and Items (Nov 1995) and\n       this Agreement. For Software, in accordance with FAR 12-212 or DFARS\n       227-7202, as applicable, use, duplication or disclosure by the\n       Government is subject to the restrictions set forth in this\n       Agreement.\n       3. Warranties and Disclaimers.\n             1. This publication and\/or website may include technical or\n             typographical errors or other inaccuracies . Changes are\n             periodically added to the information herein; these changes\n             will be incorporated in new editions of the publication and\/or\n             website. Unicode may make improvements and\/or changes in the\n             product(s) and\/or program(s) described in this publication\n             and\/or website at any time.\n             2. If this file has been purchased on magnetic or optical\n             media from Unicode, Inc. the sole and exclusive remedy for any\n             claim will be exchange of the defective media within ninety\n             (90) days of original purchase.\n             3. EXCEPT AS PROVIDED IN SECTION C.2, THIS PUBLICATION AND\/OR\n             SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND\n             EITHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT\n             LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A\n             PARTICULAR PURPOSE, OR NON-INFRINGEMENT. UNICODE AND ITS\n             LICENSORS ASSUME NO RESPONSIBILITY FOR ERRORS OR OMISSIONS IN\n             THIS PUBLICATION AND\/OR SOFTWARE OR OTHER DOCUMENTS WHICH ARE\n             REFERENCED BY OR LINKED TO THIS PUBLICATION OR THE UNICODE\n             WEBSITE.\n       4. Waiver of Damages. In no event shall Unicode or its licensors be\n       liable for any special, incidental, indirect or consequential\n       damages of any kind, or any damages whatsoever, whether or not\n       Unicode was advised of the possibility of the damage, including,\n       without limitation, those resulting from the following: loss of use,\n       data or profits, in connection with the use, modification or\n       distribution of this information or its derivatives.\n       5. Trademarks.\n             1. Unicode and the Unicode logo are registered trademarks of\n             Unicode, Inc. \n             2. This site contains product names and corporate names of\n             other companies. All product names and company names and logos\n             mentioned herein are the trademarks or registered trademarks\n             of their respective owners. Other products and corporate names\n             mentioned herein which are trademarks of a third party are\n             used only for explanation and for the owners' benefit and with\n             no intent to infringe.\n             3. Use of third party products or information referred to\n             herein is at the user's risk.\n       6. Miscellaneous.\n             1. Jurisdiction and Venue. This server is operated from a\n             location in the State of California, United States of America.\n             Unicode makes no representation that the materials are\n             appropriate for use in other locations. If you access this\n             server from other locations, you are responsible for\n             compliance with local laws. This Agreement, all use of this\n             site and any claims and damages resulting from use of this\n             site are governed solely by the laws of the State of\n             California without regard to any principles which would apply\n             the laws of a different jurisdiction. The user agrees that any\n             disputes regarding this site shall be resolved solely in the\n             courts located in Santa Clara County, California. The user\n             agrees said courts have personal jurisdiction and agree to\n             waive any right to transfer the dispute to any other forum.\n             2. Modification by Unicode Unicode shall have the right to\n             modify this Agreement at any time by posting it to this site.\n             The user may not assign any part of this Agreement without\n             Unicode's prior written consent.\n             3. Taxes. The user agrees to pay any taxes arising from access\n             to this website or use of the information herein, except for\n             those based on Unicode's net income.\n             4. Severability.  If any provision of this Agreement is\n             declared invalid or unenforceable, the remaining provisions of\n             this Agreement shall remain in effect.\n             5. Entire Agreement. This Agreement constitutes the entire\n             agreement between the parties. \n\nEXHIBIT 1\nUNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE\n\n    Unicode Data Files include all data files under the directories\nhttp:\/\/www.unicode.org\/Public\/, http:\/\/www.unicode.org\/reports\/, and\nhttp:\/\/www.unicode.org\/cldr\/data\/ . Unicode Software includes any source code\npublished in the Unicode Standard or under the directories\nhttp:\/\/www.unicode.org\/Public\/, http:\/\/www.unicode.org\/reports\/, and\nhttp:\/\/www.unicode.org\/cldr\/data\/.\n\n    NOTICE TO USER: Carefully read the following legal agreement. BY\nDOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING UNICODE INC.'S DATA FILES\n(\"DATA FILES\"), AND\/OR SOFTWARE (\"SOFTWARE\"), YOU UNEQUIVOCALLY ACCEPT, AND\nAGREE TO BE BOUND BY, ALL OF THE TERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU\nDO NOT AGREE, DO NOT DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR USE THE DATA FILES\nOR SOFTWARE.\n\n    COPYRIGHT AND PERMISSION NOTICE\n\n    Copyright (c) 1991-2008 Unicode, Inc. All rights reserved. Distributed under\nthe Terms of Use in http:\/\/www.unicode.org\/copyright.html.\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\nof the Unicode data files and any associated documentation (the \"Data Files\") or\nUnicode software and any associated documentation (the \"Software\") to deal in ","trademark":0},{"opinion":0,"patent":0,"pattern":"﻿UNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE\n\n    Unicode Data Files include all data files under the directories\nhttp:\/\/www.unicode.org\/Public\/, http:\/\/www.unicode.org\/reports\/, and\nhttp:\/\/www.unicode.org\/cldr\/data\/. Unicode Data Files do not include PDF\nonline code charts under the directory http:\/\/www.unicode.org\/Public\/.\nSoftware includes any source code published in the Unicode Standard or under\nthe directories http:\/\/www.unicode.org\/Public\/,\nhttp:\/\/www.unicode.org\/reports\/, and http:\/\/www.unicode.org\/cldr\/data\/.\n\n    NOTICE TO USER: Carefully read the following legal agreement. BY\nDOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING UNICODE INC.'S DATA FILES\n(\"DATA FILES\"), AND\/OR SOFTWARE (\"SOFTWARE\"), YOU UNEQUIVOCALLY ACCEPT, AND\nAGREE TO BE BOUND BY, ALL OF THE TERMS AND CONDITIONS OF THIS AGREEMENT. IF\nYOU DO NOT AGREE, DO NOT DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR USE THE DATA\nFILES OR SOFTWARE.\n\n    COPYRIGHT AND PERMISSION NOTICE\n\n    Copyright © 1991-2012 Unicode, Inc. All rights reserved. Distributed under\nthe Terms of Use in http:\/\/www.unicode.org\/copyright.html.","trademark":0},{"opinion":0,"patent":0,"pattern":"the Data Files or Software without restriction, including without limitation the\nrights to use, copy, modify, merge, publish, distribute, and\/or sell copies of\nthe Data Files or Software, and to permit persons to whom the Data Files or\nSoftware are furnished to do so, provided that (a) the above copyright notice(s)\nand this permission notice appear with all copies of the Data Files or Software,\n(b) both the above copyright notice(s) and this permission notice appear in\nassociated documentation, and (c) there is clear notice in each modified Data\nFile or in the Software as well as in the documentation associated with the Data\nFile(s) or Software that the data or software has been modified.","trademark":0},{"opinion":0,"patent":0,"pattern":"UNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE\n\n    Unicode Data Files include all data files under the directories\nhttp:\/\/www.unicode.org\/Public\/, http:\/\/www.unicode.org\/reports\/, and\nhttp:\/\/www.unicode.org\/cldr\/data\/ . Unicode Software includes any source code\npublished in the Unicode Standard or under the directories\nhttp:\/\/www.unicode.org\/Public\/, http:\/\/www.unicode.org\/reports\/, and\nhttp:\/\/www.unicode.org\/cldr\/data\/.\n\n    NOTICE TO USER: Carefully read the following legal agreement. BY\nDOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING UNICODE INC.'S DATA FILES\n(\"DATA FILES\"), AND\/OR SOFTWARE (\"SOFTWARE\"), YOU UNEQUIVOCALLY ACCEPT, AND\nAGREE TO BE BOUND BY, ALL OF THE TERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU\nDO NOT AGREE, DO NOT DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR USE THE DATA FILES\nOR SOFTWARE.\n\n    COPYRIGHT AND PERMISSION NOTICE\n\n    Copyright Â© $SKIP19 All rights reserved. Distributed under\nthe Terms of Use in http:\/\/www.unicode.org\/copyright.html.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"This software distribution contains derived data from a modified version of\nthe Unicode data files. The following license applies to that data:\n\nCOPYRIGHT AND PERMISSION NOTICE\n\nCopyright (c) $SKIP19. All rights reserved. Distributed\nunder the Terms of Use in http:\/\/www.unicode.org\/copyright.html.\n\nPermission is hereby granted, free of charge, to any person obtaining a\ncopy of the Unicode data files and any associated documentation (the \"Data\nFiles\") or Unicode software and any associated documentation (the\n\"Software\") to deal in the Data Files or Software without restriction,\nincluding without limitation the rights to use, copy, modify, merge,\npublish, distribute, and\/or sell copies of the Data Files or Software, and\nto permit persons to whom the Data Files or Software are furnished to do\nso, provided that (a) the above copyright notice(s) and this permission\nnotice appear with all copies of the Data Files or Software, (b) both the\nabove copyright notice(s) and this permission notice appear in associated\ndocumentation, and (c) there is clear notice in each modified Data File or\nin the Software as well as in the documentation associated with the Data\nFile(s) or Software that the data or software has been modified.\n\nTHE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY\nKIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF\nTHIRD PARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS\nINCLUDED IN THIS NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR\nCONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF\nUSE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER\nTORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\nPERFORMANCE OF THE DATA FILES OR SOFTWARE.\n\nExcept as contained in this notice, the name of a copyright holder shall\nnot be used in advertising or otherwise to promote the sale, use or other\ndealings in these Data Files or Software without prior written\nauthorization of the copyright holder.","trademark":0},{"opinion":0,"patent":0,"pattern":"#  This file contains derived data from a modified version of the\n#  Unicode data files. The following license applies to that data:\n#\n#  COPYRIGHT AND PERMISSION NOTICE\n#\n#  Copyright (c) 1991-2007 Unicode, Inc. All rights reserved. Distributed\n#  under the Terms of Use in http:\/\/www.unicode.org\/copyright.html.\n#\n#  Permission is hereby granted, free of charge, to any person obtaining a\n#  copy of the Unicode data files and any associated documentation (the \"Data\n#  Files\") or Unicode software and any associated documentation (the\n#  \"Software\") to deal in the Data Files or Software without restriction,\n#  including without limitation the rights to use, copy, modify, merge,\n#  publish, distribute, and\/or sell copies of the Data Files or Software, and\n#  to permit persons to whom the Data Files or Software are furnished to do\n#  so, provided that (a) the above copyright notice(s) and this permission\n#  notice appear with all copies of the Data Files or Software, (b) both the\n#  above copyright notice(s) and this permission notice appear in associated\n#  documentation, and (c) there is clear notice in each modified Data File or\n#  in the Software as well as in the documentation associated with the Data\n#  File(s) or Software that the data or software has been modified.\n#\n#  THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY\n#  KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n#  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF\n#  THIRD PARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS\n#  INCLUDED IN THIS NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR\n#  CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF\n#  USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER\n#  TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\n#  PERFORMANCE OF THE DATA FILES OR SOFTWARE.\n#\n#  Except as contained in this notice, the name of a copyright holder shall\n#  not be used in advertising or otherwise to promote the sale, use or other\n#  dealings in these Data Files or Software without prior written\n#  authorization of the copyright holder.","trademark":0},{"opinion":0,"patent":0,"pattern":"UNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE\n\nUnicode Data Files include all data files under the directories\nhttp:\/\/www.unicode.org\/Public\/ and\nhttp:\/\/www.unicode.org\/reports\/. Unicode Software includes any source\ncode under the directories http:\/\/www.unicode.org\/Public\/ and\nhttp:\/\/www.unicode.org\/reports\/.\n\nNOTICE TO USER: Carefully read the following legal agreement. BY\nDOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING UNICODE INC.'S\nDATA FILES (\"DATA FILES\"), AND\/OR SOFTWARE (\"SOFTWARE\"), YOU\nUNEQUIVOCALLY ACCEPT, AND AGREE TO BE BOUND BY, ALL OF THE TERMS AND\nCONDITIONS OF THIS AGREEMENT. IF YOU DO NOT AGREE, DO NOT DOWNLOAD,\nINSTALL, COPY, DISTRIBUTE OR USE THE DATA FILES OR SOFTWARE.\n\nCOPYRIGHT AND PERMISSION NOTICE\n\nCopyright © $SKIP19. All rights reserved. Distributed\nunder the Terms of Use in http:\/\/www.unicode.org\/copyright.html.\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of the Unicode data files and associated documentation (the\n\"Data Files\") or Unicode software and associated documentation (the\n\"Software\") to deal in the Data Files or Software without restriction,\nincluding without limitation the rights to use, copy, modify, merge,\npublish, distribute, and\/or sell copies of the Data Files or Software,\nand to permit persons to whom the Data Files or Software are furnished\nto do so, provided that (a) the above copyright notice(s) and this\npermission notice appear in all copies of the Data Files or Software,\n(b) both the above copyright notice(s) and this permission notice\nappear in associated documentation, and (c) there is clear notice in\neach modified Data File or in the Software as well as in the\ndocumentation associated with the Data File(s) or Software that the\ndata or software has been modified.\n\nTHE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF\nANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT\nHOLDER OR HOLDERS INCLUDED IN THIS NOTICE BE LIABLE FOR ANY CLAIM, OR\nANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES\nWHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\nACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT\nOF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THE DATA FILES OR\nSOFTWARE.\n\nExcept as contained in this notice, the name of a copyright holder\nshall not be used in advertising or otherwise to promote the sale, use\nor other dealings in these Data Files or Software without prior\nwritten authorization of the copyright holder.","trademark":0},{"opinion":0,"patent":0,"pattern":"Portions of the unit tests are derived from the Unicode standard, which \nis subject to the Unicode, Inc. License Agreement:\n\n   Copyright (c) $SKIP19. All rights reserved.\n   Distributed under the Terms of Use in \n   <http:\/\/www.unicode.org\/copyright.html>.\n\n   Permission is hereby granted, free of charge, to any person obtaining\n   a copy of the Unicode data files and any associated documentation\n   (the \"Data Files\") or Unicode software and any associated documentation\n   (the \"Software\") to deal in the Data Files or Software\n   without restriction, including without limitation the rights to use,\n   copy, modify, merge, publish, distribute, and\/or sell copies of\n   the Data Files or Software, and to permit persons to whom the Data Files\n   or Software are furnished to do so, provided that\n   \n   (a) this copyright and permission notice appear with all copies \n   of the Data Files or Software,\n\n   (b) this copyright and permission notice appear in associated \n   documentation, and\n\n   (c) there is clear notice in each modified Data File or in the Software\n   as well as in the documentation associated with the Data File(s) or\n   Software that the data or software has been modified.\n\n   THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF\n   ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\n   WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n   NONINFRINGEMENT OF THIRD PARTY RIGHTS.\n   IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS\n   NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL\n   DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE,\n   DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER\n   TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\n   PERFORMANCE OF THE DATA FILES OR SOFTWARE.\n\n   Except as contained in this notice, the name of a copyright holder\n   shall not be used in advertising or otherwise to promote the sale,\n   use or other dealings in these Data Files or Software without prior\n   written authorization of the copyright holder.","trademark":0},{"opinion":0,"patent":0,"pattern":"Permission is hereby granted, free of charge, to any person obtaining\na copy of the Unicode data files and any associated documentation\n(the \"Data Files\") or Unicode software and any associated documentation\n(the \"Software\") to deal in the Data Files or Software\nwithout restriction, including without limitation the rights to use,\ncopy, modify, merge, publish, distribute, and\/or sell copies of\nthe Data Files or Software, and to permit persons to whom the Data Files\nor Software are furnished to do so, provided that\n(a) this copyright and permission notice appear with all copies \nof the Data Files or Software,\n(b) this copyright and permission notice appear in associated \ndocumentation, and\n(c) there is clear notice in each modified Data File or in the Software\nas well as in the documentation associated with the Data File(s) or\nSoftware that the data or software has been modified.","trademark":0},{"opinion":0,"patent":0,"pattern":" * Disclaimer\n *\n * This source code is provided as is by Unicode, Inc. No claims are\n * made as to fitness for any particular purpose. No warranties of any\n * kind are expressed or implied. The recipient agrees to determine\n * applicability of information provided. If this file has been\n * purchased on magnetic or optical media from Unicode, Inc., the\n * sole remedy for any claim will be exchange of defective media\n * within 90 days of receipt.\n *\n * Limitations on Rights to Redistribute This Code\n *\n * Unicode, Inc. hereby grants the right to freely use the information\n * supplied in this file in the creation of products supporting the\n * Unicode Standard, and to make copies of this file in any form\n * for internal or external distribution as long as this notice\n","trademark":0},{"opinion":0,"patent":0,"pattern":"#\tThis file is provided as-is by Unicode, Inc. (The Unicode Consortium).\n#\tNo claims are made as to fitness for any particular purpose.  No\n#\twarranties of any kind are expressed or implied.  The recipient\n#\tagrees to determine applicability of information provided.  If this\n#\tfile has been provided on magnetic media by Unicode, Inc., the sole\n#\tremedy for any claim will be exchange of defective media within 90\n#\tdays of receipt.\n#\n#\tRecipient is granted the right to make copies in any form for\n#\tinternal distribution and to freely use the information supplied\n#\tin the creation of products supporting Unicode.  Unicode, Inc.\n#\tspecifically excludes the right to re-distribute this file directly\n#\tto third parties or other organizations whether for profit or not.","trademark":0}],"risk":1,"url":"http:\/\/www.unicode.org\/copyright.html#Exhibit1"}