{"description":null,"eula":0,"name":"GPL-2.0+ WITH Linking-exception","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"#   option) any later version.\n#\n#   This program is distributed in the hope that it will be useful, but\n#   WITHOUT ANY WARRANTY; without even the implied warranty of\n#   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General\n#   Public License for more details.\n#\n#   You should have received a copy of the GNU General Public License along\n#   with this program. If not, see <http:\/\/www.gnu.org\/licenses\/>.\n#\n#   As a special exception, the respective Autoconf Macro's copyright owner\n#   gives unlimited permission to copy, distribute and modify the configure\n#   scripts that are the output of Autoconf when processing the Macro. You\n#   need not follow the terms of the GNU General Public License when using\n#   or distributing such scripts, even though portions of the text of the\n#   Macro appear in them. The GNU General Public License (GPL) does govern\n#   all other use of the material that constitutes the Autoconf Macro.\n#\n#   This special exception to the GPL applies to versions of the Autoconf\n#   Macro released by the Autoconf Archive. When you make and distribute a\n#   modified version of the Autoconf Macro, you may extend this special\n#   exception to the GPL to apply to your modified version as well.","trademark":0},{"opinion":0,"patent":0,"pattern":"*% This PostScript Printer Description(PPD) file is free software; you\n*% can redistribute it and\/or modify it under the terms of the GNU\n*% General Public License version 2 or later as published by the Free\n*% Software Foundation.\n*%\n*% In addition to the permissions in the GNU General Public License,\n*% Oki Data Corporation gives you unlimited permission to link the\n*% PostScript code fragments herein into your PostScript documents to\n*% form an excutable for enabling printer-specific features, and\n*% distribute those combinations without any restrictions from the use\n*% of this PPD file. (The General Public License restrictions do apply\n*% in other respects; for example, they cover modification of the\n*% file, and distribution when not merged into a PostScript document.)\n*%\n*% This PPD is distributed in the hope that it will be useful, but\n*% WITHOUT ANY WARRANTY; without even the implied warranty of\n*% MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n*% General Public License for more details.\n*%\n*% You should have received a copy of the GNU General Public License\n*% along with this PPD; see the file COPYING.","trademark":0},{"opinion":0,"patent":0,"pattern":"The files in this directory and elsewhere which refer to this LICENCE\nfile are part of JFFS2, the Journalling Flash File System v2.\n\n\tCopyright © $SKIP19\n\nJFFS2 is free software; you can redistribute it and\/or modify it under\nthe terms of the GNU General Public License as published by the Free\nSoftware Foundation; either version 2 or (at your option) any later \nversion.\n\nJFFS2 is distributed in the hope that it will be useful, but WITHOUT\nANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\nFITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License\nfor more details.\n\nYou should have received a copy of the GNU General Public License along\nwith JFFS2; if not, write to the Free Software Foundation, Inc.,\n59 Temple Place, Suite 330, Boston, MA 02111-1307 USA.\n\nAs a special exception, if other files instantiate templates or use\nmacros or inline functions from these files, or you compile these\nfiles and link them with other works to produce a work based on these\nfiles, these files do not by themselves cause the resulting work to be\ncovered by the GNU General Public License. However the source code for\nthese files must still be made available in accordance with section (3)\nof the GNU General Public License.\n\nThis exception does not invalidate any other reasons why a work based on\nthis file might be covered by the GNU General Public License.","trademark":0},{"opinion":0,"patent":0,"pattern":" * In addition, as a special exception, $SKIP10\n * gives permission to link the code of this program with\n * non-LGPL Spelling Provider libraries (eg: a MSFT Office\n * spell checker backend) and distribute linked combinations including\n * the two.  You must obey the GNU General Public License in all\n * respects for all of the code used other than said providers.  If you modify\n * this file, you may extend this exception to your version of the\n * file, but you are not obligated to do so.  If you do not wish to\n * do so, delete this exception statement from your version.","trademark":0},{"opinion":0,"patent":0,"pattern":"%% This file is NOT the source for feynmf, because almost all comments\n%% have been stripped from it.  It is NOT the preferred form of feynmf\n%% for making modifications to it.\n%% \n%% Therefore you can NOT redistribute and\/or modify THIS file.  You can\n%% however redistribute the complete source (feynmf.dtx and feynmf.ins)\n%% and\/or modify it under the terms of the GNU General Public License as\n%% published by  the Free Software Foundation; either version 2, or (at\n%% your option) any later version.\n%% \n%% As a special exception, you can redistribute parts of this file for\n%% the electronic distribution of scientific papers, provided that you\n%% include a short note pointing to the complete source.\n%% \n%% Feynmf is distributed in the hope that it will be useful, but\n%% WITHOUT ANY WARRANTY; without even the implied warranty of\n%% MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n%% GNU General Public License for more details.\n%% \n%% You should have received a copy of the GNU General Public License\n%% along with this program; if not, write to the Free Software\n%% Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.","trademark":0},{"opinion":0,"patent":0,"pattern":"dnl This program is free software; you can redistribute it and\/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.\n\ndnl This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.\n\ndnl You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.\n\ndnl As a special exception, the respective Autoconf Macro's copyright owner gives unlimited permission to copy, distribute and modify the configure scripts that are the output of Autoconf when processing the Macro. You need not follow the terms of the GNU General Public License when using or distributing such scripts, even though portions of the text of the Macro appear in them. The GNU General Public License (GPL) does govern all other use of the material that constitutes the Autoconf Macro.\n\ndnl This special exception to the GPL applies to versions of the Autoconf Macro released by the Autoconf Macro Archive. When you make and distribute a modified version of the Autoconf Macro, you may extend this special exception to the GPL to apply to your modified version as well.","trademark":0},{"opinion":0,"patent":0,"pattern":"*% This software is free software; you can redistribute it and\/or\n*% modify it under the terms of the GNU General Public License as\n*% published by the Free Software Foundation; either version 2 of\n*% the License, or (at your option) any later version.\n*% \n*% In addition to the permissions in the GNU General Public License,\n*% TOSHIBA TEC Corporation gives you unlimited permission to link the\n*% PostScript code fragments herein into your PostScript documents to\n*% form an executable for enabling printer-specific features, and\n*% distribute those combinations without any restrictions from the use\n*% of this PPD file. (The General Public License restrictions do apply\n*% in other respects; for example, they cover modification of the\n*% file, and distribution when not merged into a PostScript document.)","trademark":0},{"opinion":0,"patent":0,"pattern":" * This library is distributed in the hope that it will be useful,\n * but WITHOUT ANY WARRANTY; without even the implied warranty of\n * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n * General Public License for more details.\n *\n * You should have received a copy of the GNU General Public\n * License along with this library; if not, write to the Free Software\n * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.\n *\n * The Ev project hereby grant permission for non-gpl compatible GStreamer\n * plugins to be used and distributed together with GStreamer and Ev. This\n * permission are above and beyond the permissions granted by the GPL license\n * Ev is covered by.","trademark":0},{"opinion":0,"patent":0,"pattern":"This file is part of GNU CC.\n   \nGNU CC is free software; you can redistribute it and\/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation; either version 2, or (at your option)\nany later version.\n\nIn addition to the permissions in the GNU General Public License, the\nFree Software Foundation gives you unlimited permission to link the\ncompiled version of this file into combinations with other programs,\nand to distribute those combinations without any restriction coming\nfrom the use of this file.  (The General Public License restrictions\ndo apply in other respects; for example, they cover modification of\nthe file, and distribution when not linked into a combined\nexecutable.)\n","trademark":0},{"opinion":0,"patent":0,"pattern":"%%%  This program is distributed in the hope that it will be useful,\n%%%  but WITHOUT ANY WARRANTY; without even the implied warranty of\n%%%  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n%%%  GNU General Public License for more details.\n%%%\n%%%  You should have received a copy of the GNU General Public License\n%%%  along with this program; if not, write to the Free Software\n%%%  Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307, USA.\n%%%\n%%%  In addition, as a special exception, you have the permission to\n%%%  link the code of this program with any library released under\n%%%  the EPL license and distribute linked combinations including\n%%%  the two; the MPL (Mozilla Public License), which EPL (Erlang\n%%%  Public License) is based on, is included in this exception.","trademark":0},{"opinion":0,"patent":0,"pattern":"# As a special exception,  you may use this file  as part of a free software library without\n# restriction.  Specifically,  if other files instantiate templates  or use macros or inline\n# functions from this file, or you compile this file and link it with other files to produce\n# an executable,  this file does not by itself cause the resulting executable to be covered\n# by the GNU General Public License. This exception does not however invalidate any other\n# reasons why the executable file might be covered by the GNU General Public License.","trademark":0},{"opinion":0,"patent":0,"pattern":"REM Copyright $SKIP19.  All Rights Reserved.\nREM\nREM This file is part of Threading Building Blocks. Threading Building Blocks is free software;\nREM you can redistribute it and\/or modify it under the terms of the GNU General Public License\nREM version 2  as  published  by  the  Free Software Foundation.  Threading Building Blocks is\nREM distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the\nREM implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.\nREM See  the GNU General Public License for more details.   You should have received a copy of\nREM the  GNU General Public License along with Threading Building Blocks; if not, write to the\nREM Free Software Foundation, Inc.,  51 Franklin St,  Fifth Floor,  Boston,  MA 02110-1301 USA\nREM\nREM As a special exception,  you may use this file  as part of a free software library without\nREM restriction.  Specifically,  if other files instantiate templates  or use macros or inline\nREM functions from this file, or you compile this file and link it with other files to produce\nREM an executable,  this file does not by itself cause the resulting executable to be covered\nREM by the GNU General Public License. This exception does not however invalidate any other\nREM reasons why the executable file might be covered by the GNU General Public License.","trademark":0},{"opinion":0,"patent":0,"pattern":"# GNU Libtool is free software; you can redistribute it and\/or\r\n# modify it under the terms of the GNU General Public License as\r\n# published by the Free Software Foundation; either version 2 of\r\n# the License, or (at your option) any later version.\r\n#\r\n# As a special exception to the GNU General Public License,\r\n# if you distribute this file as part of a program or library that\r\n# is built using GNU Libtool, you may include this file under the\r\n# same distribution terms that you use for the rest of that program.\r\n#\r\n# GNU Libtool is distributed in the hope that it will be useful,\r\n# but WITHOUT ANY WARRANTY; without even the implied warranty of\r\n# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\r\n# GNU General Public License for more details.\r\n#\r\n# You should have received a copy of the GNU General Public License\r\n# along with GNU Libtool; see the file COPYING.  If not, a copy\r\n# can be downloaded from http:\/\/www.gnu.org\/licenses\/gpl.html, or\r\n# obtained by writing to the Free Software Foundation, Inc.,\r\n# 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.","trademark":0},{"opinion":0,"patent":0,"pattern":" *   This program is free software; you can redistribute it and\/or modify\n *   it under the terms of the GNU General Public License as published by\n *   the Free Software Foundation; either version 2 of the License, or\n *   (at your option) any later version.\n *\n *   This program is distributed in the hope that it will be useful,\n *   but WITHOUT ANY WARRANTY; without even the implied warranty of\n *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n *   GNU General Public License for more details.\n *\n *   You should have received a copy of the GNU General Public License\n *   along with this program; if not, write to the Free Software\n *   Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307, USA.\n\n *   As a special exemption, M Moeller gives permission to link this program\n *   with MIT, Heimdal or other GSS\/Kerberos libraries, and distribute\n *   the resulting executable, without including the source code for\n *   the Libraries in the source distribution.","trademark":0},{"opinion":0,"patent":0,"pattern":"is free software; you can redistribute it and\/or modify it\nunder the terms of the GNU General Public License, version 2 or above,\nas published by the Free Software Foundation.\n\n$SKIP5 is distributed in the hope that it will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\nGeneral Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with $SKIP5 if not, write to the Free Software\nFoundation, Inc., $SKIP15\n\nIn addition, as a special exception, the copyright holders give\npermission to link the code of this program with any edition of\nthe Qt library by Trolltech AS, Norway (or with modified versions\nof Qt that use the same license as Qt), and distribute linked\ncombinations including the two.  You must obey the GNU General\nPublic License in all respects for all of the code used other than\nQt.  If you modify this file, you may extend this exception to\nyour version of the file, but you are not obligated to do so.  If\nyou do not wish to do so, delete this exception statement from\nyour version.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"is licensed under the GNU General Public License version 2\nor later. The text of the GNU General Public License can be viewed at\nhttp:\/\/www.gnu.org\/licenses\/gpl.html\n\nAs a special exception, you have permission to link this program\nwith the following libraries and distribute executables, as long as you\nfollow the requirements of the GNU GPL in regard to all of the\nsoftware in the executable aside from the following libraries:\n","trademark":0},{"opinion":0,"patent":0,"pattern":"     free software; you can redistribute it and\/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    $SKIP8 is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n    General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with $SKIP8; if not, write to the Free Software\n    Foundation, $SKIP20\n\n    In addition, as a special exception, the copyright holders give\n    permission to link the code of this program with any edition of\n    the Qt library by Trolltech AS, Norway (or with modified versions\n    of Qt that use the same license as Qt), and distribute linked\n    combinations including the two.  You must obey the GNU General\n    Public License in all respects for all of the code used other than\n    Qt.  If you modify this clipboard, you may extend this exception to\n    your version of the clipboard, but you are not obligated to do so.  If\n    you do not wish to do so, delete this exception statement from\n    your version.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"    free software; you can redistribute it and\/or modify\r\n *  it under the terms of the GNU General Public License as published by\r\n *  the Free Software Foundation; either version 2 of the License, or\r\n *  (at your option) any later version.\r\n *\r\n *  As a special exception, you have permission to link this program\r\n *  with $SKIP8 and distribute executables, as long as you\r\n *  follow the requirements of the GNU GPL in regard to all of the\r\n *  software in the executable aside $SKIP8\r\n *\r\n *  $SKIP8 is distributed in the hope that it will be useful,\r\n *  but WITHOUT ANY WARRANTY; without even the implied warranty of\r\n *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\r\n *  GNU General Public License for more details.\r\n *\r\n *  You should have received a copy of the GNU General Public License\r\n *  along with $SKIP8; if not, write to the Free Software\r\n *  Foundation, Inc.,","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/ Avisynth C Interface Version 0.20\n\/\/ Copyright 2003 Kevin Atkinson\n\n\/\/ This program is free software; you can redistribute it and\/or modify\n\/\/ it under the terms of the GNU General Public License as published by\n\/\/ the Free Software Foundation; either version 2 of the License, or\n\/\/ (at your option) any later version.\n\/\/\n\/\/ This program is distributed in the hope that it will be useful,\n\/\/ but WITHOUT ANY WARRANTY; without even the implied warranty of\n\/\/ MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n\/\/ GNU General Public License for more details.\n\/\/\n\/\/ You should have received a copy of the GNU General Public License\n\/\/ along with this program; if not, write to the Free Software\n\/\/ Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA, or visit\n\/\/ http:\/\/www.gnu.org\/copyleft\/gpl.html .\n\/\/\n\/\/ As a special exception, I give you permission to link to the\n\/\/ Avisynth C interface with independent modules that communicate with\n\/\/ the Avisynth C interface solely through the interfaces defined in\n\/\/ avisynth_c.h, regardless of the license terms of these independent\n\/\/ modules, and to copy and distribute the resulting combined work\n\/\/ under terms of your choice, provided that every copy of the\n\/\/ combined work is accompanied by a complete copy of the source code\n\/\/ of the Avisynth C interface and Avisynth itself (with the version\n\/\/ used to produce the combined work), being distributed under the\n\/\/ terms of the GNU General Public License plus this exception.  An\n\/\/ independent module is a module which is not derived from or based\n\/\/ on Avisynth C Interface, such as 3rd-party filters, import and\n\/\/ export plugins, or graphical user interfaces.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"\n\/\/ * This file is part of the HqMAME project. It is distributed under         *\n\/\/ * GNU General Public License: http:\/\/www.gnu.org\/licenses\/gpl.html         *\n\/\/ * Copyright (C) Zenju (zenju AT gmx DOT de) - All Rights Reserved          *\n\/\/ *                                                                          *\n\/\/ * Additionally and as a special exception, the author gives permission     *\n\/\/ * to link the code of this program with the MAME library (or with modified *\n\/\/ * versions of MAME that use the same license as MAME), and distribute      *\n\/\/ * linked combinations including the two. You must obey the GNU General     *\n\/\/ * Public License in all respects for all of the code used other than MAME. *\n\/\/ * If you modify this file, you may extend this exception to your version   *\n\/\/ * of the file, but you are not obligated to do so. If you do not wish to   *\n\/\/ * do so, delete this exception statement from your version.    ","trademark":0}],"risk":2,"url":null}