{"description":null,"eula":0,"name":"OFL-1.1","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"This Font Software is licensed under the SIL Open Font License, Version 1.1.\nThis license is copied below, and is also available with a FAQ at:\nhttp:\/\/scripts.sil.org\/OFL\n\n\n-----------------------------------------------------------\nSIL OPEN FONT LICENSE Version 1.1 - 26 February 2007\n-----------------------------------------------------------\n\nPREAMBLE\nThe goals of the Open Font License (OFL) are to stimulate worldwide\ndevelopment of collaborative font projects, to support the font creation\nefforts of academic and linguistic communities, and to provide a free and\nopen framework in which fonts may be shared and improved in partnership\nwith others.\n\nThe OFL allows the licensed fonts to be used, studied, modified and\nredistributed freely as long as they are not sold by themselves. The\nfonts, including any derivative works, can be bundled, embedded, \nredistributed and\/or sold with any software provided that any reserved\nnames are not used by derivative works. The fonts and derivatives,\nhowever, cannot be released under any other type of license. The\nrequirement for fonts to remain under this license does not apply\nto any document created using the fonts or their derivatives.\n\nDEFINITIONS\n\"Font Software\" refers to the set of files released by the Copyright\nHolder(s) under this license and clearly marked as such. This may\ninclude source files, build scripts and documentation.\n\n\"Reserved Font Name\" refers to any names specified as such after the\ncopyright statement(s).\n\n\"Original Version\" refers to the collection of Font Software components as\ndistributed by the Copyright Holder(s).\n\n\"Modified Version\" refers to any derivative made by adding to, deleting,\nor substituting -- in part or in whole -- any of the components of the\nOriginal Version, by changing formats or by porting the Font Software to a\nnew environment.\n\n\"Author\" refers to any designer, engineer, programmer, technical\nwriter or other person who contributed to the Font Software.\n\nPERMISSION & CONDITIONS\nPermission is hereby granted, free of charge, to any person obtaining\na copy of the Font Software, to use, study, copy, merge, embed, modify,\nredistribute, and sell modified and unmodified copies of the Font\nSoftware, subject to the following conditions:\n\n1) Neither the Font Software nor any of its individual components,\nin Original or Modified Versions, may be sold by itself.\n\n2) Original or Modified Versions of the Font Software may be bundled,\nredistributed and\/or sold with any software, provided that each copy\ncontains the above copyright notice and this license. These can be\nincluded either as stand-alone text files, human-readable headers or\nin the appropriate machine-readable metadata fields within text or\nbinary files as long as those fields can be easily viewed by the user.\n\n3) No Modified Version of the Font Software may use the Reserved Font\nName(s) unless explicit written permission is granted by the corresponding\nCopyright Holder. This restriction only applies to the primary font name as\npresented to the users.\n\n4) The name(s) of the Copyright Holder(s) or the Author(s) of the Font\nSoftware shall not be used to promote, endorse or advertise any\nModified Version, except to acknowledge the contribution(s) of the\nCopyright Holder(s) and the Author(s) or with their explicit written\npermission.\n\n5) The Font Software, modified or unmodified, in part or in whole,\nmust be distributed entirely under this license, and must not be\ndistributed under any other license. The requirement for fonts to\nremain under this license does not apply to any document created\nusing the Font Software.\n\nTERMINATION\nThis license becomes null and void if any of the above conditions are\nnot met.\n\nDISCLAIMER\nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\nOF COPYRIGHT, PATENT, TRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL THE\nCOPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\nINCLUDING ANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\nDAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF THE USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM\nOTHER DEALINGS IN THE FONT SOFTWARE.","trademark":0},{"opinion":0,"patent":0,"pattern":"This Font Software is licensed under the SIL Open Font License, Version 1.1,","trademark":0},{"opinion":0,"patent":0,"pattern":"SIL OPEN FONT LICENSE Version 1.1 - 26 February 2007\n-----------------------------------------------------------\n\nPREAMBLE\nThe goals of the Open Font License (OFL) are to stimulate worldwide\ndevelopment of collaborative font projects, to support the font creation\nefforts of academic and linguistic communities, and to provide a free and\nopen framework in which fonts may be shared and improved in partnership\nwith others.\n\nThe OFL allows the licensed fonts to be used, studied, modified and\nredistributed freely as long as they are not sold by themselves. The\nfonts, including any derivative works, can be bundled, embedded, \nredistributed and\/or sold with any software provided that any reserved\nnames are not used by derivative works. The fonts and derivatives,\nhowever, cannot be released under any other type of license. The\nrequirement for fonts to remain under this license does not apply\nto any document created using the fonts or their derivatives.\n\nDEFINITIONS\n\"Font Software\" refers to the set of files released by the Copyright\nHolder(s) under this license and clearly marked as such. This may\ninclude source files, build scripts and documentation.\n\n\"Reserved Font Name\" refers to any names specified as such after the\ncopyright statement(s).\n\n\"Original Version\" refers to the collection of Font Software components as\ndistributed by the Copyright Holder(s).\n\n\"Modified Version\" refers to any derivative made by adding to, deleting,\nor substituting -- in part or in whole -- any of the components of the\nOriginal Version, by changing formats or by porting the Font Software to a\nnew environment.\n\n\"Author\" refers to any designer, engineer, programmer, technical\nwriter or other person who contributed to the Font Software.\n\nPERMISSION & CONDITIONS\nPermission is hereby granted, free of charge, to any person obtaining\na copy of the Font Software, to use, study, copy, merge, embed, modify,\nredistribute, and sell modified and unmodified copies of the Font\nSoftware, subject to the following conditions:\n\n1) Neither the Font Software nor any of its individual components,\nin Original or Modified Versions, may be sold by itself.\n\n2) Original or Modified Versions of the Font Software may be bundled,\nredistributed and\/or sold with any software, provided that each copy\ncontains the above copyright notice and this license. These can be\nincluded either as stand-alone text files, human-readable headers or\nin the appropriate machine-readable metadata fields within text or\nbinary files as long as those fields can be easily viewed by the user.\n\n3) No Modified Version of the Font Software may use the Reserved Font\nName(s) unless explicit written permission is granted by the corresponding\nCopyright Holder. This restriction only applies to the primary font name as\npresented to the users.\n\n4) The name(s) of the Copyright Holder(s) or the Author(s) of the Font\nSoftware shall not be used to promote, endorse or advertise any\nModified Version, except to acknowledge the contribution(s) of the\nCopyright Holder(s) and the Author(s) or with their explicit written\npermission.\n\n5) The Font Software, modified or unmodified, in part or in whole,\nmust be distributed entirely under this license, and must not be\ndistributed under any other license. The requirement for fonts to\nremain under this license does not apply to any document created\nusing the Font Software.\n\nTERMINATION\nThis license becomes null and void if any of the above conditions are\nnot met.\n\nDISCLAIMER\nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\nOF COPYRIGHT, PATENT, TRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL THE\nCOPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\nINCLUDING ANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\nDAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF THE USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM\nOTHER DEALINGS IN THE FONT SOFTWARE. ","trademark":0},{"opinion":0,"patent":0,"pattern":"5  ABOUT THE LICENSE\n\n5.1  I see that this is version 1.1 of the license. Will there be later changes?\nVersion 1.1 is the first minor revision of the OFL. We are confident that version 1.1 will meet most needs, but are open to future improvements. Any revisions would be for future font releases, and previously existing licenses would remain in effect. No retroactive changes are possible, although the Copyright Holder(s) can re-release the font under a revised OFL. All versions will be available on our web site: http:\/\/scripts.sil.org\/OFL.\n\n5.2  Can I use the SIL Open Font License for my own fonts?\nYes! We heartily encourage anyone to use the OFL to distribute their own original fonts. It is a carefully constructed license that allows great freedom along with enough artistic integrity protection for the work of the authors as well as clear rules for other contributors and those who redistribute the fonts. Some additional information about using the OFL is included at the end of this FAQ.\n\n5.3  Does this license restrict the rights of the Copyright Holder(s)?\nNo. The Copyright Holder(s) still retain(s) all the rights to their creation; they are only releasing a portion of it for use in a specific way. For example, the Copyright Holder(s) may choose to release a 'basic' version of their font under the OFL, but sell a restricted 'enhanced' version. Only the Copyright Holder(s) can do this.\n\n5.4 Is the OFL a contract or a license?\nThe OFL is a license and not a contract and so does not require you to sign it to have legal validity. By using, modifying and redistributing components under the OFL you indicate that you accept the license.\n\n5.5 How about translating the license and the FAQ into other languages?\nSIL certainly recognises the need for people who are not familiar with English to be able to understand the OFL and this FAQ better in their own language. Making the license very clear and readable is a key goal of the OFL.\n\nIf you are an experienced translator, you are very welcome to help by translating the OFL and its FAQ so that designers and users in your language community can understand the license better. But only the original English version of the license has legal value and has been approved by the community. Translations do not count as legal substitutes and should only serve as a way to explain the original license. SIL - as the author and steward of the license for the community at large - does not approve any translation of the OFL as legally valid because even small translation ambiguities could be abused and create problems.\n\nWe give permission to publish unofficial translations into other languages provided that they comply with the following guidelines:\n\n- put the following disclaimer in both English and the target language stating clearly that the translation is unofficial:\n\n\"This is an unofficial translation of the SIL Open Font License into $language. It was not published by SIL International, and does not legally state the distribution terms for fonts that use the OFL. A release under the OFL is only valid when using the original English text.\n\nHowever, we recognize that this unofficial translation will help users and designers not familiar with English to understand the SIL OFL better and make it easier to use and release font families under this collaborative font design model. We encourage designers who consider releasing their creation under the OFL to read the FAQ in their own language if it is available.\n \nPlease go to http:\/\/scripts.sil.org\/OFL for the official version of the license and the accompanying FAQ.\"\n\n- keep your unofficial translation current and update it at our request if needed, for example if there is any ambiguity which could lead to confusion.  \n\nIf you start such a unofficial translation effort of the OFL and its accompanying FAQ please let us know, thank you.\n\n\n6  ABOUT SIL INTERNATIONAL\n\n6.1  Who is SIL International and what does it do?\nSIL International is a worldwide faith-based education and development organization (NGO) that studies, documents, and assists in developing the world's lesser-known languages through literacy, linguistics, translation, and other academic disciplines. SIL makes its services available to all without regard to religious belief, political ideology, gender, race, or ethnic background. SIL's members and volunteers share a Christian commitment.\n\n6.2  What does this have to do with font licensing?\nThe ability to read, write, type and publish in one's own language is one of the most critical needs for millions of people around the world. This requires fonts that are widely available and support lesser-known languages. SIL develops - and encourages others to develop - a complete stack of writing systems implementation components available under open licenses. This open stack includes input methods, smart fonts, smart rendering libraries and smart applications. There has been a need for a common open license that is specifically applicable to fonts and related software (a crucial component of this stack) so SIL developed the SIL Open Font License with the help of the FLOSS community.\n\n6.3  How can I contact SIL?\nOur main web site is: http:\/\/www.sil.org\/\nOur site about complex scripts is: http:\/\/scripts.sil.org\/\nInformation about this license (including contact email information) is at: http:\/\/scripts.sil.org\/OFL","trademark":0},{"opinion":0,"patent":0,"pattern":"%%EndFont \n%%BeginFont: CMMI10\n%!PS-AdobeFont-1.0: CMMI10 003.002\n%%Title: CMMI10\n%Version: 003.002\n%%CreationDate: Mon Jul 13 16:17:00 2009\n%%Creator: David M. Jones\n%Copyright: Copyright (c) 1997, 2009 American Mathematical Society\n%Copyright: (<http:\/\/www.ams.org>), with Reserved Font Name CMMI10.\n% This Font Software is licensed under the SIL Open Font License, Version 1.1.\n% This license is in the accompanying file OFL.txt, and is also\n% available with a FAQ at: http:\/\/scripts.sil.org\/OFL.\n%%EndComments","trademark":0},{"opinion":0,"patent":0,"pattern":"%%CreationDate: Mon Jul 13 16:17:00 2009\n%%Creator: David M. Jones\n%Copyright: Copyright (c) 1997, 2009 American Mathematical Society\n%Copyright: (<http:\/\/www.ams.org>), with Reserved Font Name CMR10.\n% This Font Software is licensed under the SIL Open Font License, Version 1.1.\n% This license is in the accompanying file OFL.txt, and is also\n% available with a FAQ at: http:\/\/scripts.sil.org\/OFL.\n%%EndComments","trademark":0},{"opinion":0,"patent":0,"pattern":"%%CreationDate: Mon Jul 13 16:17:00 2009\n%%Creator: David M. Jones\n%Copyright: Copyright (c) 1997, 2009 American Mathematical Society\n%Copyright: (<http:\/\/www.ams.org>), with Reserved Font Name CMSY10.\n% This Font Software is licensed under the SIL Open Font License, Version 1.1.\n% This license is in the accompanying file OFL.txt, and is also\n% available with a FAQ at: http:\/\/scripts.sil.org\/OFL.\n%%EndComments","trademark":0},{"opinion":0,"patent":0,"pattern":"%Copyright: Copyright (c) 1997, 2009 American Mathematical Society\n%Copyright: (<http:\/\/www.ams.org>), with Reserved Font Name CMSLTT10.\n% This Font Software is licensed under the SIL Open Font License, Version 1.1.\n% This license is in the accompanying file OFL.txt, and is also\n% available with a FAQ at: http:\/\/scripts.sil.org\/OFL.\n%%EndComments","trademark":0},{"opinion":0,"patent":0,"pattern":"% This license is in the accompanying file OFL.txt, and is also\n% available with a FAQ at: http:\/\/scripts.sil.org\/OFL.","trademark":0},{"opinion":0,"patent":0,"pattern":"7  ABOUT USING THE OFL FOR YOUR ORIGINAL FONTS\n\nIf you want to release your fonts under the OFL, you only need to do the following:\n\n7.1  Put your copyright and reserved font names information in the beginning of the main OFL file.\n7.2  Put your copyright and the OFL references in your various font files (such as in the copyright, license and description fields) and in your other components (build scripts, glyph databases, documentation, rendering samples, etc).\n7.3  Write an initial FONTLOG for your font and include it in the release package.\n7.4  Include the OFL in your release package.\n7.5  We also highly recommend you include the relevant practical documentation on the license by putting the OFL-FAQ in your package.\n7.6  If you wish, you can use the OFL Graphics on your web page.\n\n\n\nThat's all. If you have any more questions please get in touch with us.","trademark":0},{"opinion":0,"patent":0,"pattern":"3.1  FONTLOG for <FontFamilyName>\nThis file provides detailed information on the <FontFamilyName> font software. This information should be distributed along with the <FontFamilyName> fonts and any derivative works.\n\n3.2  Basic Font Information\n(Here is where you would describe the purpose and brief specifications for the font project, and where users can find more detailed documentation. It can also include references to how changes can be contributed back to the Original Version. You may also wish to include a short guide to the design, or a reference to such a document.)\n\n3.3  ChangeLog\n(This should list both major and minor changes, most recent first. Here are some examples:)\n\n7 February 2007 (Pat Johnson) <NewFontFamilyName> Version 1.3\n- Added Greek and Cyrillic glyphs\n- Released as \"<NewFontFamilyName>\"\n\n7 March 2006 (Fred Foobar) <NewFontFamilyName> Version 1.2\n- Tweaked contextual behaviours\n- Released as \"<NewFontFamilyName>\"\n\n1 Feb 2005 (Jane Doe) <NewFontFamilyName> Version 1.1\n- Improved build script performance and verbosity\n- Extended the smart code documentation\n- Corrected minor typos in the documentation\n- Fixed position of combining inverted breve below (U+032F)\n- Added OpenType\/Graphite smart code for Armenian\n- Added Armenian glyphs (U+0531 -> U+0587) \n- Released as \"<NewFontFamilyName>\"","trademark":0},{"opinion":0,"patent":0,"pattern":"This Font Software is licensed under the Open Font License, Version 1.1 \nThis license is copied below, and is also available with a FAQ at: \nhttp:\/\/scripts.sil.org\/OFL","trademark":0},{"opinion":0,"patent":0,"pattern":"catalogue-license ofl","trademark":0},{"opinion":0,"patent":0,"pattern":"This Font Software is licensed under the SIL Open Font License, Version 1.1.\nThis license is copied below, and is also available with a FAQ at:\nhttp:\/\/scripts.sil.org\/OFL","trademark":0},{"opinion":0,"patent":0,"pattern":"Permission is hereby granted, free of charge, to any person obtaining\na copy of the Font Software, to use, study, copy, merge, embed, modify,\nredistribute, and sell modified and unmodified copies of the Font\nSoftware, subject to the following conditions:\n\n1) Neither the Font Software nor any of its individual components,\nin Original or Modified Versions, may be sold by itself.\n\n2) Original or Modified Versions of the Font Software may be bundled,\nredistributed and\/or sold with any software, provided that each copy\ncontains the above copyright notice and this license. These can be\nincluded either as stand-alone text files, human-readable headers or\nin the appropriate machine-readable metadata fields within text or\nbinary files as long as those fields can be easily viewed by the user.\n\n3) No Modified Version of the Font Software may use the Reserved Font\nName(s) unless explicit written permission is granted by the corresponding\nCopyright Holder. This restriction only applies to the primary font name as\npresented to the users.\n\n4) The name(s) of the Copyright Holder(s) or the Author(s) of the Font\nSoftware shall not be used to promote, endorse or advertise any\nModified Version, except to acknowledge the contribution(s) of the\nCopyright Holder(s) and the Author(s) or with their explicit written\npermission.\n\n5) The Font Software, modified or unmodified, in part or in whole,\nmust be distributed entirely under this license, and must not be\ndistributed under any other license. The requirement for fonts to\nremain under this license does not apply to any document created\nusing the Font Software.\n\nTERMINATION\nThis license becomes null and void if any of the above conditions are\nnot met.\n\nDISCLAIMER\nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\nOF COPYRIGHT, PATENT, TRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL THE\nCOPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\nINCLUDING ANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\nDAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF THE USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM\nOTHER DEALINGS IN THE FONT SOFTWARE. ","trademark":0},{"opinion":0,"patent":0,"pattern":"    Copyright (c) $SKIP19\n    Licensed under the SIL Open Font License, Version 1.1.","trademark":0},{"opinion":0,"patent":0,"pattern":"COPYRIGHT \"Copyright (C) $SKIP19\nNOTICE \"Licensed under the SIL Open Font License, Version 1.1\"","trademark":0},{"opinion":0,"patent":0,"pattern":" *  Font Awesome 4.0.3 by @davegandy - http:\/\/fontawesome.io - @fontawesome\n *  License - http:\/\/fontawesome.io\/license (Font: SIL OFL 1.1, CSS: MIT License)","trademark":0},{"opinion":0,"patent":0,"pattern":"under the SIL Open Font License, Version 1.1.","trademark":0},{"opinion":0,"patent":0,"pattern":" is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the SIL Open Font License for the specific language, permissions and limitations governing your use of \n\n","trademark":0}],"risk":3,"url":"http:\/\/scripts.sil.org\/OFL"}