{"description":null,"eula":0,"name":"GPL-2.0+ OR LGPL-3.0+","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":" *     Software Foundation; either version 2 of the License, or (at\n *     your option) any later version.\n *\n * or both in parallel, as here.\n *\n * JNLIB is distributed in the hope that it will be useful, but\n * WITHOUT ANY WARRANTY; without even the implied warranty of\n * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n * General Public License for more details.\n *\n * You should have received a copies of the GNU General Public License\n * and the GNU Lesser General Public License along with this program;\n * if not, see <http:\/\/www.gnu.org\/licenses\/>.\n *\n * ALTERNATIVELY, this file may be distributed under the terms of the\n * following license, in which case the provisions of this license are\n * required INSTEAD OF the GNU Lesser General License or the GNU\n * General Public License. If you wish to allow use of your version of\n * this file only under the terms of the GNU Lesser General License or\n * the GNU General Public License, and not to allow others to use your\n * version of this file under the terms of the following license,\n * indicate your decision by deleting this paragraph and the license\n * below.\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions\n * are met:\n *\n * 1. Redistributions of source code must retain the above copyright\n *    notice, and the entire permission notice in its entirety,\n *    including the disclaimer of warranties.\n * 2. Redistributions in binary form must reproduce the above copyright\n *    notice, this list of conditions and the following disclaimer in the\n *    documentation and\/or other materials provided with the distribution.\n * 3. The name of the author may not be used to endorse or promote\n *    products derived from this software without specific prior\n *    written permission.\n *\n * THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED\n * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\n * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n * DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,\n * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\n * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\n * OF THE POSSIBILITY OF SUCH DAMAGE.\n *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"\tChange library license to LGPLv3+\/GPLv2+.\n\t* COPYING.GPLv2, COPYING.GPLv3, COPYING.LGPLv3: New.\n\t* COPYING: Replace text by a reference to the new files.","trademark":0},{"opinion":0,"patent":0,"pattern":" * Changed the license of the library from GPLv3 to LGPLv3\/GPLv2; see\n   the file AUTHORS for details.","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/ Eigen is free software; you can redistribute it and\/or\n\/\/ modify it under the terms of the GNU Lesser General Public\n\/\/ License as published by the Free Software Foundation; either\n\/\/ version 3 of the License, or (at your option) any later version.\n\/\/\n\/\/ Alternatively, you can redistribute it and\/or\n\/\/ modify it under the terms of the GNU General Public License as\n\/\/ published by the Free Software Foundation; either version 2 of\n\/\/ the License, or (at your option) any later version.\n\/\/\n\/\/ Eigen is distributed in the hope that it will be useful, but WITHOUT ANY\n\/\/ WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS\n\/\/ FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License or the ","trademark":0},{"opinion":0,"patent":0,"pattern":"The library is dual-licensed under LGPLv3 or GPLv2, see $SKIP5 for detailed information.","trademark":0},{"opinion":0,"patent":0,"pattern":"   This file is free software; you can redistribute it and\/or modify\n   it under the terms of either\n\n     * the GNU Lesser General Public License as published by the Free\n       Software Foundation; either version 3 of the License, or (at\n       your option) any later version\n\n   or\n\n     * the GNU General Public License as published by the Free\n       Software Foundation; either version 2 of the License, or (at\n       your option) any later version\n\n   or both in parallel, as here.\n\n   $SKIP4 is distributed in the hope that it will be useful, but\n   WITHOUT ANY WARRANTY; without even the implied warranty of\n   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n   General Public License for more details.\n\n   You should have received copies of the GNU General Public License and\n   the GNU Lesser General Public License along with ","trademark":0},{"opinion":0,"patent":0,"pattern":" is free software; you can redistribute it and\/or modify\n   it under the terms of either\n\n     * the GNU Lesser General Public License as published by the Free\n       Software Foundation; either version 3 of the License, or (at\n       your option) any later version\n\n   or\n\n     * the GNU General Public License as published by the Free\n       Software Foundation; either version 2 of the License, or (at\n       your option) any later version\n\n   or both in parallel, as here.\n\n   The following license texts are included in the following files:\n      - COPYING.LGPLv3: GNU Lesser General Public License version 3\n      - COPYING.GPLv2: GNU General Public License version 2\n      - COPYING.GPLv3: GNU General Public License version 3\n","trademark":0},{"opinion":0,"patent":0,"pattern":"dnl  The GNU MP Library is free software; you can redistribute it and\/or modify\ndnl  it under the terms of either:\ndnl\ndnl    * the GNU Lesser General Public License as published by the Free\ndnl      Software Foundation; either version 3 of the License, or (at your\ndnl      option) any later version.\ndnl\ndnl  or\ndnl\ndnl    * the GNU General Public License as published by the Free Software\ndnl      Foundation; either version 2 of the License, or (at your option) any\ndnl      later version.\ndnl\ndnl  or both in parallel, as here.\ndnl\ndnl  The GNU MP Library is distributed in the hope that it will be useful, but\ndnl  WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY\ndnl  or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License\ndnl  for more details.\ndnl\ndnl  You should have received copies of the GNU General Public License and the\ndnl  GNU Lesser General Public License along with the GNU MP Library.  If not,\ndnl  see https:\/\/www.gnu.org\/licenses\/.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"   is free software; you can redistribute it and\/or modify\n  it under the terms of either\n\n    - the GNU Lesser General Public License as published by the Free\n      Software Foundation; either version 3 of the License, or (at\n      your option) any later version.\n\n  or\n\n    - the GNU General Public License as published by the Free\n      Software Foundation; either version 2 of the License, or (at\n      your option) any later version.\n\n  or both in parallel, as here.\n\n  $SKIP4 is distributed in the hope that it will be useful, but WITHOUT\n  ANY WARRANTY; without even the implied warranty of MERCHANTABILITY\n  or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public\n  License for more details.","trademark":0}],"risk":2,"url":null}