{"description":null,"eula":0,"name":"GPL-2.0 WITH OpenSSL-exception","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":"\/* Copyright (C) $SKIP19\n *\n * This program is free software; you can redistribute it and\/or\n * modify it under the terms of the GNU General Public License as\n * published by the Free Software Foundation; either version 2 of the\n * License, or (at your option) any later version.\n *\n * This program is distributed in the hope that it will be useful, but\n * is provided AS IS, WITHOUT ANY WARRANTY; without even the implied\n * warranty of MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, and\n * NON-INFRINGEMENT.  See the GNU General Public License for more details.\n *\n * You should have received a copy of the GNU General Public License\n * along with this program; if not, write to the Free Software\n * Foundation, Inc., 59 Temple Place - Suite 330, Boston,\n * MA 02111-1307, USA.\n *\n * In addition, as a special exception, $SKIP5\n * gives permission to link the code of this program with any\n * version of the OpenSSL library which is distributed under a\n * license identical to that listed in the included LICENSE.OpenSSL\n * file, and distribute linked combinations including the two.\n * You must obey the GNU General Public License in all respects\n * for all of the code used other than OpenSSL.  If you modify\n * this file, you may extend this exception to your version of the\n * file, but you are not obligated to do so.  If you do not wish to\n * do so, delete this exception statement from your version.","trademark":0},{"opinion":0,"patent":0,"pattern":" * Copyright (C) $SKIP19\n *  \n * This program is free software; you can redistribute it and\/or modify\n * it under the terms of the GNU General Public License as published by\n * the Free Software Foundation; either version 2 of the License, or\n * (at your option) any later version.\n *\n * This program is distributed in the hope that it will be useful,\n * but WITHOUT ANY WARRANTY; without even the implied warranty of\n * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n * GNU General Public License for more details.\n *\n * You should have received a copy of the GNU General Public License\n * along with this program; if not, write to the Free Software\n * Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307, USA.\n *\n * As a special exemption, $SKIP5\n * and other respective copyright holders give permission to link this program\n * with OpenSSL, and distribute the resulting executable, without including\n * the source code for OpenSSL in the source distribution.\n *\/","trademark":0},{"opinion":0,"patent":0,"pattern":" * In addition, as a special exception, the copyright holders give\n * permission to link the code of portions of this program with the\n * OpenSSL library under certain conditions as described in each\n * individual source file, and distribute linked combinations\n * including the two.\n * You must obey the GNU General Public License in all respects\n * for all of the code used other than OpenSSL.  If you modify\n * file(s) with this exception, you may extend this exception to your\n * version of the file(s), but you are not obligated to do so.  If you\n * do not wish to do so, delete this exception statement from your\n * version.  If you delete this exception statement from all source\n * files in the program, then also delete it here.","trademark":0},{"opinion":0,"patent":0,"pattern":"\/****************************************************************************\n**\n** In addition, as a special exception, $SKIP10 gives permission to link\n** the code of its release of Qt with the OpenSSL project's \"OpenSSL\" library\n** (or modified versions of the \"OpenSSL\" library that use the same license\n** as the original version), and distribute the linked executables.\n**\n** You must comply with the GNU General Public License version 2 in all\n** respects for all of the code used other than the \"OpenSSL\" code.  If you\n** modify this file, you may extend this exception to your version of the file,\n** but you are not obligated to do so.  If you do not wish to do so, delete\n** this exception statement from your version of this file.\n**\n****************************************************************************\/","trademark":0},{"opinion":0,"patent":0,"pattern":"In addition, as a special exception, Trolltech gives permission to link the\ncode of its release of Qt with the OpenSSL project's \"OpenSSL\" library (or\nmodified versions of it that use the same license as the \"OpenSSL\"\nlibrary), and distribute the linked executables. You must comply with the GNU\nGeneral Public License version 2 or the GNU General Public License version 3\nin all respects for all of the code used other than the \"OpenSSL\" code.  If\nyou modify this file, you may extend this exception to your version of the\nfile, but you are not obligated to do so.  If you do not wish to do so,\ndelete this exception statement from your version of this file.","trademark":0},{"opinion":0,"patent":0,"pattern":"In addition, as a special exception, Nokia gives permission to link the\ncode of its release of Qt with the OpenSSL project's \"OpenSSL\" library (or\nmodified versions of it that use the same license as the \"OpenSSL\"\nlibrary), and distribute the linked executables.  You must comply with the\nGNU General Public License versions 2.0 or 3.0 in all respects for all of\nthe code used other than the \"OpenSSL\" code.  If you modify this file, you\nmay extend this exception to your version of the file, but you are not\nobligated to do so.  If you do not wish to do so, delete this exception\nstatement from your version of this file.","trademark":0},{"opinion":0,"patent":0,"pattern":"In addition, as a special exception, the author gives permission to\nlink the code of this program with the OpenSSL library released by\nthe OpenSSL Project (or with modified versions of OpenSSL that use\nthe same license as OpenSSL), and distribute linked combinations\nincluding the two.  You must obey the GNU General Public License in\nall respects for all of the code used other than OpenSSL.  If you\nmodify this software, you may extend this exception to your version of,\nbut you are not obligated to do so.  If you do not wish to do so,\ndelete this exception statement from your version.","trademark":0},{"opinion":0,"patent":0,"pattern":"This program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along\nwith this program; if not, write to the Free Software Foundation, Inc.,\n51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nIn addition to these license terms, the author grants the following\nadditional rights:\n\nIf you modify this program, or any covered work, by linking or\ncombining it with the OpenSSL project's OpenSSL library (or a\nmodified version of that library), containing parts covered by the\nterms of the OpenSSL or SSLeay licenses, the author\ngrants you additional permission to convey the resulting work.\nCorresponding Source for a non-source form of such a combination\nshall include the source code for the parts of OpenSSL used as well\nas that of the covered work.\n\nYou may at your option choose to remove this additional permission from\nthe work, or from any part of it.\n\nIt is possible to build this program in a way that it loads OpenSSL\nlibraries at run-time. If doing so, the following notices are required\nby the OpenSSL and SSLeay licenses:\n\nThis product includes software developed by the OpenSSL Project\nfor use in the OpenSSL Toolkit. (http:\/\/www.openssl.org\/)","trademark":0},{"opinion":0,"patent":0,"pattern":" *   You should have received a copy of the GNU General Public License     *\n *   along with this program; if not, write to the                         *\n *   Free Software Foundation, Inc.,                                       *\n *   51 Franklin Street, Suite 500, Boston, MA 02110-1335, USA.            *\n *                                                                         *\n *   OpenSSL linking exception                                             *\n *   --------------------------                                            *\n *   If you modify this Program, or any covered work, by linking or        *\n *   combining it with the OpenSSL project's \"OpenSSL\" library (or a       *\n *   modified version of that library), containing parts covered by        *\n *   the terms of OpenSSL\/SSLeay license, the licensors of this            *\n *   Program grant you additional permission to convey the resulting       *\n *   work. Corresponding Source for a non-source form of such a            *\n *   combination shall include the source code for the parts of the        *\n *   OpenSSL library used as well as that of the covered work.             *\n ***************************************************************************\/","trademark":0},{"opinion":0,"patent":0,"pattern":" *\n * This program is distributed in the hope that it will be useful,\n * but WITHOUT ANY WARRANTY; without even the implied warranty of\n * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n * GNU General Public License for more details.\n *\n * You should have received a copy of the GNU General Public License\n * along with this program; if not, write to the Free Software\n * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n *\n * In addition, as a special exception, the copyright holders give\n * permission to link the code of portions of this program with the\n * OpenSSL library under certain conditions as described in each\n * individual source file, and distribute linked combinations\n * including the two.\n *\n * You must obey the GNU General Public License in all respects\n * for all of the code used other than OpenSSL.\n *\/","trademark":0},{"opinion":0,"patent":0,"pattern":"** In addition, as a special exception, the copyright holders listed above give\n** permission to link the code of its release of Qt with the OpenSSL project's\n** \"OpenSSL\" library (or modified versions of the \"OpenSSL\" library that use the\n** same license as the original version), and distribute the linked executables.\n**\n** You must comply with the GNU General Public License version 2 in all\n** respects for all of the code used other than the \"OpenSSL\" code.  If you\n** modify this file, you may extend this exception to your version of the file,\n** but you are not obligated to do so.  If you do not wish to do so, delete\n** this exception statement from your version of this file.","trademark":0},{"opinion":0,"patent":0,"pattern":" * The nsock parallel socket event library is (C) $SKIP19   *\n * LLC This library is free software; you may redistribute and\/or          *\n * modify it under the terms of the GNU General Public License as          *\n * published by the Free Software Foundation; Version 2.  This guarantees  *\n * your right to use, modify, and redistribute this software under certain *\n * conditions.  If this license is unacceptable to you, Insecure.Com LLC   *\n * may be willing to sell alternative licenses (contact                    *\n * sales@insecure.com ).                                                   *\n *                                                                         *\n * As a special exception to the GPL terms, Insecure.Com LLC grants        *\n * permission to link the code of this program with any version of the     *\n * OpenSSL library which is distributed under a license identical to that  *\n * listed in the included docs\/licenses\/OpenSSL.txt file, and distribute   *\n * linked combinations including the two. You must obey the GNU GPL in all *\n * respects for all of the code used other than OpenSSL.  If you modify    *\n * this file, you may extend this exception to your version of the file,   *\n * but you are not obligated to do so.                                     *\n *                                                                         *\n * If you received these files with a written license agreement stating    *\n * terms other than the (GPL) terms above, then that alternative license   *\n * agreement takes precedence over this comment.                           *","trademark":0},{"opinion":0,"patent":0,"pattern":"As a special exception, the authors give permission to link this program\nwith the OpenSSL library and distribute the resulting binary.","trademark":0},{"opinion":0,"patent":0,"pattern":"This product includes software developed by the OpenSSL Project\nfor use in the OpenSSL Toolkit (http:\/\/www.openssl.org\/).\n\nIn binary form, this product includes software that is licensed under the\nterms of the GNU General Public License, version 2, with a linking exception,\nwhich can be obtained from the [upstream repository][1].","trademark":0},{"opinion":0,"patent":0,"pattern":"This program is free software; you can redistribute it and\/or modify\nit under the terms of version 2 of the GNU General Public License as\npublished by the Free Software Foundation.\n\nIn addition, for the avoidance of any doubt, permission is granted to\nlink this program with OpenSSL and to (re)distribute the binaries\nproduced as the result of such linking.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program; if not, write to the Free Software\nFoundation, Inc.,","trademark":0},{"opinion":0,"patent":0,"pattern":"    This program is free software; you can redistribute it and\/or modify\n    it under the terms of the GNU General Public License version 2\n    as published by the Free Software Foundation\n\n    Additionally, the license of this program contains a special\n    exception which allows to distribute the program in binary form when\n    it is linked against OpenSSL.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program; if not, write to the Free Software\n    Foundation, Inc., ","trademark":0},{"opinion":0,"patent":0,"pattern":" * Released under the terms of GNU GPL v.2\n * (http:\/\/www.gnu.org\/licenses\/old-licenses\/gpl-2.0.html)\n * with the additional exemption that\n * compiling, linking, and\/or using OpenSSL is allowed.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"This program is free software; you can redistribute it and\/or\nmodify it under the terms of version 2 of the GNU General Public\nLicense.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou will find the GNU General Public License version 2 in the file\nLICENSE or at http:\/\/www.gnu.org\/licenses\/gpl-2.0.html\n\nIn addition, as a special exception, the copyright holders give\npermission to link the code of portions of this program with the\nOpenSSL project's \"OpenSSL\" library (or with modified versions of it\nthat use the same license as the \"OpenSSL\" library), and distribute\nthe linked executables.  You must obey the GNU General Public License\nin all respects for all of the code used other than \"OpenSSL\".  If you\nmodify this file, you may extend this exception to your version of the\nfile, but you are not obligated to do so.  If you do not wish to do\nso, delete this exception statement from your version.","trademark":0},{"opinion":0,"patent":0,"pattern":" On Debian based systems the full text of the GNU General Public License version\n 2 can be found in the file `\/usr\/share\/common-licenses\/GPL-2`.\n .\n In addition, as a special exception, the copyright holders give\n permission to link the code of portions of this program with the\n OpenSSL project's \"OpenSSL\" library (or with modified versions of it\n that use the same license as the \"OpenSSL\" library), and distribute\n the linked executables.  You must obey the GNU General Public License\n in all respects for all of the code used other than \"OpenSSL\".  If you\n modify this file, you may extend this exception to your version of the\n file, but you are not obligated to do so.  If you do not wish to do\n so, delete this exception statement from your version.","trademark":0},{"opinion":0,"patent":0,"pattern":"\/***************************************************************************\n    Copyright (C) 2003-2009 Robby Stephenson <robby@periapsis.org>\n ***************************************************************************\/\n\n\/***************************************************************************\n *                                                                         *\n *   This program is free software; you can redistribute it and\/or         *\n *   modify it under the terms of the GNU General Public License as        *\n *   published by the Free Software Foundation; either version 2 of        *\n *   the License or (at your option) version 3 or any later version        *\n *   accepted by the membership of KDE e.V. (or its successor approved     *\n *   by the membership of KDE e.V.), which shall act as a proxy            *\n *   defined in Section 14 of version 3 of the license.                    *\n *                                                                         *\n *   This program is distributed in the hope that it will be useful,       *\n *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *\n *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *\n *   GNU General Public License for more details.                          *\n *                                                                         *\n *   You should have received a copy of the GNU General Public License     *\n *   along with this program.  If not, see <http:\/\/www.gnu.org\/licenses\/>. *\n *                                                                         *\n *   In addition, as a special exception, the author gives permission to   *\n *   link the code of this program with the OpenSSL library released by    *\n *   the OpenSSL Project (or with modified versions of OpenSSL that use    *\n *   the same license as OpenSSL), and distribute linked combinations      *\n *   including the two.  You must obey the GNU General Public License in   *\n *   all respects for all of the code used other than OpenSSL.  If you     *\n *   modify this file, you may extend this exception to your version of    *\n *   the file, but you are not obligated to do so.  If you do not wish to  *\n","trademark":0}],"risk":2,"url":null}