{"description":null,"eula":0,"name":"LGPL-2.1+ OR Apache-2.0","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":" * This software consists of voluntary contributions made by many\n * individuals on behalf of the Apache Software Foundation.  For more\n * information on the Apache Software Foundation, please see\n * <http:\/\/www.apache.org\/>.\n *\n * [Additional notices, if required by prior licensing conditions]\n *\n * Alternatively, the contents of this file may be used under the\n * terms of the GNU Lesser General Public License Version 2 or later\n * (the \"LGPL\"), in which case the provisions of the LGPL are \n * applicable instead of those above.  See terms of LGPL at\n * <http:\/\/www.gnu.org\/copyleft\/lesser.txt>.\n * If you wish to allow use of your version of this file only under \n * the terms of the LGPL and not to allow others to use your version\n * of this file under the Apache Software License, indicate your \n * decision by deleting the provisions above and replace them with \n * the notice and other provisions required by the LGPL.  If you do \n * not delete the provisions above, a recipient may use your version \n * of this file under either the Apache Software License or the LGPL.","trademark":0},{"opinion":0,"patent":0,"pattern":"* Distributable under the terms of either the Apache License (Version 2.0) or \n* the GNU Lesser General Public License, as specified in the COPYING file.","trademark":0},{"opinion":0,"patent":0,"pattern":"   License changed to LGPL 2.1\/Apache 2","trademark":0},{"opinion":0,"patent":0,"pattern":"License\n\n   This library is free software \/ open source software released under\n   the LGPL (GPL) or Apache 2.0 licenses. See LICENSE.html for full\n   details.","trademark":0},{"opinion":0,"patent":0,"pattern":"\t* Switched to LGPL \/ Apache 2.0 license in the sources","trademark":0},{"opinion":0,"patent":0,"pattern":"The CLucene Core Library uses a dual license strategy for the source code. \nThese licenses are the GNU Lesser General Public License (LGPL) and the Apache\nLicense (Version 2.0). Users can choose the license they wish to distribute\ntheir software under. This means that you do not need to abide by *both*\nlicenses, but rather than you can choose the license which most suits your\nneeds.\n\nTo rephrase this and to make it perfectly clear:\nCLucene is distributed under the GNU Lesser General Public License (LGPL) \n\t*or*\nthe Apache License, Version 2.0\n\nHowever, we are an open source project, and we encourage users to use the LGPL \nlicense and participate fully in the free software community. Dual licensing\nof the CLucene source code provides open and free access to the technology both\nfor the GPL community and for other developers or companies that cannot use the\nGPL.\n\nYou can freely modify, extend, and improve the CLucene source code. The only\nquestion is whether or not you must provide the source code and contribute\nmodifications to the community. The GNU and Apache licenses allow different\nranges of flexibility in this regard, but in the end, regardless of the license\nused, we highly recommend that you submit any bugs, incompatibilities or\nadded features.\n\nNote that this same license does *not* apply to the CLucene Contributions\npackage. You should read the COPYING file in that directory or package for\nmore information.","trademark":0},{"opinion":0,"patent":0,"pattern":"CLucene is distributed under the GNU Lesser General Public License (LGPL) \n\t*or*\nthe Apache License, Version 2.0\nSee the LGPL.license and APACHE.license for the respective license information.\nRead COPYING for more about the license.","trademark":0},{"opinion":0,"patent":0,"pattern":"This source code is dual-licensed.\n==================================\n\nLGPL:\n    This library is free software; you can redistribute it and\/or\n    modify it under the terms of the GNU Lesser General Public\n    License as published by the Free Software Foundation; either\n    version 3 of the License, or (at your option) any later version.\n\n    See the file LGPL.licence\n\nApache 2.0:\n    Licensed under the Apache License, Version 2.0 (the \"License\");\n    you may not use this file except in compliance with the License.\n\n    See the file APACHE.licence ","trademark":0},{"opinion":0,"patent":0,"pattern":"\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\n\/\/ Copyright (c) $SKIP19. All rights reserved.\n\/\/ Distributable under the terms of either the Apache License (Version 2.0)\n\/\/ or the GNU Lesser General Public License.\n\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/","trademark":0},{"opinion":0,"patent":0,"pattern":"NOTE: as of JNA 4.0, JNA is now dual-licensed under LGPL and ASL (see LICENSE).","trademark":0},{"opinion":0,"patent":0,"pattern":"JNA is dual-licensed under 2 alternative Open Source\/Free \nlicenses: LGPL 2.1 and Apache License 2.0. (starting with\nJNA version 4.0.0). \n\nWhat this means is that one can choose either one of these\nlicenses (for purposes of re-distributing JNA; usually by\nincluding it as one of jars another application or\nlibrary uses) by downloading corresponding jar file,\nusing it, and living happily everafter. \n\nYou may obtain a copy of the LGPL License at:\n\nhttp:\/\/www.gnu.org\/licenses\/licenses.html\n\nA copy is also included in the downloadable source code package\ncontaining JNA, in file \"LGPL2.1\", under the same directory\nas this file.\n\nYou may obtain a copy of the ASL License at:\n\nhttp:\/\/www.apache.org\/licenses\/\n\nA copy is also included in the downloadable source code package\ncontaining JNA, in file \"ASL2.0\", under the same directory\nas this file. ","trademark":0},{"opinion":0,"patent":0,"pattern":"This library is licensed under the LGPL, version 2.1 or later, and (from version 4.0 onward) the Apache Software License, version 2.0. Commercial license arrangements are negotiable.","trademark":0},{"opinion":0,"patent":0,"pattern":"      <zipfileset dir=\".\" includes=\"build.xml,${pom},LICENSE,LGPL2.1,ASL2.0\"\/>","trademark":0}],"risk":1,"url":null}