{"description":null,"eula":0,"name":"IETF","nonfree":0,"patterns":[{"opinion":0,"patent":0,"pattern":" *    Copyright (C) $SKIP10.  All Rights Reserved.\n *\n *    This document and translations of it may be copied and furnished\n *    to others, and derivative works that comment on or otherwise\n *    explain it or assist in its implementation may be prepared,\n *    copied, published and distributed, in whole or in part, without\n *    restriction of any kind, provided that the above copyright\n *    notice and this paragraph are included on all such copies and\n *    derivative works.  However, this document itself may not be\n *    modified in any way, such as by removing the copyright notice or\n *    references to the Internet Society or other Internet\n *    organizations, except as needed for the purpose of developing\n *    Internet standards in which case the procedures for copyrights\n *    defined in the Internet Standards process must be followed, or\n *    as required to translate it into languages other than English.\n *\n *    The limited permissions granted above are perpetual and will not be\n *    revoked by the Internet Society or its successors or assigns.\n *\n *    This document and the information contained herein is provided\n *    on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET\n *    ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR\n *    IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE\n *    OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY\n *    IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A\n *    PARTICULAR PURPOSE.","trademark":0},{"opinion":0,"patent":0,"pattern":"   The $SKIP10 invites any interested party to bring to its attention any\n   copyrights, patents or patent applications, or other proprietary\n   rights which may cover technology that may be required to practice\n   this standard.  Please address the information to the IETF Executive\n   Director.","trademark":0},{"opinion":0,"patent":0,"pattern":"  Some code for arc handling in this module is derived from code with\n  the following license:\n\n  \\legalese\n  Copyright  $SKIP19\n\n  Permission to use, copy, modify, distribute, and sell this software\n  and its documentation for any purpose is hereby granted without\n  fee, provided that the above copyright notice appear in all copies\n  and that both that copyright notice and this permission notice\n  appear in supporting documentation, and that the name of\n  Information Sciences Institute not be used in advertising or\n  publicity pertaining to distribution of the software without\n  specific, written prior permission.  Information Sciences Institute\n  makes no representations about the suitability of this software for\n  any purpose.  It is provided \"as is\" without express or implied\n  warranty.\n\n  INFORMATION SCIENCES INSTITUTE DISCLAIMS ALL WARRANTIES WITH REGARD\n  TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF\n  MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL INFORMATION SCIENCES\n  INSTITUTE BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL\n  DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA\n  OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER\n  TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\n  PERFORMANCE OF THIS SOFTWARE.\n  \\endlegalese","trademark":0},{"opinion":0,"patent":0,"pattern":"   The IETF invites any interested party to bring to its attention any\n   copyrights, patents or patent applications, or other proprietary\n   rights that may cover technology that may be required to implement\n   this standard.  Please address the information to the IETF at ietf-\n   ipr@ietf.org.\n\nFull Copyright Statement\n\n   Copyright (C) The Internet Society (2006).\n\n   This document is subject to the rights, licenses and restrictions\n   contained in BCP 78, and except as set forth therein, the authors\n   retain all their rights.\n\n   This document and the information contained herein are provided on\n   an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE\/SHE\n   REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE\n   INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR\n   IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF\n   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED\n   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.","trademark":0},{"opinion":0,"patent":0,"pattern":"   By submitting this Internet-Draft, each author represents that any\n   applicable patent or other IPR claims of which he or she is aware\n   have been or will be disclosed, and any of which he or she become\n   aware will be disclosed, in accordance with RFC 3668.\n\n   This document is intended to be published as a Standards Track RFC,\n   replacing RFC 2254.  Distribution of this memo is unlimited.\n   Technical discussion of this document will take place on the IETF\n   LDAP (v3) Revision (ldapbis) Working Group mailing list\n   <ietf-ldapbis@openldap.org>.  Please send editorial comments directly\n   to the editor <mcs@pearlcrescent.com>.","trademark":0},{"opinion":0,"patent":0,"pattern":"   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,\n   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE\n   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED\n   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\nIntellectual Property\n\n   The IETF takes no position regarding the validity or scope of any\n   Intellectual Property Rights or other rights that might be claimed to\n   pertain to the implementation or use of the technology described in\n   this document or the extent to which any license under such rights\n   might or might not be available; nor does it represent that it has\n   made any independent effort to identify any such rights.  Information\n   on the procedures with respect to rights in RFC documents can be\n   found in BCP 78 and BCP 79.\n\n   Copies of IPR disclosures made to the IETF Secretariat and any\n   assurances of licenses to be made available, or the result of an","trademark":0},{"opinion":0,"patent":0,"pattern":"\n   By submitting this Internet-Draft, each author represents that any\n   applicable patent or other IPR claims of which he or she is aware\n   have been or will be disclosed, and any of which he or she become\n   aware will be disclosed, in accordance with RFC 3668.\n\n   This document is intended to be published as a Standards Track RFC,\n   replacing RFC 2255.  Distribution of this memo is unlimited.\n   Technical discussion of this document will take place on the IETF\n   LDAP (v3) Revision (ldapbis) Working Group mailing list\n   <ietf-ldapbis@openldap.org>.  Please send editorial comments directly\n   to the editor <mcs@pearlcrescent.com>.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"\n     patent or other IPR claims of which I am aware have been disclosed,\n     or will be disclosed, and any of which I become aware will be\n     disclosed, in accordance with RFC 3668.\n\n     The IETF takes no position regarding the validity or scope of any\n     Intellectual Property Rights or other rights that might be claimed\n     to pertain to the implementation or use of the technology described\n     in this document or the extent to which any license under such\n     rights might or might not be available; nor does it represent that\n     it has made any independent effort to identify any such rights.\n     Information on the procedures with respect to rights in RFC\n     documents can be found in BCP 78 and BCP 79.\n\n     The IETF invites any interested party to bring to its attention any\n     copyrights, patents or patent applications, or other proprietary\n     rights that may cover technology that may be required to implement\n     this standard.  Please address the information to the IETF at\n     ietf-ipr@ietf.org.\n\n     Copies of IPR disclosures made to the IETF Secretariat and any\n     assurances of licenses to be made available, or the result of an\n     attempt made to obtain a general license or permission for the use\n     of such proprietary rights by implementers or users of this\n     specification can be obtained from the IETF on-line IPR repository\n     at http:\/\/www.ietf.org\/ipr.","trademark":0},{"opinion":0,"patent":0,"pattern":"\n   This document is an Internet-Draft and is subject to all provisions\n   of Section 3 of RFC 3667.  By submitting this Internet-Draft, each\n   author represents that any applicable patent or other IPR claims of\n   which he or she is aware have been or will be disclosed, and any of\n   which he or she become aware will be disclosed, in accordance with\n   RFC 3668.\n\n\n   Internet-Drafts are working documents of the Internet Engineering\n   Task Force (IETF), its areas, and its working groups.  Note that\n   other groups may also distribute working documents as\n   Internet-Drafts.\n","trademark":0},{"opinion":0,"patent":0,"pattern":"  The IETF invites any interested party to bring to its attention any\n  copyrights, patents or patent applications, or other proprietary\n  rights that may cover technology that may be required to implement\n  this standard.  Please address the information to the IETF at","trademark":0},{"opinion":0,"patent":0,"pattern":"  Intellectual Property Rights or other rights that might be claimed to\n  pertain to the implementation or use of the technology described in\n  this document or the extent to which any license under such rights\n  might or might not be available; nor does it represent that it has\n  made any independent effort to identify any such rights.  Information\n  on the procedures with respect to rights in RFC documents can be found\n  in BCP 78 and BCP 79.\n\n  Copies of IPR disclosures made to the IETF Secretariat and any\n  assurances of licenses to be made available, or the result of an\n  attempt made to obtain a general license or permission for the use of\n  such proprietary rights by implementers or users of this specification\n  can be obtained from the IETF on-line IPR repository at\n  http:\/\/www.ietf.org\/ipr.\n\n  The IETF invites any interested party to bring to its attention any\n  copyrights, patents or patent applications, or other proprietary\n  rights that may cover technology that may be required to implement\n  this standard.  Please address the information to the IETF at\n  ietf-ipr@ietf.org.\n\n\n\nFull Copyright\n\n  Copyright (C) The Internet Society (2006).\n\n  This document is subject to the rights, licenses and restrictions\n  contained in BCP 78, and except as set forth therein, the authors\n  retain all their rights.\n\n  This document and the information contained herein are provided on an\n  \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE\/SHE REPRESENTS\n  OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET\n  ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,\n  INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE\n  INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED\n  WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.","trademark":0},{"opinion":0,"patent":0,"pattern":"Intellectual Property Rights\n\n  The IETF takes no position regarding the validity or scope of any\n  Intellectual Property Rights or other rights that might be claimed to\n  pertain to the implementation or use of the technology described in\n  this document or the extent to which any license under such rights\n  might or might not be available; nor does it represent that it has\n  made any independent effort to identify any such rights.  Information\n  on the procedures with respect to rights in RFC documents can be found\n  in BCP 78 and BCP 79.","trademark":0},{"opinion":0,"patent":0,"pattern":"Portions Copyright $SKIP8, $SKIP10.  All Rights Reserved.\n\nThis document and translations of it may be copied and furnished\nto others, and derivative works that comment on or otherwise explain\nit or assist in its implementation may be prepared, copied, published\nand distributed, in whole or in part, without restriction of any\nkind, provided that the above copyright notice and this paragraph  \nare included on all such copies and derivative works.  However,\nthis document itself may not be modified in any way, such as by      \nremoving the copyright notice or references to the Internet Society\nor other Internet organizations, except as needed for the  purpose\nof developing Internet standards in which case the procedures for\ncopyrights defined in the Internet Standards process must be\nfollowed, or as required to translate it into languages other than\nEnglish.\n\nThe limited permissions granted above are perpetual and will not\nbe revoked by the Internet Society or its successors or assigns.\n\nThis document and the information contained herein is provided on\nan \"AS IS\" basis and THE AUTHORS, THE INTERNET SOCIETY, AND THE\nINTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE\nOF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY       \nIMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR\nPURPOSE.","trademark":0},{"opinion":0,"patent":0,"pattern":"   attempt made to obtain a general license or permission for the use of\n   such proprietary rights by implementers or users of this\n   specification can be obtained from the IETF on-line IPR repository at\n   http:\/\/www.ietf.org\/ipr.\n\n   The IETF invites any interested party to bring to its attention any\n   copyrights, patents or patent applications, or other proprietary\n   rights that may cover technology that may be required to implement\n   this standard.  Please address the information to the IETF at\n   ietf-ipr@ietf.org.","trademark":0},{"opinion":0,"patent":0,"pattern":"  pertain to the implementation or use of the technology described in\n  this document or the extent to which any license under such rights\n  might or might not be available; nor does it represent that it has\n  made any independent effort to identify any such rights.  Information\n  on the procedures with respect to rights in RFC documents can be found\n  in BCP 78 and BCP 79.\n\n  Copies of IPR disclosures made to the IETF Secretariat and any\n  assurances of licenses to be made available, or the result of an","trademark":0},{"opinion":0,"patent":0,"pattern":"   This document is subject to BCP 78 and the IETF Trust's Legal\n   Provisions Relating to IETF Documents in effect on the date of\n   publication of this document (http:\/\/trustee.ietf.org\/license-info).\n   Please review these documents carefully, as they describe your rights\n   and restrictions with respect to this document.\n\n   This document may contain material from IETF Documents or IETF\n   Contributions published or made publicly available before November\n   10, 2008.  The person(s) controlling the copyright in some of this\n   material may not have granted the IETF Trust the right to allow\n   modifications of such material outside the IETF Standards Process.\n   Without obtaining an adequate license from the person(s) controlling\n   the copyright in such materials, this document may not be modified\n   outside the IETF Standards Process, and derivative works of it may\n   not be created outside the IETF Standards Process, except to format\n   it for publication as an RFC or to translate it into languages other\n   than English.","trademark":0},{"opinion":0,"patent":0,"pattern":"  This document and translations of it may be copied and furnished to\n  others, and derivative works that comment on or otherwise explain it\n  or assist in its implmentation may be prepared, copied, published and\n  distributed, in whole or in part, without restriction of any kind,\n  provided that the above copyright notice and this paragraph are\n  included on all such copies and derivative works.  However, this\n  document itself may not be modified in any way, such as by removing\n  the copyright notice or references to the Internet Society or other\n  Internet organizations, except as needed for the  purpose of\n  developing Internet standards in which case the procedures for\n  copyrights defined in the Internet Standards process must be followed,\n  or as required to translate it into languages other than English.","trademark":0},{"opinion":0,"patent":0,"pattern":"   INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR \n   IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF\n   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED\n   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\nIntellectual Property\n\n   The IETF takes no position regarding the validity or scope of any\n   Intellectual Property Rights or other rights that might be claimed to\n   pertain to the implementation or use of the technology described in\n   this document or the extent to which any license under such rights","trademark":0},{"opinion":0,"patent":0,"pattern":"   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE\n   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED\n   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\nIntellectual Property\n\n   The IETF takes no position regarding the validity or scope of any\n   Intellectual Property Rights or other rights that might be claimed to\n   pertain to the implementation or use of the technology described in\n   this document or the extent to which any license under such rights\n   might or might not be available; nor does it represent that it has\n   made any independent effort to identify any such rights.  Information\n   on the ISOC's procedures with respect to rights in ISOC Documents can","trademark":0},{"opinion":0,"patent":0,"pattern":"\nFull Copyright Statement Copyright (C) The Internet Society (2007). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights. This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE\/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\nIntellectual Property The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79. Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http:\/\/www.ietf.org\/ipr. The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.","trademark":0}],"risk":2,"url":null}